user.hello=Bonjour
user.list=Liste des utilisateurs
user.findOne=Trouver un utilisateur


home.headband.comeback=La conf\u00E9rence avec des cr\u00EApes et du c\u0153ur
home.sponsor.title=Sponsors de l'\u00E9dition 2017
home.headband.date=20-21 avril 2017
home.sponsor.annonce=Profitez de cet \u00E9venement pour mettre en avant votre soci\u00E9t\u00E9. Nous proposons diff\u00E9rents niveaux de partenariats qui sont d\u00E9taill\u00E9s dans
home.sponsor.annonceend=notre plaquette.
home.sponsor.return=Retournez nous le
home.sponsor.form=formulaire de sponsoring
home.sponsor.at=\u00E0
home.sponsor.presse=Pour plus d'informations vous pouvez consulter notre
home.sponsor.presseend=dossier de presse
home.info.title=Mix-IT c'est aussi...
home.info.section1=2 jours de conf\u00E9rences et d'ateliers.
home.info.section2=600 participants, 50 speakers
home.info.section1content=Des conf\u00E9rences pour faire des d\u00E9couvertes, des jeux pour apprendre, des ateliers de d\u00E9veloppement ou cr\u00E9atifs, Mix-IT c'est 2 jours intenses de progr\u00E8s et de rencontres ! La soir\u00E9e, ouverte \u00E0 tous, est aussi le moment id\u00E9al pour faire des connaissances et s'ouvrir aux autres cultures.
home.info.section2content=Afin de garder une dimension conviviale, le nombre de participants est limit\u00E9 \u00E0 600. Nous nous battons pour vous proposer tout cela \u00E0 un prix tr\u00E8s abordable, pour que tout un chacun puisse en profiter.
home.info.oldconf=See the programm of the previous editions :
home.speaker.title=Voici un panel des speakers que nous avons pu voir lors des pr\u00E9c\u00E9dentes \u00E9ditions :
home.speaker.top=Cette ann\u00E9e nous \u00E9tions tr\u00E8s fiers d'accueillir
home.speaker.cfp=Notre appel \u00E0 conf\u00E9renciers ouvrira en janvier 2017.
footer.whoarewe.title=Qui sommes-nous ?
footer.whoarewe.content=Mix-IT est une association \u00E0 but non lucratif fond\u00E9e en 2011 et anim\u00E9e par des b\u00E9n\u00E9voles issus des communaut\u00E9s techniques et agiles lyonnaises
footer.whoarewe.more=voir les membres du staff...
footer.contactus=Nous contacter
footer.codeofconduct=Code de bonne conduite
footer.rss=Flux RSS