[
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Create mobile application with PhoneGap",
    "summary": "I'll explain my development strategy, why I chose PhoneGap, and what I've learnt along the way.",
    "speakerIds": [
      "pamelafox"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      241000000
    ],
    "slug": "pamela-fox-create-mobile-application-with-phonegap",
    "description": "If you decide today that you want to create a mobile application, you have to decide on a development strategy - especially if you want to target multiple platforms.You can either learn to program from scratch for each platform or you can use a framework that abstracts on top of all of the platforms and reuses your existing web development knowledge - like Apache [PhoneGap](http:\/\/phonegap.com). If you decide to use [PhoneGap](http:\/\/phonegap.com\/), you still have figure out whether to use a library specially designed for mobile applications - like *Sencha* or *jQuery mobile* - or use general libraries like *Zepto* or *jQuery*. There are a lot of decisions to make, and there's no one best strategy at this point in the game.",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "1"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Expérience des billes rouges",
    "summary": "L’expérience des billes rouges (the red bead experiment) est un atelier conçu par William Edwards Deming.",
    "speakerIds": [
      "alexismonville"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      251000000
    ],
    "slug": "alexis-monville-experience-des-billes-rouges",
    "description": "L’expérience des billes rouges (the red bead experiment) est un atelier conçu par William Edwards Deming pour illustrer les erreurs classiques du management par rapport aux phénomènes liés à un système, à l’organisation elle-même. Cette session permettra aux participants de rejouer l'expérience et d'échanger sur les 7 maladies mortelles des organisations et les 14 points pour la transformation d'une entreprise définis par Deming.",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "5"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Sky Castle Game",
    "summary": "Le Sky Castle Game est basé sur le Kanban Game de Jon Jagger.",
    "speakerIds": [
      "Agilarium",
      "PhilAgile",
      "avernois"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      260000000
    ],
    "slug": "fabrice-aimetti-philippe-launay-antoine-vernois-sky-castle-game",
    "description": "Oyez ! Oyez ! La légende du Sky Castle Game : \"Il était une fois un Roi très puissant. Un jour il tomba éperdument amoureux et décida de construire le Château de ses rêves pour y accueillir sa Bien aimée. Il décida de faire appel aux Compagnons Agiles qui sont réputés pour faire ce que l’on veut, montrer l’état d’avancement et accepter les modifications dont on va nécessairement avoir besoin au fur et à mesure du chantier afin de satisfaire sa Belle. L’équipe recrute. En ferez-vous partie ?\"\r\n\r\nCet atelier dure 2 heures (minimum) et s'adresse à tout public.\r\n\r\nIl a été précédemment joué à l'Agile Tour Toulouse le 19 octobre, l'Agile Tour Bordeaux le 21 octobre et la Scrum Night le 7 décembre 2011.",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "7"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Dans la peau du Manager Agile",
    "summary": "L’ère du management 3.0 (agile et Lean) est annoncée. Entre opportunités et nécessité, le métier de manager est en pleine évolution...",
    "speakerIds": [
      "jcQualitystreet"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      260000000
    ],
    "slug": "jean-claude-grosjean-dans-la-peau-du-manager-agile",
    "description": "L’ère du management 3.0 (un management agile et Lean) est annoncée … entre opportunités et nécessité, le métier de manager est en pleine évolution.\r\nLe mode de management « Command & Control » issu du Taylorisme et de l’organisation scientifique du travail (OST) , avec sa vision appauvrie de l’Homme au Travail a montré ses limites; le manager agile explore de nouvelles dimensions pour garantir le succès de tous.\r\nCette session se propose d'explorer ces nouvelles dimensions.",
    "video": "http:\/\/www.youtube.com\/watch?v=D95ASG_frvY",
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "10"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Anatomie d'une mission agile, saison 2",
    "summary": "La réalité agile : retour d’expérience sur le déploiement agile au sein d’un grand éditeur de logiciel dans le milieu bancaire. ",
    "speakerIds": [
      "pablopernot"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      261000000
    ],
    "slug": "pablo-pernot-anatomie-d-une-mission-agile--saison-2",
    "description": "L’agile, tout le monde en parle, mais peu osent encore s’y lancer *véritablement*.\r\nIl plane une odeur de risque, d’étrangeté, qui freine les décideurs, les managers. \r\n\r\nL’objectif de cette session est de lever cet écran de fumée pour plonger concrètement au sein d’une application de l’agile dans un milieu que l’on estime habituellement rigide ou traditionaliste, le milieu bancaire.\r\n\r\nRentabilité, ROI, plan de carrière, supervision, définition du besoin, contraintes, risques, \"time to market\", réussite de certains processus, échecs d’autres, l’objectif de cette session est de décrire la réalité agile en démystifiant certaines idées et en répondant le plus concrètement possible aux questions souvent posées.",
    "video": "http:\/\/www.youtube.com\/watch?v=1efayxnn_Gs",
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "12"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Hibernate Search: dans ta face(ting)",
    "summary": "Hibernate Search s'appuie sur Lucene pour offrir aux applications Hibernate un moteur de recherche puissant et intuitif à ses utilisateurs.",
    "speakerIds": [
      "emmanuelbernard"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      261000000
    ],
    "slug": "emmanuel-bernard-hibernate-search--dans-ta-face-ting-",
    "description": "Hibernate Search a pour objectif de rentre très facile l'ajout d'un moteur de recherche puissant aux applications. Toute la plomberie et la complexité sont pris en charge par le framework et laisse les développeurs se concentrer sur les règles de recherche spécifiques à leur application.\r\n\r\nDans cette présentation, vous découvrirez comment rajouter un moteur de recherche à vos applications et vous découvrirez les dernières nouveautés comment la recherche par facette et la recherche géolocalisée.\r\n\r\nEt puisque c'est entre nous, on discutera autour du code et on passera éventuellement des slides si il reste du temps.",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "13"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Social Architecture 101",
    "summary": "Introducing Social Architecture: how to design and build on-line communities.",
    "speakerIds": [
      "hintjens"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      262000000
    ],
    "slug": "pieter-hintjens-social-architecture-101",
    "description": "Social Architecture by analogy with conventional architecture, is the process, and the product, of planning, designing, and growing an on-line community. Social architectures, in the form of on-line communities, are the cultural and political symbols, and works of art of the Digital Society. The 21st century will be identified with its surviving social architectures.\r\n\r\nAs Social Architects, we participate in communities, we identify successful naturally-occurring patterns, or we develop new patterns, and we apply these deliberately to our own architectures. We apply psychology (our social instincts), economics (how we create common wealth through specialization and trade), politics (how we collect and share power), and technology (how we communicate). We continually adapt our toolkit based on new knowledge and experience. Our goal is to create on-line communities that accurately solve the problems we identify, that grow healthily, and that survive by themselves.\r\n\r\nAll successful communities are based on the inherent contract of mutual benefit. That is, it is possible to build a billion-dollar business based on volunteer labor, but only if every participant contributes for selfish reasons. Often participants do not realize, or care, that they are part of a community. However, every single act is economic. Thus, \"crowd sourcing\" (as the exploitation-for-profit of volunteer labor is sometimes called) only works when the crowd really wants to solve the problems you throw at it.\r\n",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "14"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "ZeroMQ is Magic from the Future",
    "summary": "An introduction to ZeroMQ, the fast, smart, and massively scalable connectivity layer for applications in any language, on any platform.",
    "speakerIds": [
      "hintjens"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      262000000
    ],
    "slug": "pieter-hintjens-zeromq-is-magic-from-the-future",
    "description": "ØMQ (ZeroMQ, 0MQ, zmq) looks like an embeddable networking library but acts like a concurrency framework. It gives you sockets that carry whole messages across various transports like in-process, inter-process, TCP, and multicast. You can connect sockets N-to-N with patterns like fanout, pub-sub, task distribution, and request-reply. It's fast enough to be the fabric for clustered products. Its asynchronous I\/O model gives you scalable multicore applications, built as asynchronous message-processing tasks. It has a score of language APIs and runs on most operating systems. ØMQ is from iMatix and is LGPL open source.",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "15"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Un atelier Théâtre d'Impro pour jouer à être Agile",
    "summary": "Le théâtre d'impro c'est être réactif au changement pour être au service d'une histoire qui doit avancer. Ca ne vous rappelle rien ?",
    "speakerIds": [
      "bootis"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      262000000
    ],
    "slug": "aline-paponaud-un-atelier-theatre-d-impro-pour-jouer-a-etre-agile",
    "description": "Sur scène, les improvisateurs doivent faire vivre une histoire et garder le public réceptif, sans texte et sans préparation.\r\nOn nous donne un thème, et en définissant un personnage, un lieu et une action, on est parti pour jouer avec quelqu'un d'autre qui a forcément une idée complètement différente.\r\nComment y arriver ? Etre réactif ? Ne pas être trop brutal en imposant son idée, ne pas s'écraser complètement non plus ? En restant fidèle a des grands principes : Ecoute, Accepte, Percute, Anime, Construis, Joue le jeu, Innove, Amuse-toi, Ose !\r\nLe tout au service d'une Histoire qui doit avoir du sens. Impensable si l'équipe n'est pas en confiance et soudée.\r\nTiens, mais on dirait qu'on parle d'Agile...\r\n\r\nSession limitée à 12 participants",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "17"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Manipulation de bytecode : démocratisons la magie",
    "summary": "Comprendre le bytecode, sa manipulation, et se rendre compte que cela est fort utile.",
    "speakerIds": [
      "jponge",
      "flemouel"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      262000000
    ],
    "slug": "julien-ponge-frederic-le-mouel-manipulation-de-bytecode---democratisons-la-magie",
    "description": "Java ne se limite pas au langage éponyme : sa machine virtuelle est capable d'exécuter du bytecode produit par un très large panel de langages. Peu d'entre nous ont eu de bonnes raisons d'avoir à comprendre, générer ou transformer du bytecode Java. Il serait pourtant réducteur de limiter cette activité à une magie noire réservée aux créateurs de langages et de frameworks évolués. À titre d'exemple, la manipulation de bytecode est une des clés de voute de la simplification des modèles de programmation pour les plates-formes répandues que sont Java EE, Play! ou Spring.\r\n\r\nCette session s'adresse à un public de tous niveaux et a pour but non seulement de démystifier le bytecode Java, mais aussi de montrer en quoi cela peut être utile dans des cadres applicatifs plus classiques.\r\n\r\n* Bases du bytecode Java et de la JVM\r\n* Manipulation et applications avec : ASM, AspectJ et JBoss Byteman\r\n* Java 7 et invokedynamic\r\n* JooFlux : projet de recherche dévoilé pour toi cher public !",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "24"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Stresser son application avec Gatling",
    "summary": "Gatling est un injecteur de charge léger et ultra-performant.",
    "speakerIds": [
      "slandelle"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      263000000
    ],
    "slug": "stephane-landelle-stresser-son-application-avec-gatling",
    "description": "Vous devez réaliser des tests de charge et vous en avez assez de monter des clusters pour injecter une charge décente ou de cliquer dans une obscure IHM?\r\nInjectez 20 000 requêtes\/sec avec votre vieux laptop avec Gatling.\r\n\r\nGatling est développé en Scala, s'appuie sur un moteur asynchrone à base d'acteurs [Akka](http:\/\/akka.io) et d'IO non bloquantes [Netty](http:\/\/netty.io) et propose un DSL simple et parlant.\r\n\r\nPlus d'informations sur [http:\/\/gatling-tool.org](http:\/\/gatling-tool.org)",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "25"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Workshop \"Clojure hands on\"",
    "summary": "Plutôt que d'assister à de longs discours, venez tâter du Clojure par vous-mêmes en participant à un Workshop.",
    "speakerIds": [
      "petitlaurent",
      "christophe.grand"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      263000000
    ],
    "slug": "laurent-petit-christophe-grand-workshop--clojure-hands-on-",
    "description": "Les introductions à Clojure, ça suffit ! \r\nLe web en regorge, on a déjà fait ça à droite et à gauche.\r\n\r\nVous en voulez plus, nous en voulons plus ! \r\nVenez interagir avec nous, mettre les mains dans le cambouis, poser toutes les questions que vous voulez, lors d'un Workshop interactif où nous vous ferons découvrir ce que c'est, \"en vrai\", que d'utiliser ce langage de programmation.\r\n\r\nCe Workshop sera animé par Christophe Grand et Laurent Petit (no kidding) :\r\n\r\n* Christophe a été speaker lors des 2 conférences Clojure, auteur d'un livre sur Clojure, auteur de librairies Clojure renommées.\r\n\r\n* Laurent a été speaker lors de la 1ere conférence Clojure, et est le principal développeur de Counterclockwise, le plugin Clojure pour Eclipse.",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "30"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Kanban pour les nuls!",
    "summary": "Et si on vous racontait les principes fondamentaux qui se cachent derrière Kanban ? Beaucoup plus qu'un tableau de post-it !",
    "speakerIds": [
      "guillaumelours",
      "dbaeli"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      263000000
    ],
    "slug": "guillaume-lours-dimitri-baeli-kanban-pour-les-nuls-",
    "description": "Kanban, mais oui tu sais, c’est le tableau de Post-it © au fond de la salle qui vous rappelle que vous êtes agiles !\r\n\r\nEt si on vous racontait le minimum vital des principes qui se cachent derrière ? \r\n\r\nOui, il y a bien une histoire visuelle derrière tout ça, mais pas uniquement. \r\nKanban est aussi une conduite du changement basée sur l'amélioration continue de votre processus existant. \r\n\r\nLes clefs du management visuel:\r\n* Rendre visible l'avancement, l'objectif, les tendances !\r\n\r\nLe Flux: \r\n* Comprendre ce qu'est un Flux \r\n* Flux de valeur, Flux tiré\/poussé\r\n* Limiter le travail en cours: WIP\r\n\r\nRégler son processus:\r\n* Expliciter les règles et caractéristiques\r\n* Trouver la bonne cadence\r\n\r\nPour aller plus loin:\r\n* Théorie des contraintes, Files d'attentes, ...\r\n* Kanban vs Scrum : complémentarité ou nouvelle option ?\r\n\r\nNous finirons en vous présentant quelques cas typiques d’applications de Kanban.",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "35"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Animez vos pages HTML5 avec CSS3",
    "summary": "5' de coding live pour animer un cube en CSS 3D suivi des explications techniques",
    "speakerIds": [
      "martin.gorner"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      264000000
    ],
    "slug": "martin-gorner-animez-vos-pages-html5-avec-css3",
    "description": "Une visite guidée au travers des différentes techniques d'animation disponibles dans les navigateurs modernes. Donnez de la vie à vos pages avec quelques lignes de code déclaratif grâce aux animations CSS3, CSS3D et SVG. Les slides de la présentation sont évidemment en HTML5.",
    "video": "http:\/\/www.youtube.com\/watch?v=fML23uCN30o",
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "36"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Software Development Workflow at Google",
    "summary": "We'll look behind the scenes of day-to-day development workflow in the engineering teams at Google.",
    "speakerIds": [
      "GooglePetraCross"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      264000000
    ],
    "slug": "petra-cross-software-development-workflow-at-google",
    "description": "It is estimated that in the US alone, failed and troubled software projects waste $60-$70 billion per year. For that money, you could launch the space shuttle 100 times, build and deploy the entire 24 satellite GPS, and develop the Boeing 777 from scratch and still have few billion left over.\r\n\r\nIn my talk, I will not be analyzing what other companies do wrong. Instead, I will focus on explaining what Google does to reduce the development cost while speeding up releases and constantly delivering high quality software to our users.\r\n\r\nI will talk about the engineering and management structure at Google, then touch upon various software development workflow methodologies and then dive into the specifics of what software teams at Google do on a day-to-day basis.\r\n",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "39"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Automatisation des tests: le mythe du ROI",
    "summary": "Cette session a pour but de présenter la dynamique économique d’automatisation des tests qui s'apparente au modèle des options financières",
    "speakerIds": [
      "gmantel"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      264000000
    ],
    "slug": "gilles-mantel-automatisation-des-tests--le-mythe-du-roi",
    "description": "L’automatisation des tests est souvent associée à l’idée d’obtenir un retour sur investissement (ROI) financier qui permettra de justifier la pertinence de se lancer dans cette démarche. Cette idée est d’autant plus marquée dans les organisations non agiles. A l’inverse, les équipes agiles prônent une automatisation systématique au moins au niveau unitaire, ne raisonnent pas en termes de ROI, et ne cherchent pas à remplacer les testeurs avec des automates.\r\n\r\nJe présenterai différentes formules de calcul de ROI « à l’ancienne » et expliquerai pourquoi elles sont fausses et comment elles tendent à prendre les mauvaises décisions. \r\n\r\nJe présenterai ensuite le modèle des options financières et comment la dynamique économique d’automatisation des tests se calque sur ce modèle. Cette vision permet d’appréhender chaque situation avec des critères simples permettant de dériver une stratégie d’automatisation adaptée (test-first vs test-last, unitaire vs fonctionnel, etc.)",
    "video": "http:\/\/www.youtube.com\/watch?v=hf__zcdihwI",
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "40"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Utilisateur, mon amour, ma migraine",
    "summary": "Enrichir sa vision pour enrichir son produit: s'orienter vers un design centré sur l'utilisateur. Pourquoi, comment, quels résultats espérer",
    "speakerIds": [
      "sophie.freiermuth"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      264000000
    ],
    "slug": "sophie-freiermuth-utilisateur--mon-amour--ma-migraine",
    "description": "L'utilisateur... le grand absent dans la salle de développement, pour lequel tant de sueur est versée, tant de lignes de code écrites et tant de paroles échangées dans des discussions quelquefois houleuses mais heureusement souvent apaisées autour d'une bière ou une boite de gâteaux. \r\n\r\nLe comprendre, le définir, le garder au cœur du développement, répondre à ses besoins... \r\n\r\nUne session qui présentera et partagera les outils de l'ergonome et de l'ethnographe, destinée à tous les acteurs du développement pour augmenter la performance du produit, réduire l'inutile, parvenir à une définition commerciale de MVP et éviter des erreurs coûteuses.",
    "video": "http:\/\/www.youtube.com\/watch?v=ta6PLKPF7oU",
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "43"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Le DotGame, jouer la performance ",
    "summary": "Le DotGame illustre l'impact de l'initiative et la collaboration dans la croissance de la performance de l'équipe",
    "speakerIds": [
      "ojuncu"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      265000000
    ],
    "slug": "oana-juncu-le-dotgame--jouer-la-performance-",
    "description": "Le DotGame est un jeu simple qui s'articule sur 3 phases de 5 minutes chacune; \r\nEn formant des groupes de 7 personnes plus environ 5 observateurs, on reproduit un modèle qui est présenté comme référence. Chacun est à son poste avec une spécialisation particulière.\r\n\r\nLe produit en cours de fabrication passe d'un poste à l'autre. \r\nUn utilisateur final (ou PO) valide à la fin du cycle les produits le satisfont. \r\n\r\nLes règles changent dans chaque session et elle seront décrites à l'occasion de la présentation du jeu.\r\n\r\nPour chaque session on réalise les mesures suivantes :\r\n\r\n+  le temps de parcours du premier produit \r\n\r\n+  le nombre des produits validés\r\n\r\n+  le nombre de gaspillages (combien de produits ont été rejetés et pas finis)\r\n\r\nEn fin de chaque session il y a 5 minutes de rétrospective.\r\n\r\nLa taille du groupe a un maximum de 10 personnes. \r\n\r\nLa capacité de l'atelier est de 30 personnes maximum.",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "47"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "The Node.js Scalability Myth",
    "summary": "This talk will explore the idea of node.js being more scalable than other technologies, how much of it is true, and how much you should care",
    "speakerIds": [
      "felixge"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      265000000
    ],
    "slug": "felix-geisendorfer-the-node-js-scalability-myth",
    "description": "![NodeJs icon](http:\/\/nodejs.org\/images\/logo-light.png)\r\n\r\nThis talk will explore the idea of node.js being more scalable than other technologies, how much of it is true, and how much you should care.\r\n\r\nIf you are not sure about investing your time in learning node yet, or if you've been using node for a while, this talk is aimed to separate the hype from the facts and giving you a better idea for where and how to use node properly.",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "58"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Lean Startup, l'entrepreneuriat agile",
    "summary": "Mise au point en 2008 et appliquée depuis dans de nombreuses startups, le lean startup bouleverse les règles de l'entrepreneuriat.",
    "speakerIds": [
      "PIA_Emmanuel"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      265000000
    ],
    "slug": "emmanuel-levi-valensi-lean-startup--l-entrepreneuriat-agile",
    "description": "Mise au point par Eric Ries en 2008 et appliquée depuis dans de nombreuses startups (DropBox par exemple), le Lean Startup bouleverse les règles de l'entrepreneuriat.\r\n\r\nVous découvrirez pendant cette session les fondements du Lean Startup, ainsi que le Customer Development (marketing agile) et sa complémentarité avec les méthodes agiles, et enfin des conseils pratiques pour appliquer le Lean Startup à vos projets.",
    "video": "https:\/\/www.youtube.com\/watch?v=e1GGurd58Yo",
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "60"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Selenium WebDriver, TestNG et Selenium Grid",
    "summary": "Comment tester une application web avec WebDriver, TestNG et Selenium Grid. Mise en place, bonnes pratiques ...",
    "speakerIds": [
      "MathildeLemee"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      265000000
    ],
    "slug": "mathilde-lemee-selenium-webdriver--testng-et-selenium-grid",
    "description": "Comment tester une application Web ?\r\n\r\nNous aurons l'occasion de creuser en profondeur la question en étudiant les outils mis à notre disposition que sont Selenium WebDriver, TestNG et surtout Selenium Grid.\r\nSelenium est un outil qui a su s'imposer comme la solution open-source la plus efficace sur le marché. \r\n\r\nIl permet d'effectuer des tests fonctionnels\/d'acceptance sur les applications web et mobiles. Avec Selenium Grid, vous allez pouvoir distribué les tests sur plusieurs machines et diminuer les temps d'execution des plans de tests. Mais il va beaucoup plus loin : en permettant, de manière simple de gérer plusieurs environnements, incluant des multiples combinations de browsers\/OS, il s'impose comme un outil efficace . \r\n\r\nCombiné avec un framework de test spécialisé dans le parallelisme tel que TestNG, on obtient une suite robuste et efficace, qui nous permet de nous consacrer sur l'essentiel.\r\n\r\nLes exemples seront Java mais tout ce qui concerne selenium & selenium grid concerne une multitudes d'autres langages (PHP, ruby, c# ...).",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "63"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "BigData \/ Hadoop, exploiter des téraoctets de logs",
    "summary": "Vivez la mise en place d'une infrastucture complète, articulée autour de Hadoop, chez un des acteurs majeurs du web-commerce européen.",
    "speakerIds": [
      "plopez"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      266000000
    ],
    "slug": "pablo-lopez-bigdata---hadoop--exploiter-des-teraoctets-de-logs",
    "description": "Comment analyser chaque jour des téra de logs générés par plus de 600 JVMs en production, sans impacter leur fonctionnement ?\r\nNous vous présenterons durant cette session la solution Big Data 100% Open Source mise en place chez un des plus grands sites du web européen. Une architecture basée sur syslog-ng, Flume, Hadoop, MongoDb et Play!, qui n'a rien à envier aux géants d'outre-atlantique !\r\nVenez découvrir comment nous avons divisé par 20 le temps de détection et de traitement des incidents. Mais aussi comment BigData a permis de nouvelles utilisations des logs à la fois techniques et surtout métier, comme la détection des fraudes, l’analyse de traffic web, BI en temps réel, ...\r\nÀ travers ce retour d'expérience, nous vous proposons de vivre, au coeur d'une des plus exigeantes productions de France, la mise en place de ce projet digne des très grands du web.\r\n\r\n(Présentation acceptée pour DevoxxFr)",
    "video": "http:\/\/www.youtube.com\/watch?v=1WF_FBFJllc",
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "83"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "MongoDB, Mustache... Vers la mort du cache ?",
    "summary": "Le caching a sauvé les architectes web des années 2000, au prix souvent d'une énorme complexité. Peux-t-on, et doit-on tourner cette page ?",
    "speakerIds": [
      "kali"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      266000000
    ],
    "slug": "mathieu-poumeyrol-mongodb--mustache----vers-la-mort-du-cache--",
    "description": "Fotopedia est une plateforme web et webservice à fort traffic, qui reçoit plus de 5 millions de visites par mois. Venez découvrir les stratégies mises en place par nos équipes pour palier aux soucis en production. \r\n\r\nL'application principale de Fotopedia est un Ruby on Rails vieux de 6 ans. À cause de ses lenteurs intrinsèques, nous avons été amené à mettre en place des stratégies de cache élaborées pour que le comportement soit acceptable. Ceci nous a conduit à une stack utilisant du cache de fragment \"edge-side\", et des boucles d'invalidation complexes pour garantir la fraîcheur du contenu, qui reste encore perfectible. \r\n\r\nMongoDB, couplé à un micro langage de template (mustache), nous permet aujourd'hui d'explorer une autre approche éliminant totalement le cache pour les données les plus dynamiques de l'application. \r\n\r\nMots clés : Performance, MongoDB, Varnish, Cache, Mustache",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "93"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Painless Web App Development with Backbone",
    "summary": "You know how you always mean to apply proper MVC principles but end up with a mess of jQuery instead? No more excuses: now there's Backbone.",
    "speakerIds": [
      "bodil"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      266000000
    ],
    "slug": "bodil-stokke-painless-web-app-development-with-backbone",
    "description": "Have you ever tried to write a moderately complex browser side application with the assumption that jQuery is probably all you need for the job? I mean, fire off some AJAX requests, then just use some DOM manipulation to put the results where you want them—how hard can it be, right?\r\n\r\nWould you have enjoyed maintaining the code that resulted from that assumption? No, neither would I.\r\n\r\nWould you like to see a better solution?\r\n\r\nAs it turns out, programmers have known how to keep their frontend code under control for a while using a surprisingly simple principle called MVC. Now that the browser has suddenly become a serious platform for application development, the need for MVC (or, at least, the basic concepts behind MVC) has become so apparent that we already have multiple rival MVC libraries for the browser platform. Backbone is arguably the most popular of the lot, and certainly one of the most lightweight.\r\n\r\nIn this presentation, you'll learn how to harness the power of Backbone by example, as we build a simple browser side application from the bottom up using nothing but Backbone and your favourite DOM toolkit.",
    "video": "http:\/\/www.youtube.com\/watch?v=K3LwjZ-F09A",
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "95"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "Play 2.0",
    "summary": "Play 2.0 vient de sortir, il est tout frais, tout beau, et s’utilise en Java et Scala",
    "speakerIds": [
      "jrf"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      266000000
    ],
    "slug": "julien-richard-foy-play-2-0",
    "description": "Découvrez comment écrire une application Web avec Play 2.0, en Java et en Scala. Quels sont les concepts architecturaux forts du framework et les modèles de programmation qui en découlent, notamment le modèle asynchrone.\r\n\r\nVous verrez également, démos à l’appui, comment l’API de Play 2.0 *scale*, permettant d’écrire des applications avec une grande productivité tout en  donnant, s’il le souhaite, énormément de contrôle au développeur.\r\n\r\nPlay 2.0 est un framework pour Java et Scala permettant d’écrire des applications hautement *scalable* grâce à sa légèreté, son architecture *stateless* et réactive.",
    "video": null,
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "99"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "An overview of JavaScript",
    "summary": "This talk will provide a quick overview of JavaScript for people who already know how to program in an object-oriented language.",
    "speakerIds": [
      "rauschma"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      267000000
    ],
    "slug": "axel-rauschmayer-an-overview-of-javascript",
    "description": "This talk will provide a quick overview of JavaScript for people who already know how to program in an object-oriented language. We will cover both JavaScript’s strengths (yes, those do exist!) and its weaknesses. Everything will be put into perspective by comparing JavaScript with other languages (mainly Java and Python) and by providing a glimpse at ECMAScript 6 (code-named ECMAScript.next), the next version of JavaScript that will be finished by 2013.",
    "video": "http:\/\/www.youtube.com\/watch?v=_GYicBSNhaY",
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "104"
  },
  {
    "format": "TALK",
    "event": "mixit12",
    "title": "DevOps in real life at Kelkoo",
    "summary": "Comment Kelkoo a implémenté les principes DevOPS dans le déploiement de ses applications (10 releases par semaine sur 300 serveurs)",
    "speakerIds": [
      "alain.delafosse",
      "capponi.nicolas"
    ],
    "language": "FRENCH",
    "addedAt": [
      2017,
      2,
      28,
      15,
      38,
      33,
      267000000
    ],
    "slug": "alain-delafosse-nicolas-capponi-devops-in-real-life-at-kelkoo",
    "description": "Kelkoo a implémenté une solution globale pour banaliser la création, la configuration et le déploiement de ses applications sur son infrastructure.\r\n\r\nDe la création du composant logiciel à travers des archetypes comprenant la structure maven ainsi des fichiers de configuration templatisés jusqu'a la software factory produisant des RPMS.\r\nDu clonage OS automatisé des serveurs jusqu'au backoffice de configuration des serveurs (tel composant avec telles clefs de conf  sur tels serveurs);  toutes ces opérations sont accessibles au développeurs Kelkoo et autorisent des logiques de déploiement continu.\r\n\r\nCette présentation vise a expliquer comment Kelkoo a mis en oeuvre les outils: Cobbler, Puppet, jenkins, Maven, RPM, Gepetto (BO maison), Punch (surcouche puppet) pour simplifier la création, la configuration et le déploiement de ses applications de manière industrielle...",
    "video": "http:\/\/www.youtube.com\/watch?v=SIVxBHJ4AbM",
    "room": "UNKNOWN",
    "start": null,
    "end": null,
    "id": "114"
  }
]
