[
    {
        "addedAt": "2022-04-01T09:59:40.367",
        "description": "",
        "end": "2022-05-24T10:00:00",
        "event": "2022",
        "format": "KEYNOTE",
        "id": "6246cdb1e0fb2108c68a5f8c",
        "language": "FRENCH",
        "photoUrls": [
            {
                "name": "tarik",
                "url": "https://live.staticflickr.com/65535/52095903178_0e4b30d5cc_b.jpg"
            },
            {
                "name": "tarik2",
                "url": "https://live.staticflickr.com/65535/52095902858_b2348e4289_b.jpg"
            },
            {
                "name": "tarik3",
                "url": "https://live.staticflickr.com/65535/52096379415_822fa2dd6e_b.jpg"
            }
        ],
        "room": "AMPHIC",
        "slug": "tech-ethique-et-geopolitique",
        "speakerIds": [
            "tariqkrim"
        ],
        "start": "2022-05-24T09:30:00",
        "summary": "Tech éthique et géopolitique",
        "title": "Tech éthique et géopolitique",
        "topic": "ethics",
        "video": "https://vimeo.com/726160155"
    },
    {
        "addedAt": "2022-03-23T09:12:44.696",
        "description": "Tester sans scripts et sans cahiers de recette dans un environnement avec peu de spécifications fonctionnelles peut en perturber plus d'un·e. Dans ces conditions, comment faire de la non-régression ou trouver le cas un peu tordu qui va \"casser\" l'expérience utilisateur ?\r\n\r\nSuffit-il de tester comme un singe, un chat ou un enfant de 3 ans en tapant sur toutes les touches ou en cliquant sur tous les boutons au hasard ? Bien sûr que non!\r\nIl existe des méthodes de tests pour trouver des bugs qu'on n'avait pas anticipés et sur lesquels nos utilisateurs risquent de tomber avant nous.\r\nDans cet atelier, nous ferons une introduction aux sessions de tests exploratoires avec mise en pratique, pour que vous appreniez la technique en mettant les mains dans le cambouis.\r\n\r\n## Ce que vous allez apprendre\r\n* Comprendre la démarche du test exploratoire comme une approche guidée, réfléchie, et qui peut se passer de scénarios de tests\r\n* Intégrer les tests exploratoires à votre stratégie de test : ils sont une approche complémentaire aux tests de non-régression classiques, qu'ils soient manuels ou automatiques\r\n* Utiliser des concepts comme les oracles, les heuristiques ou les tests guidés par le risque\r\n* Comment trouver des bugs utiles pour les clients et les utilisateurs\r\n\r\n## Public visé :\r\n* Les testeurs fonctionnels, les développeurs de tests fonctionnels, les tests managers, coaches QA, lead testeurs…\r\n* Les responsables de produit, PO\r\n* Toute personne souhaitant mieux tester fonctionnellement son code.\r\n\r\n## Matériel nécéssaire  :\r\n* 1 portable avec un port HDMI par groupe de 5-6 personnes",
        "end": "2022-05-24T12:30:00",
        "event": "2022",
        "format": "WORKSHOP",
        "id": "623ad67c8a5c755e7139c6ed",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM4",
        "slug": "comment-tester-avec-son-cerveau-introduction-aux-tests-exploratoires-un-outil-essentiel-pour-tous",
        "speakerIds": [
            "nitcheasatester",
            "s_colson",
            "testeacher"
        ],
        "start": "2022-05-24T10:40:00",
        "summary": "Peut-on tester sans cahiers de recette ? Dans un environnement avec peu de spécifications fonctionnelles, comment faire de la non-régression ou trouver le cas un peu tordu qui va \"casser\" l'expérience utilisateur ? Cet atelier va vous apprendre à faire des sessions de test exploratoire efficaces.",
        "title": "Comment tester avec son cerveau ? Introduction aux tests exploratoires, un outil essentiel pour tous",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2022-03-23T09:12:44.701",
        "description": "Où l'on parlera de design pour le service public.\r\nÀ qui s'adressent les services numériques du service public : aux citoyens et citoyennes, mais pas seulement !\r\nQuels genres de produits développe-t-on ? \r\nComment on travaille avec une administration ? Comment intégrer les méthodologies agile et lean dans des administrations ?\r\nQu'est-ce que ça change par rapport au privé ? Quels points d'attention à avoir ? Quels pièges éviter quand on vient du public ? \r\n",
        "end": "2022-05-24T11:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6f1",
        "language": "FRENCH",
        "photoUrls": [
            {
                "name": "annso",
                "url": "https://live.staticflickr.com/65535/52095875546_e50429bf0c_b.jpg"
            }
        ],
        "room": "AMPHIC",
        "slug": "designer-pour-le-service-public",
        "speakerIds": [
            "annso_"
        ],
        "start": "2022-05-24T10:40:00",
        "summary": "Qu'est-ce que ça veut dire, être UX designer pour le service public, après 10 ans dans des entreprises privées ? Qu'est-ce que ça change, de concevoir pour des citoyen·nes ? Comment travailler dans l'administration ?",
        "title": "Designer pour le service public",
        "topic": "design",
        "video": "https://vimeo.com/725688807"
    },
    {
        "addedAt": "2022-03-23T09:12:44.709",
        "description": "Après le Rescue-game “Il faut sauver LoRa”, on revient te proposer le Handson le plus fou de l’année. Cette fois-ci, pas de radio ou de catastrophe naturelle. Si on allait plutôt chercher le contenu d’un coffre fort?\r\nIci, le seul IDE dont tu auras besoin sera Arduino. Tu vas apprendre à bruteforcer une valise électronique, trouver les bons fils à brancher, sniffer des trames réseau, hacker une webapp et re-programmer des badges NFC. Il te reste moins de 2h en compétition pour gagner le contenu du coffre. On te conseille de venir en binôme !",
        "end": "2022-05-24T12:30:00",
        "event": "2022",
        "format": "WORKSHOP",
        "id": "623ad67c8a5c755e7139c6f6",
        "language": "FRENCH",
        "photoUrls": [
            {
                "name": "crackingthesafe",
                "url": "https://live.staticflickr.com/65535/52095898788_d09acf87af_b.jpg"
            },
            {
                "name": "crackingthesafe_2",
                "url": "https://live.staticflickr.com/65535/52096374940_27c6dcbb22_b.jpg"
            }
        ],
        "room": "ROOM3",
        "slug": "hacking-game-crack-the-safe",
        "speakerIds": [
            "LoicOrtola",
            "antoleb",
            "de.guibert"
        ],
        "start": "2022-05-24T10:40:00",
        "summary": "Les autres workshops sont \"So-2019\"?\r\n\r\nEt si on allait plutôt hacker un coffre-fort? \r\nViens bruteforcer une valise électronique et bouffer de l'hexa pour hacker un badge NFC. Il te reste 2h en compétition pour gagner le contenu du coffre. On te conseille de venir en binôme !",
        "title": "Hacking Game : Crack the safe",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": "2022-03-23T09:12:44.711",
        "description": "Biais cognitifs, sciences comportementales, incitations douces : le cerveau des utilisateurs/trices est devenu notre terrain de jeu — et l’infantilisation notre meilleur business model.\r\n\r\nFace aux hochets attentionnels et aux biberons de dopamine, notre capacité à proposer un numérique adulte, émancipateur est la victime collatérale du capitalisme de l’attention. Ne jetons pas le bébé avec l’eau du bain : la science comportementale, c’est aussi le remède dans le mal.",
        "end": "2022-05-24T11:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6f8",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHID",
        "slug": "homo-stimulus-au-bonheur-des-likes",
        "speakerIds": [
            "nina-cercy"
        ],
        "start": "2022-05-24T10:40:00",
        "summary": "Biais cognitifs, sciences comportementales, incitations douces : le cerveau des utilisateurs/trices est devenu un terrain de jeu — et l’infantilisation notre meilleur business model. Face aux hochets attentionnels et aux biberons de dopamine, que reste-t-il à proposer pour un numérique émancipateur?",
        "title": "Homo stimulus : au bonheur des likes",
        "topic": "aliens",
        "video": "https://vimeo.com/726167057"
    },
    {
        "addedAt": "2022-03-23T09:12:44.717",
        "description": "Une personne paralysée des membres supérieurs est grandement handicapée dans sa vie de tous les jours pour effectuer des actions qui sont banales pour les autres. Grâce au monde numérique et à internet cette personne peut retrouver une certaine autonomie pour communiquer avec ses proches, consommer, se cultiver, effectuer des démarches administratives… Le numérique est donc une formidable promesse pour cette personne à condition que nos sites internet soient accessibles ! 😰\r\n\r\n\r\nCette conférence présente comment ces personnes peuvent naviguer sur internet et les difficultés auxquelles elles sont confrontées. Ensuite, nous verrons comment apporter quelques modifications simples à nos sites internet pour les rendre accessibles pour ces personnes. Cela sera mis en pratique sur un site internet en live-coding.\r\n",
        "end": "2022-05-24T11:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6fd",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM2",
        "slug": "le-handi-surf-l-accessibilite-d-un-site-internet-pour-une-personne-tetraplegique",
        "speakerIds": [
            "hboisgontier"
        ],
        "start": "2022-05-24T10:40:00",
        "summary": "Venez découvrir l'accessibilité numérique, son importance et surtout comment commencer à la mettre en œuvre !",
        "title": "Le handi-surf : l'accessibilité d'un site internet pour une personne tétraplégique",
        "topic": "tech",
        "video": "https://vimeo.com/730352883"
    },
    {
        "addedAt": "2022-03-23T09:12:44.681",
        "description": "Cet atelier créé par Geoffrey Graveaud a été joué lors du DevFestNantes 2021 et quelques évènements Agiles.\r\n\r\nIl est adapté à un public technique mais convient parfaitement aussi à un public plus opérationnel, voire fonctionnel puisque Accelerate (the science behind DevOps) cherche à mobiliser tous les rôles d’une organisation IT.\r\n\r\nJ'anime cet atelier en duo en général (nom de la personne à venir) sinon je suis entièrement capable de l'animer seul.\r\n\r\n2 formats possibles : présentiel ou distanciel\r\nSi présentiel:\r\nJusqu'à 42 personnes max :  7 personnes répartis sur 6 table.\r\nSi distanciel: \r\n2 salles virtuelles prévues (1 par animateur)\r\nPossibilité d'accueillir en 5 à 10 personnes par salle.  La fluidité des échanges est bien à 7 personnes et permet aux plus discrets de s'exprimer.",
        "end": "2022-05-24T12:30:44",
        "event": "2022",
        "format": "WORKSHOP",
        "id": "623ad67c8a5c755e7139c6e6",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM5",
        "slug": "a-la-decouverte-d-accelerate",
        "speakerIds": [
            "geoffrey.graveaud",
            "ilyes_semlali"
        ],
        "start": "2022-05-24T10:40:44",
        "summary": "Les organisations veulent déployer plus vite et être stable pour atteindre leurs objectifs.\r\nAccelerate est une recherche de 4 ans qui a défini les pratiques pour allier vitesse et stabilité.\r\nA travers cet atelier, vous découvrirez l'idée générale, les mécanismes et les résultats prédits d'Accelerate",
        "title": "A la découverte d'Accelerate",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2022-03-23T09:12:44.693",
        "description": "Difficile de se passer d'un gestionnaire de mots de passe si on veut respecter les bonnes pratiques : des mots de passe uniques et complexes. C'est encore plus vrai s'il faut partager les mots de passe avec des collègues ou des membres de la famille.\r\n\r\nCes gestionnaires de mots de passe sont souvent des boites noires. On vous dit que les mots de passe sont chiffrés mais je vous propose d'aller un peu plus loin et comprendre comment ça fonctionne et pourquoi, puis comment on peut partager des mots de passe synchronisés en ligne sans faire confiance à personne pour ses mots de passe.\r\n\r\nÀ Cozy Cloud nous avons étudié le gestionnaire open source Bitwarden, puis implémenté nos propres solutions autour de la même API. Je vous propose une plongée dans tout ce que nous avons appris, pour satisfaire la curiosité ou pour vous rassurer quant à l'utilisation de ces outils.\r\n\r\nOn parlera chiffrement et architecture mais ça sera compréhensible pour tout le monde sans prérequis particulier.",
        "end": "2022-05-24T11:30:44",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6eb",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM1",
        "slug": "comment-fonctionne-un-gestionnaire-de-mots-de-passe-",
        "speakerIds": [
            "edas"
        ],
        "start": "2022-05-24T10:40:44",
        "summary": "Pas de blabla lu cent fois ailleurs. Nous parlerons cryptographie et architecture d'une implémentation réelle.\r\n\r\nVous apprendrez tout ce que j'ai moi-même appris en implémentant un gestionnaire de mots de passe compatible avec l'API de Bitwarden.",
        "title": "Comment fonctionne un gestionnaire de mots de passe ?",
        "topic": "tech",
        "video": "https://vimeo.com/728606523"
    },
    {
        "addedAt": "2022-03-23T09:12:44.708",
        "description": "Les objets connectés sont partout, de plus en plus présents, mais aussi dans nos poubelles !\r\nEn effet, un grand nombre de ces derniers finissent en briques inutilisables car les sociétés\r\nles commercialisant mettent la clé sous la porte ou décident unilatéralement d'arrêter les\r\nservices (et donc les serveurs et applications) associés. Sans compter le gâchis technologique\r\nà l'heure où l'on cherche à faire prolonger la durée de vie des équipements pour cause de\r\npénurie de semiconducteurs !\r\n\r\nCe talk propose une réflexion sur l'avenir que l'on peut donner aux équipements connectés, les\r\npré-requis pour pouvoir leur offrir une seconde vie et l'impact que cela peut avoir en terme\r\nde sécurité. Nous aborderons bien sûr les challenges techniques que posent ces systèmes, et en\r\nparticulier les verrous que sont les mesures techniques de protection que l'industrie de la\r\nsécurité informatique prône pour assurer la sécurité. ",
        "end": "2022-05-24T12:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6f5",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "hackers-reprenez-le-controle-des-objets-connectes-",
        "speakerIds": [
            "damien.cauquil"
        ],
        "start": "2022-05-24T11:40:00",
        "summary": "La pénurie des composants électroniques a cependant permis de mettre en évidence une réalité: celles des déchets électroniques engendrés par l'innovation technologique et l'obsolescence programmée. Et si nous reprenions le contrôle de nos anciens équipements pour leur donner une seconde vie ?",
        "title": "Hackers, reprenez le contrôle des objets connectés !",
        "topic": "makers",
        "video": "https://vimeo.com/730352388"
    },
    {
        "addedAt": "2022-04-01T12:42:12.815",
        "description": "Un parcours professionnel qui commence par 11 années dans différentes agences d’architecture en tant qu’architecte. \r\nAprès une formation de 10 mois sur la qualité environnementale des bâtiments, j'ai souhaité travailler pour l’action publique en me rapprochant des décideurs pour être acteur des évolutions. Ainsi j'ai l’opportunité d’exercer pendant 10 ans, dans une collectivité territoriale, un poste de responsable du service Architecture et Patrimoine de la ville de Chalon-sur-Saône. Depuis une année, je suis retourné aux aspirations d’origine pour valoriser mon diplôme d’architecte du Patrimoine.",
        "end": "2022-05-24T12:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "6246f38892dbc531f141eaee",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM1",
        "slug": "reussir-l-impossible-le-retour-d-experience-d-un-architecte-en-batiment",
        "speakerIds": [
            "cagicquel"
        ],
        "start": "2022-05-24T11:40:00",
        "summary": "J'ai travaillé pendant 10 ans dans le service d'architecture d'une collectivité territoriale. Mon rôle était de construire et rénover des bâtiments à la demande d'élus.\r\nIl m'est arrivé de devoir faire avancer les choses alors que l'organisation dans laquelle j'évoluais empêchait toute prise de décision, risquant de mettre en péril des chantiers à plusieurs millions d'euros ?\r\n\r\nJe vous raconterai l'histoire de la construction d'un bâtiment innovant dans un monument historique, un contexte hautement complexe et comment nous avons réussi à dépasser, à chaque phase du projet, des situations qui semblaient irréalisables.",
        "title": "Réussir l'impossible, le retour d'expérience d'un architecte en bâtiment",
        "topic": "aliens",
        "video": "https://vimeo.com/730352378"
    },
    {
        "addedAt": "2022-04-01T14:11:16.262",
        "description": "Comment WebAssembly pourrait changer la façon dont nous développons nos applications dans les années à venir ? Sébastien partagera des pistes de réflexion ainsi que des expérimentations pour vous donner un aperçu de ce qu’est WebAssembly en 2022 et de sa possible évolution. On parlera décentralisation, modèle de sécurité, WASI, WebAssembly Component Model, intégration de WebAssembly avec les différents langages (Rust, Go, Kotlin, JavaScript, Java, Python, Ruby), performance, outillage et déploiement sans containeur.",
        "end": "2022-05-24T12:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "6247085ca88168213377c692",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHID",
        "slug": "webassembly-developer-experience",
        "speakerIds": [
            "sdeleuze"
        ],
        "start": "2022-05-24T11:40:00",
        "summary": "Comment WebAssembly pourrait changer la façon dont nous développons nos applications dans les années à venir ?",
        "title": "WebAssembly Developer Experience",
        "topic": "tech",
        "video": "https://vimeo.com/726160136"
    },
    {
        "addedAt": "2022-04-01T14:19:12.536",
        "description": "TBD",
        "end": "2022-05-24T12:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "62470a2da88168213377c693",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM2",
        "slug": "discrimination-et-harcelement-au-travail",
        "speakerIds": [
            "cjf.avocat"
        ],
        "start": "2022-05-24T11:40:00",
        "summary": "TBD",
        "title": "Discrimination et harcèlement au travail",
        "topic": "ethics",
        "video": "https://vimeo.com/725690027"
    },
    {
        "addedAt": "2022-03-23T09:12:44.705",
        "description": "Aucun acteur, même une Big tech, ne peut prétendre aujourd’hui maîtriser l’ensemble de son “territoire numérique”. Pour produire réseaux et terminaux, il est nécessaire d’extraire des métaux qui sont répartis inégalement sur la planète, avec des écarts de quantité et de qualité. Certains pays sont des territoires plus favorables à l’installation des serveurs nécessaires à la vie numérique pour des raisons géographiques et climatiques : lorsque Google installe ses centres de données en Finlande, ceux-ci profitent de l'eau de mer du golfe de Finlande qui permet de réduire la consommation d’énergie nécessaire au refroidissement de ces infrastructures géantes. \r\nLa France est également un territoire intéressant pour ces infrastructures gourmandes en eau, car elle constitue une terre au réseau fluvial dense, et sa facture énergétique reposant sur le nucléaire lui confère une certaine sécurité d'approvisionnement à coût réduit. Elle est également, pour les entreprises américaines et chinoises, un territoire d'accès privilégié vers l'Europe : reliée aux cables sous-marins transatlantiques à l'Ouest, elle est récemment devenu station d'atterissement du câble PEACE chinois débarquant à Marseille après avoir traversé les côtes indiennes, africaines et passé le canal de Suez.  \r\nAinsi, les interdépendances du monde numérique commencent par le territoire, ses richesses, sa géographie, son histoire.  Et dans cet environnement, nous observons de très grandes disparités de pouvoirs. Nous le voyons aujourd’hui dans la difficulté que rencontrent les États européens à réguler les grandes entreprises du numérique, principalement les Big techs américaines. Dans une certaine mesure, les États-Unis sont eux-mêmes confrontés à cette difficulté, et la politique antitrust de l’administration Biden fait face à sa propre dépendance aux géants du numérique. \r\nNous tenterons, dans ce talk, de dresser un état des lieux des enjeux géopolitiques relatifs aux infrastructures qui soutiennent la vie numérique. Les stratégies industrielles américaines et chinoises, et la position européenne, seront également analysées. Au delà du constat, il s'agira enfin de faire quelques propositions pour l'Europe.",
        "end": "2022-05-24T14:30:00",
        "event": "2022",
        "format": "KEYNOTE",
        "id": "623ad67c8a5c755e7139c6f3",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "enjeux-geopolitiques-des-infrastructures-numeriques",
        "speakerIds": [
            "ophelie.coelho"
        ],
        "start": "2022-05-24T14:00:00",
        "summary": "Le numérique est d'abord une affaire de territoire, où se jouent l'accaparement des ressources, le jeu des négocations inhérentes à l'interdépendance des réseaux et, aujourd'hui, de nouvelles aires de conquête spatiale. Face aux déséquilibres géopolitiques, quels sont les enjeux pour l'Europe ?",
        "title": "Enjeux géopolitiques des infrastructures numériques",
        "topic": "ethics",
        "video": "https://vimeo.com/726178424"
    },
    {
        "addedAt": "2022-03-23T09:12:00",
        "description": "Le Collectif Mauvaises Herbes est une initiative qui a pour objectif de mettre en valeur et à protéger la diversité des expertises dans le jeu vidéo.\r\nLors de cette intervention, les trois fondatrices du Collectif présenteront ses actions et les valeurs fortes qui sont à son origine. Nous aborderons ensemble les problématiques rencontrées par les personnes marginalisées dans le jeu vidéo et nos pistes pour créer d'autres dynamiques.",
        "end": "2022-05-24T15:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6ea",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM2",
        "slug": "collectif-mauvaises-herbes-notre-demarche-pour-valoriser-les-expertises-des-personnes-marginalisees-du-jeu-video",
        "speakerIds": [
            "camille.moreau",
            "clementine.plissonnier",
            "thais.arias"
        ],
        "start": "2022-05-24T14:50:00",
        "summary": "Présentation de notre collectif, qui vise à mettre en valeur et à protéger la diversité des expertises dans le jeu vidéo. Nous présenterons notre collectif et ses initiatives, puis quelques valeurs fortes qui guident nos réflexions.",
        "title": "Collectif Mauvaises Herbes : notre démarche pour valoriser les expertises des personnes marginalisées du jeu vidéo",
        "topic": "ethics",
        "video": "https://vimeo.com/733370754"
    },
    {
        "addedAt": "2022-03-23T09:12:44.71",
        "description": "Even if many have heard of it but few have seen it, the hexagonal architecture is not an Arlesian.\r\nThe goal here will be to show everyone, both beginners and experts, that this architecture is really simple to implement.\r\nIt has many advantages:\r\n\r\n- separation of business and technical code,\r\n- establishment of a Domain Specific Language,\r\n- testability of the business code,\r\n- scalability of the technical code relating to infrastructure,\r\n- facility for technological monitoring.\r\n\r\nIn short, everything is good in hexagonal architecture.\r\n\r\nThis three-hour session will be divided as follows:\r\n\r\n- a presentation of 30 minutes maximum alternating definition of each of its concepts and their implementation in a Java project.\r\n- a kata of 60 minutes max on a business domain to be used in the next part\r\n- implementation for 60 minutes max of adapters showing the power and simplicity of this architecture.\r\n- 15 minutes of Q / A and concept development\r\n\r\nThe result of this workshop was implemented on new projects in the banking sector. This made it possible to avoid recurring pitfalls on the testability and quality of the developed code ^^.\r\nReferences\r\n\r\nMeetup where this workshop has been facilitated: https://www.meetup.com/fr-FR/Nov-NCraft/events/248998729/?_xtd=gatlbWFpbF9jbGlja9oAJGMyYjA2OTYzLTRkODYtNDc4ZC04ZTQ3LTA5OGQwNjYwZmE4Yg\r\n\r\nHere is a the kata's github: https://github.com/HEIWA-IT/TripAgency/\r\n\r\nThe attendees needs to have a JDK and Maven installed and an IDE of their choice. \r\n",
        "end": "2022-05-24T16:40:00",
        "event": "2022",
        "format": "WORKSHOP",
        "id": "623ad67c8a5c755e7139c6f7",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM5",
        "slug": "hexagonal-architecture-a-simple-and-powerful-architecture-set-up-quickly",
        "speakerIds": [
            "MagierDan"
        ],
        "start": "2022-05-24T14:50:00",
        "summary": "Even if many have heard of it but few have seen it, the hexagonal architecture is not an Arlesian.\r\nThe goal here will be to show everyone, both beginners and experts, that this architecture is really simple to implement.",
        "title": "Hexagonal architecture: a simple and powerful architecture, set up quickly",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2022-03-23T09:12:00",
        "description": "Envie de feedback qui ont vraiment du sens ? D'ailleurs quel sens peut-on réellement donner au feedback. Je vous propose un atelier pour entrer plus en profondeur dans le sujet et vous partager l'amour que j'ai de cette pratique.\r\n\r\nRecette de l'atelier :\r\n- un peu d'alignement pour commencer\r\n- théorie pour modaliser le geste\r\n- on s'entraine pour de rire\r\n- opportunité de donner un feedback sur l'atelier... mais vraiment pour le bien-être des participant.e.s !!\r\n\r\nDes échanges, des partages, de la pratique, beaucoup d'ouverture, et de la responsabilité pour soutenir la liberté. Une vraie expérience immersive au cœur d'une vision très engagée du feedback, qui, je n'en doute pas, vous permettra de toucher du doigt une certaine magie dans la démarche.\r\nDisclaimer : ami.e.s de la Communication NonViolente, il est possible que vous y visitiez quelques territoires connus.",
        "end": "2022-05-24T16:40:00",
        "event": "2022",
        "format": "WORKSHOP",
        "id": "623ad67c8a5c755e7139c70a",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM3",
        "slug": "parlez-de-vous-faites-des-feedbacks-",
        "speakerIds": [
            "jquille"
        ],
        "start": "2022-05-24T14:50:00",
        "summary": "Vous avez déjà été exaspéré par un feedback ?  L’idée de donner, ou recevoir un feedback vous semble plus une corvée qu’un plaisir ?\r\nVoyons ensemble comment cette pratique, au-delà d’une mode de management, peut être un acte révolutionnaire en faveur des individus et des organisations apprenantes !",
        "title": "Parlez de vous, faites des feedbacks !",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2022-03-23T09:12:00",
        "description": "Remplacez “mouton” par “appli”, et vous retrouvez un dialogue courant entre développeurs, architectes, et utilisateur métier. Comment se comprendre quand on n'a pas le même point de vue sur l'appli à produire?\r\nIl faudrait pouvoir travailler sur les mêmes données, celles qui décrivent l'appli, mais en faisant varier les représentations, en fonction des points de vue. Pour ça il nous faudrait un outil pour éditer des données et les représenter différemment, de manière très flexible, tout en gardant leur cohérence. Sirius Web est un nouveau projet open-source, qui simplifie la création de ce genre d’outil : définition d’un domaine, création d’éditeurs graphiques, le tout depuis un navigateur web. Durant ce talk nous reviendrons sur les différents cas d’usage, l’architecture et les choix techniques, pour laisser la place aux démos des principales fonctionnalités.",
        "end": "2022-05-24T15:40:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c710",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHID",
        "slug": "s-il-vous-plait-dessine-moi-une-appli-",
        "speakerIds": [
            "melaniebats"
        ],
        "start": "2022-05-24T14:50:00",
        "summary": "\"Non ! Celui-là est déjà très malade. Fais-en un autre.\"\r\n\"Tu vois bien, ce n'est pas un mouton, c'est un bélier. Il a des cornes.\"\r\n\"Celui-là est trop vieux.\"\r\nAlors, je griffonnais et je lançais:\r\n\"Ça c'est la caisse. Le mouton que tu veux est dedans.\"\r\n\" C'est tout à fait comme ça que je le voulais !\"",
        "title": "S'il vous plaît... dessine-moi une appli !",
        "topic": "design",
        "video": "https://vimeo.com/733369882"
    },
    {
        "addedAt": "2022-03-23T09:12:44.747",
        "description": "Dans ce talk, on parlera d'IA et de robots... mais on fera l'impasse sur le discours habituel que l'on entend trop souvent en ce moment ! À la place, voilà le menu : \r\n- en entrée, un petit cours d'histoire... car pour prendre du recul, il faut comprendre le passé. On apprendra notamment que l'IA dont on parle aujourd'hui n'a rien à voir avec les rêves des scientifiques qui ont posé les premières pierres de cette discipline !\r\n- pour continuer, on explorera quelques exemples d'application qui montreront qu'il n'y a pas que la data science et le deep learning dans la vie. \r\n- en dessert, on décortiquera la vie de Bob le robot... Cela montrera pourquoi il faut développer plusieurs \"formes\" d'intelligences... et permettra de mieux comprendre les limites des approches actuelles et les prochains défis de l'IA !",
        "end": "2022-05-24T15:40:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c712",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "tout-ce-que-l-on-ne-vous-dit-pas-sur-l-intelligence-artificielle-ia-",
        "speakerIds": [
            "amcordier"
        ],
        "start": "2022-05-24T14:50:00",
        "summary": "L'IA ? La 4ème révolution industrielle ! Les data ? Le nouveau pétrole ! L'éthique ? Vitale ! La voix ? L'avenir ! On vous raconte toujours la même chose non ? Pour changer, en partant des anecdotes historiques jusqu'aux exemples avec les robots, je vous montrerai les dessous de l'IA, sans bullshit.",
        "title": "Tout ce que l'on ne vous dit pas sur l'Intelligence Artificielle (IA)",
        "topic": "ethics",
        "video": "https://vimeo.com/733370099"
    },
    {
        "addedAt": "2022-03-23T09:12:44.757",
        "description": "[Apache Kafka](https://kafka.apache.org/) est aujourd’hui l'une des plateformes de messaging les plus populaires pour gérer les flux de données en temps réel. Beaucoup d’entreprises l’utilisent comme pilier dans une architecture microservice évenementielle ou pour construire leur plateforme de streaming.\r\n[Kafka Streams](https://kafka.apache.org/documentation/streams/) est la bibliothèque ultra-lègere permettant de manipuler, transformer, filter, enrichir,....les données au sein d’un cluster Apache Kafka et cela en s’abstrayant complétement du code de plomberie.\r\n\r\nRien de mieux qu’une petite mise en situation pour comprendre les concepts derrière Kafka Streams. Imaginez, vous travaillez pour une grande institution bancaire, The Bank Corp! Le salaire et les jours de congés vous ont fait accepter ce poste mais c’était sans compter le travail. Au sein de cette dernière, votre équipe business souhaiterait mettre en place des traitements en temps réel des transactions que vos clients réalisent. Ils souhaitent être en capacité de détecter des transactions financières particulièrement élevées, des potentielles fraudes mais également de pouvoir connaître le solde des comptes et tout cela en temps réel!\r\n\r\nDurant ce workshop, vous allez mettre en place la libraire Kafka Streams afin de répondre aux besoins de l’équipe métier.\r\nVous découvrirez les principaux concepts derrière Apache Kafka. Qu’est-ce qu’un topic, une partition, les offsets, la compaction, le co-partitioning ? Toutes ces notions que vous avez peut-être déjà entendu sans trop comprendre de quoi il en retourne. \r\nVous découvrirez également les caractéristiques d’une application Kafka Streams comme les notions de KStream, KTable, la sémantique exactly-once, en quoi ces applications sont résilientes, scalables, etc...\r\n\r\nCe workshop s’adresse aussi bien aux personnes ne connaissant pas le monde Kafka et aux personnes ayant déjà des notions souhaitant découvrir Kafka Streams.\r\n\r\nPré-requis :\r\n\r\n - JDK 11+\r\n - Maven\r\n - Git\r\n - Docker / Docker Compose\r\n - Votre IDE préféré\r\n",
        "end": "2022-05-24T16:40:00",
        "event": "2022",
        "format": "WORKSHOP",
        "id": "623ad67c8a5c755e7139c71b",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM4",
        "slug": "workshop-kafka-streams-101",
        "speakerIds": [
            "victor.gallet"
        ],
        "start": "2022-05-24T14:50:00",
        "summary": "Apache Kafka est aujourd’hui l'une des plateformes de messaging les plus populaires. Durant ce workshop, vous découvrirez les caractéristiques d’une application Kafka Streams : les notions de KStream, KTable, la sémantique exactly-once, et quoi ces applications sont résilientes, scalables, etc...",
        "title": "Workshop Kafka Streams 101",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2022-03-23T09:12:44.699",
        "description": "JetPack Compose est un outil étonnant que Google a pris 4 ans à mettre au point. \r\n\r\nInspiré des modèles de développement des interfaces utilisateurs tels que React, il propose un nouveau mode de programmation. Avec des mécanismes qui agissent lors de la compilation et d’autres au runtime, il garantit d’excellentes performances.\r\n\r\nCet outil a été amené un cran plus loin par JetBrains en le rendant multi-plateforme. Il s’agit désormais d’utiliser le même code Kotlin pour créer des interfaces qui seront déployées dans des environnement aussi bien mobiles, que desktop et web.\r\n\r\nLors de cette présentation, j’expliquerai les mécanismes mis en œuvre, et partagerai du code et des exemples permettant de comprendre les cas d’utilisation de ce nouvel outil.\r\n",
        "end": "2022-05-24T16:40:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6ef",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHID",
        "slug": "compose-multiplatform-un-framework-pour-toutes-vos-apps-",
        "speakerIds": [
            "g.zoritchak",
            "louis.cognault"
        ],
        "start": "2022-05-24T15:50:00",
        "summary": "Des apps mobiles, desktops, web réalisées avec un seul langage, performant et fun. On en a longtemps rêvé. Est-ce en train d’arriver?\r\n\r\nCompose Multiplatform, une extension du toolkit de Google par JetBrains, répond à cette problématique. Un code Kotlin unique déployé sur toutes les plateformes!",
        "title": "Compose Multiplatform: un framework pour toutes vos apps ?",
        "topic": "tech",
        "video": "https://vimeo.com/726166688"
    },
    {
        "addedAt": "2022-03-23T09:12:44.753",
        "description": "Gladys Diandoki explique ce qu'est l'UX Writing, nouveau métier du Design qui allie contenu et UX. Elle reviendra sur les 10 erreurs les plus fréquentes et les choses à mettre en place pour collaborer avec ces nouveaux profils du Design.\r\n\r\nObjectif :\r\n- Permettre de comprendre ce poste\r\n- Comprendre son rôle et son process\r\n- Collaborer avec les Product Designers/ UX Designers, les researchers, développeurs etc.\r\n- Les erreurs les plus fréquentes\r\n- Les bonnes pratiques\r\n\r\nCe que l'on doit retenir :\r\n- Ce que fait un UX Writer\r\n- Comment travailler ensemble\r\n- Quelques bases\r\n",
        "end": "2022-05-24T16:40:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c717",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM1",
        "slug": "ux-writing-10-idees-recues-revues-et-corrigees",
        "speakerIds": [
            "Gladysdit"
        ],
        "start": "2022-05-24T15:50:00",
        "summary": "Gladys Diandoki explique ce qu'est l'UX Writing, nouveau métier du Design qui allie contenu et UX. Elle reviendra sur les 10 erreurs les plus fréquentes et les choses à mettre en place pour collaborer avec ces nouveaux profils du Design.",
        "title": "UX Writing : 10 idées reçues revues et corrigées",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": "2022-04-12T07:04:25.221",
        "description": "Sander will explain this model and propose how we can use it to develop a roadmap to build technologies with the public interest at heart. What are the foundational issues to consider? What do design and development processes look like to build these other technologies? And how do we ensure that the wider society is involved in the crucial choices that need to be made to build it right? There are currently no alternative social media platforms that operate at scale AND put the public interest truly at their core. However, there are many initiatives that operate on a smaller scale that do provide an alternative platform or a piece of the solution for preserving people’s rights online. Sander will address the question of how we can build ecosystems of technologies in the public interest so that they are a true alternative for the commercial platforms of today.  ",
        "end": "2022-05-24T16:40:00",
        "event": "2022",
        "format": "TALK",
        "id": "6255260ae536d64281c4062c",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "ROOM2",
        "slug": "building-online-spaces-with-the-public-interest-at-heart-",
        "speakerIds": [
            "van.der.waal"
        ],
        "start": "2022-05-24T15:50:00",
        "summary": "Sander van der Waal is Research Director at the research institute and cultural institution Waag, based in Amsterdam. Waag’s research into technology and its experiments and proposals to build technologies with public values at the center has culminated in the model ‘Public Stack’ (https://publicstack.net).",
        "title": "Building online spaces with the public interest at heart 💚 ",
        "topic": "design",
        "video": "https://vimeo.com/728605340"
    },
    {
        "addedAt": "2022-03-23T09:12:44.694",
        "description": "Encore un talk sur les femmes dans l'informatique. Vous ne comprenez pas ces sujets : pourquoi chercher plus de mixité dans les équipes ? Une entreprise recrute la personne la plus compétente, point. Les femmes et les hommes sont complémentaires, avec chacun et chacune leur points forts. Pourquoi \"forcer\" les gens à aller dans un secteur plutôt qu'un autre ? Si les femmes n'aiment pas l'IT, laissons les tranquilles, nous sommes dans un pays libre !\r\nPeut-être qu'au contraire, vous souhaitez plus de diversité dans votre équipe, mais vous ne savez pas comment vous y prendre. Avec seulement 15% de femmes en sortie des écoles d'ingénieurs, les chances d'y parvenir sont limitées. C'est plutôt aux collèges et lycées de les inciter à aller dans ces filières.\r\n\r\nC'est exactement ce que j'ai pensé pendant mes dix premières années de manager. J'ai recruté UNE femme en dix ans.\r\n\r\nJ'ai réellement pris le sujet il y a deux ans chez Groupe La Centrale. Le taux d'entrée féminin à la direction technique est ainsi passé de 16% à 22%, soit une augmentation de 25%.\r\n\r\nJe vous propose de partager ce qu'on a fait et les bonnes pratiques de recrutement. Nous ferons aussi une passe sur comment garder les femmes dans le milieu et éviter qu'elles quittent l'IT au bout de quelques années.\r\n",
        "end": "2022-05-24T16:40:44",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6ec",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "comment-recruter-des-femmes-dans-un-milieu-d-hommes-et-enfin-avoir-des-equipes-diverses-et-la-competence-alors-",
        "speakerIds": [
            "fchabanois"
        ],
        "start": "2022-05-24T15:50:44",
        "summary": "Confiture garantie 100% artisanale, savon sans paraben, carottes bio, nous avons développé une certaine aversion pour tout ce qui n'était naturel.\r\nAlors pourquoi aller à l’encontre de la nature et des préférences des gens en cherchant plus de mixité dans les équipes IT ? Et comment procéder ?\r\n",
        "title": "Comment recruter des femmes dans un milieu d’hommes et enfin avoir des équipes diverses. Et la compétence alors ?  ",
        "topic": "team",
        "video": "https://vimeo.com/733369890"
    },
    {
        "addedAt": "2022-03-23T09:12:44.734",
        "description": "La mutualisation de ressources informatiques a apporté très tôt des gains économiques pour les clients et établi une séparation des responsabilités entre fournisseur de services et client.\r\nCe nouveau métier de l'hébergement puis du Cloud a fait apparaitre des enjeux d'efficience énergétique pour ces fournisseurs depuis de nombreuses années.\r\nMais en 2022, concrètement, qu'est-ce que cela veut dire ?\r\nCe talk propose de tout d'abord faire un statut sur l'impact écologique du numérique en France et les projections pour 2025 et 2050 suivant différents scénarios de sobriété établis par l'ADEME dans son étude « Transition(s) 2050».\r\nNous nous intéresserons ensuite à des initiatives et engagements de plusieurs hébergeurs et fournisseurs Cloud européens comme Interxion, Scaleway ou Orange et également américains comme GCP ou AWS.\r\nA travers ces exemples concrets, cela nous amènera à discuter thermodynamique dans un centre de données, économie circulaire, indicateurs énergétiques des centres données comme le Power Usage Effectiveness (PUE) ou encore données rafraîchies régulièrement par les fournisseurs Cloud permettant d'appréhender au quotidien l'impact écologique de nos déploiements Cloud",
        "end": "2022-05-24T17:50:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c708",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "numerique-responsable-ouvrons-le-capot-des-fournisseurs-cloud",
        "speakerIds": [
            "clement0210"
        ],
        "start": "2022-05-24T17:00:00",
        "summary": "En 2022, le numérique responsable dans le Cloud devient tout autant un enjeu que la qualité de service ou le prix. Entre mythe et réalité, regardons ensemble comment nos fournisseurs Cloud adoptent des stratégies vertueuses pour l'environnement",
        "title": "Numérique responsable, ouvrons le capot des fournisseurs Cloud",
        "topic": "ethics",
        "video": "https://vimeo.com/726166819"
    },
    {
        "addedAt": "2022-03-23T09:12:44.75",
        "description": "Dans les moteurs de recherche du Web, la pertinence et l'ordre des résultats sont gérés par le nombre de liens, la qualité et la conformité avec certaines règles, et un peu de personnalisation. Les sites e-commerce classent et filtrent les résultats au moyen d'algorithmes business. En entreprise, la pertinence des résultats peut être configurée par les experts et expertes des différents domaines. D'un autre côté, les réseaux sociaux fournissent une expérience basée principalement sur la notoriété : les préférences et le suivi des autres utilisateurs.\r\nNous tentons de regrouper le meilleur de ces mondes en créant [all.site](https://all.site) - un moteur de recherche collaboratif dont le contenu et la pertinence seraient proposés par la communauté à la manière de Wikipedia ou GitHub.\r\nDans cette présentation nous partagerons avec vous l’expérience de cette aventure : ce que nous avons essayé, ce que nous avons appris, les limites que nous avons rencontrées et les étapes à venir. Nous vous présenterons le fonctionnement interne d'un moteur de recherche avec ses différentes étapes, l’architecture et l’infrastructure d’une telle plateforme, les notions de sécurité, le passage à l’échelle et la performance. ",
        "end": "2022-05-24T17:50:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c715",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHID",
        "slug": "un-moteur-de-recherche-communautaire-pour-organiser-internet-",
        "speakerIds": [
            "bootis"
        ],
        "start": "2022-05-24T17:00:00",
        "summary": "Est-il possible d’indexer tout Internet avec un nouveau moteur de recherche ? Nous ne le savons pas. Mais nous avons essayé en construisant un moteur de recherche collaboratif fonctionnant sur le modèle de GitHub et Wikipedia.",
        "title": "Un moteur de recherche communautaire pour organiser Internet ?",
        "topic": "ethics",
        "video": "https://vimeo.com/725687811"
    },
    {
        "addedAt": "2022-04-01T15:04:41.929",
        "description": "Toi aussi, tu trouves les entreprises inefficaces et le monde du travail inhumain ? Et ça te déprime ?\r\nBonne nouvelle ! Si tu as la motivation pour agir, ce talk est un manuel bourré de clés pratiques pour changer le monde du travail et faire rimer performance avec épanouissement.",
        "end": "2022-05-24T17:50:00",
        "event": "2022",
        "format": "TALK",
        "id": "624714f898ef0817db1fb6be",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM1",
        "slug": "de-bisounours-a-activistes-changeons-le-monde-du-travail-",
        "speakerIds": [
            "emilie.esposito"
        ],
        "start": "2022-05-24T17:00:00",
        "summary": "Toi aussi, tu trouves les entreprises inefficaces et le monde du travail inhumain ? Et ça te déprime ?\r\nBonne nouvelle ! Si tu as la motivation pour agir, ce talk est un manuel bourré de clés pratiques pour changer le monde du travail et faire rimer performance avec épanouissement.",
        "title": "De bisounours à activistes : changeons le monde du travail.",
        "topic": "team",
        "video": "https://vimeo.com/726167203"
    },
    {
        "addedAt": "2022-04-06T08:52:00",
        "description": "En 2019, je me suis lancée dans une aventure ambitieuse avec mon associée Aurore Bisicchia : créer un magazine papier sur le numérique ! De quoi dérouter les partisans du 100% digital et pourtant … Ce format avait pour nous deux beaucoup de sens. Tout d’abord parce que la presse papier se réinvente avec des formats longs et inspirants, une expérience de lecture forte et pour la plupart, sans pub : pensez à Sogood, Zadig, Socialter, Causette ou encore Usbek & Rica. La presse papier est loin d’être enterrée, bien au contraire, elle renait de ses cendres.\r\n\r\nMais aussi parce que les grands enjeux de la tech ne concernent pas (ou plus !) seulement les geeks. Des fake news au cyberharcèlement, en passant par le militantisme en ligne et les cryptomonnaies, les technologies sont absolument partout. Mieux, elles transforment en profondeur notre société toute entière, dans notre façon de communiquer, de consommer, de nous divertir, de manger, de faire du sport, de faire société. Chut! est donc avant un magazine de société, qui analyse les grands bouleversements d’aujourd’hui par le prisme du numérique.\r\n\r\nMais force est constater que dès que l’on parle de tech, les femmes sont minoritaires. On compte actuellement en France seulement 10% de femmes dans les profils tech. Or ce sont ces mêmes personnes qui sont aux manettes des outils qui façonnent le monde d’aujourd’hui et de demain\r\nEtant nous-mêmes deux femmes à la tête de ce média, nous avons tout de suite pris le parti d’affirmer un positionnement engagé en faveur de la diversité mais aussi de l’éthique et de la responsabilité dans ce secteur. Chut ! questionne ainsi nos usages, en valorisant les initiatives qui mettent les technologies au service du bien commun et de l’environnement, sans oublier de pointer les sujets qui questionnent et qui inquiètent comme la place grandissante des écrans.\r\n\r\nJe suis ravie de venir chez MiXiT vous raconter notre histoire, celle d’un média qui comptent aujourd’hui 10 numéros, près de 3000 abonnés, et une communauté engagée un peu partout en France.\r\n",
        "end": "2022-05-24T17:50:00",
        "event": "2022",
        "format": "TALK",
        "id": "624d5529e9e5e322c69dfa1a",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM2",
        "slug": "l-aventure-chut-",
        "speakerIds": [
            "sophie.comte"
        ],
        "start": "2022-05-24T17:00:00",
        "summary": "L’aventure Chut! Un magazine pour toutes celles et ceux qui s’intéressent au numérique.\r\n\r\nLe numérique et les technologies bouleversent nos vies. N’est-il pas temps de s’arrêter quelques instants pour comprendre ces grands bouleversements ? C’est le parti pris de Chut! Magazine, une revue trimestrielle disponible en kiosques et librairies, qui a reçu le prix Femmes & Numérique du groupe La Poste et le prix Médias en Seine de France Info, Radio France et les Echos.\r\n",
        "title": "L'aventure Chut!",
        "topic": "aliens",
        "video": "https://vimeo.com/733370823"
    },
    {
        "addedAt": "2022-03-23T09:12:44.738",
        "description": "Le geek suprême, Steve Jobs, l'a écrit : \" Je suis convaincu que la moitié qui sépare les entrepreneurs qui réussissent de ceux qui échouent est purement la persévérance. \" \r\nRéussir serait donc une question de volonté : quand on veut, on peut ! Les gens qui réussissent le doivent à leur travail et à leurs efforts, et les gens qui échouent, considérés comme des ratés, n'ont tout simplement aucune volonté. Dans la vie, tout ne serait donc qu'une affaire de mérite \r\npersonnel. \r\nÀ première vue, la méritocratie semble juste, assurant une égalité des chances pour permettre aux plus méritants de s'en sortir par le haut. Cependant, cela n'est-il pas aussi illusoire que dangereux ? Qu'est-ce que réussir sa vie ? Une vie réussie est-elle forcément celle d'un startuppeur ? Est-il bien vrai que la vie ne nous offre que ce que nous méritons ? La croyance dans le mérite ne permet-elle pas surtout de culpabiliser \" ceux qui ne sont rien \", et de tranquilliser ceux qui ont réussi, souvent privilégiés, convaincus qu'ils n'ont de compte à rendre à \r\npersonne ? ",
        "end": "2022-05-24T18:20:00",
        "event": "2022",
        "format": "KEYNOTE",
        "id": "623ad67c8a5c755e7139c70b",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "peut-on-reussir-sans-effort-ni-aucun-talent-",
        "speakerIds": [
            "GVervisch"
        ],
        "start": "2022-05-24T17:50:00",
        "summary": "Le geek suprême, Steve Jobs, a écrit : \" la moitié qui sépare les entrepreneurs qui réussissent de ceux qui échouent est purement la persévérance. \" \r\nMais cette croyance dans le mérite ne permet-elle pas de tranquilliser ceux qui ont \"réussi\", convaincus qu'ils n'ont de compte à rendre à \r\npersonne ?",
        "title": "Peut-on réussir sans effort ni aucun talent? ",
        "topic": "aliens",
        "video": "https://vimeo.com/728605722"
    },
    {
        "addedAt": "2022-03-23T09:12:44.712",
        "description": "France will host the 2024 Summer Olympics, but our emergency and warning system is based on World War II outdated sirens. Latest technological and natural disasters remind us how weak our country can be when calamities happens. In the same times we are proud of new tech, high tech, french tech. But how GOOD tech can saving lives in case of emergency? This talk will be about Tech State of The Art warning systems in order to be ready for the Games of the XXXIII Olympiad",
        "end": "2022-05-25T10:00:00",
        "event": "2022",
        "format": "KEYNOTE",
        "id": "623ad67c8a5c755e7139c6f9",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "how-to-build-the-alert-system-that-france-deserves-",
        "speakerIds": [
            "RatZillaS"
        ],
        "start": "2022-05-25T09:30:00",
        "summary": "Lubrizol, Irma, forest fires and all the winter storms in 2019 make us aware how much we need a strong emergency warning system in France. We are all almost excited by the the latest flagship handset, 5G but how these new devices, softwares and protocols can make our country safer and resilient ?",
        "title": "How to build the alert system that France deserves?",
        "topic": "tech",
        "video": "https://vimeo.com/726167284"
    },
    {
        "addedAt": "2022-03-23T09:12:44.707",
        "description": "Fear the ponies is a hacking workshop in the form of a code dojo having as main theme cryptography. It is a great problem solving training, an opportunity to share knowledge while programming and more important, it’s fun !",
        "end": "2022-05-25T12:30:00",
        "event": "2022",
        "format": "WORKSHOP",
        "id": "623ad67c8a5c755e7139c6f4",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM5",
        "slug": "fear-the-ponies-let-s-re-discover-cryptography-basics",
        "speakerIds": [
            "mmetesreau",
            "raphaelwach"
        ],
        "start": "2022-05-25T10:40:00",
        "summary": "Ponies just forged a secret alliance in order to end human civilization and their first move should happen in less than 1 hour. During this new escape game style coding dojo, we offer to challenge your knowledge and skills about encryption and to improve them while having fun !",
        "title": "Fear the ponies, let's (re)discover cryptography basics",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2022-03-23T09:12:44.724",
        "description": "Quel est le point commun entre une base de code entre les mains d'une équipe de dév, une équipe de dév au sein d'une entreprise, un produit vis-à-vis de ses utilisateurs, une entreprise vis-à-vis de son marché ?\r\n\r\nSi vous avez répondu du tac au tac \"ce sont des systèmes complexes soumis à des forces nombreuses avec des effets et des temporalités souvent difficiles à analyser\", vous devriez apprécier les défis proposés lors de cet atelier. Si vous n'avez pas fait le lien immédiatement, vous pourriez y faire une découverte utile voire salutaire.\r\n\r\nLe propos de cet atelier est d'explorer ce qui rend les systèmes si difficiles à gouverner, qu'il s'agisse de lignes de code ou de populations exposées à une pandémie, mais aussi de montrer en quoi certaines \"lois\" se retrouvent indépendamment des domaines et nous fournissent des outils et des réflexes à cultiver.",
        "end": "2022-05-25T12:30:00",
        "event": "2022",
        "format": "WORKSHOP",
        "id": "623ad67c8a5c755e7139c6ff",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM4",
        "slug": "le-jeu-du-frigo-petit-exercice-de-pensee-systemique",
        "speakerIds": [
            "Morendil",
            "christophe.thibaut"
        ],
        "start": "2022-05-25T10:40:00",
        "summary": "Dette technique, conflit dans une équipe, gestion d'une pandémie… sont autant d'exemples des difficultés qu'on rencontre pour analyser et maîtriser des systèmes complexes. Nous vous proposons un atelier pour partir à la découverte des lois qui les gouvernent, et des outils et réflexes à cultiver.",
        "title": "Le jeu du frigo - petit exercice de pensée systémique",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2022-03-23T09:12:44.729",
        "description": "Que vous soyez au développement, au support, à la hotline, à l'exploitation, il est probable que vous soyiez équipés d'un outil de \"ticketing\", \"bug tracker\" ou autre gestionnaire de demandes.\r\nAvez-vous déjà entendu une réponse à vos questions du genre \"Regarde d'abord le ticket, j'ai tout écrit dedans !\" ou encore \"ce n'est pas parce que ce n'est pas dans le ticket qu'il ne fallait pas le faire\" ?\r\n\r\nAu fil du temps, ces outils se sont implantés comme des piliers essentiels à la structuration des itérations et des flux Kanban, au point de remplacer le management visuel Post-It(c). \r\n\r\nPrévus pour structurer une information et la partager entre toutes et tous, ces outils accueillent désormais l'intégralité des backlogs produit. Mais alors, comment en sommes-nous arriver\r\nau constat que, sous couvert d'Agilité, nos organisations sont encore silotées, et que ces outils cristallisent des colères, des frustrations, des résignations ou des incohérences ?\r\n\r\nDans cette conférence (entièrement dessinée en direct), nous explorerons le paradoxe de ces bonnes pratiques d'Agilité qui conduisent les équipes à détruire leur communication, petit à petit. \r\n\r\nLes outils de tickets ne sont qu'un totem de cette perte de lien qui nuit aux organisations et aux produits, un symbôle de l'urgence à remettre la communication au cœur des équipes. \r\n\r\nJe vous partagerai des pratiques à encourager et celles à faire évoluer pour que le backlog produit soit est un point d'entrée commun qui reflète la qualité relationnelle de l'équipe. \r\n\r\nBénéfices\r\n\r\n- Apprendre à dire non...\r\n- Retrouver le sens de l'Agilité dans son équipe\r\n- Comprendre les paradoxes de fluidification du travail d'équipe comme l'arrêt des brainstorming\r\n- Trouver des pistes à explorer pour améliorer son Scrum, Kanban ou autre méthode agile retenue\r\n- Corriger certaines pratiques d'équipe\r\n\r\n",
        "end": "2022-05-25T11:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c704",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHID",
        "slug": "ma-vie-est-un-ticket-eloge-de-la-communication-paresseuse-et-enjeux-pour-l-agilite-du-futur",
        "speakerIds": [
            "romain"
        ],
        "start": "2022-05-25T10:40:00",
        "summary": "Toutes les équipes utilisent un outil de tickets. Quels avantages et surtout inconvénients cela pose-t-il, et encore plus dans un environnement dit Agile ? \r\nDans cette conférence, entièrement dessinée en direct, je pose les hypothèses d'un futur pour les équipes agiles ou pas.",
        "title": "Ma vie est un ticket ! Éloge de la communication paresseuse et enjeux pour l'Agilité du futur",
        "topic": "team",
        "video": "https://vimeo.com/728605842"
    },
    {
        "addedAt": "2022-03-23T09:12:44.731",
        "description": "Of course, you know everything you need to know about NULL in SQL! Well, are you sure ?\r\n\r\nNULL and three-valued logic are often misunderstood and can induce poor written queries, wrong written queries (when the result is not as expected) and a lot of time lost trying to figure out what your missing colleague wanted to do with such a tricky and bad-twisted SQL code.\r\n\r\nAfter defining NULL and UNKNOWN (and you'll see that it's not so simple), we'll go through different use cases where 3-valued is used, what pit you don't want\r\nto fall into and how you can improve query writing, now that you fully understand what's behind NULL in SQL. The queries will be run under PostgreSQL, as it is the most SQL-compliant RDBMS.",
        "end": "2022-05-25T11:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c705",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM2",
        "slug": "meet-null-the-unknown",
        "speakerIds": [
            "l_avrot"
        ],
        "start": "2022-05-25T10:40:00",
        "summary": "NULL in SQL is a pretty tricky concept. Wether you think you know it all or you admit that you could learn some things about it, come see this talk!\r\n\r\nAfter some explanations, this session will turn into a crazy quiz and I challenge you to achieve a faultless performance!",
        "title": "Meet NULL the UNKNOWN",
        "topic": "tech",
        "video": "https://vimeo.com/730352896"
    },
    {
        "addedAt": "2022-03-23T09:12:44.733",
        "description": "Cet atelier est né de la rencontre entre une pratique de la communication non violente d'un côté et la lecture des conclusions de recherche d'une neuro-scientifique de Harvard de l'autre.\r\n\r\nDans l'atelier nous aurons \r\n-de l'empathie avec de l'écoute active et de la relecture en binômes de situations émotionnellement chargées plus ou moins agréables.\r\n-de la théorie avec la découverte de la théorie des émotions construites, d'un modèle sur les éléments qui collectivement définissent une émotion et de l'essentiel de la communication non-violente.\r\n-de la créativité avec, à partir de ces situations, la création de néologismes, de nouveaux mots-émotions qui viennent témoigner de notre réel.\r\n\r\nJe suis Francois-Xavier Pasquier, un facilitateur en intelligence collective, à la fois curieux et exigeant sur le \"pourquoi ça marche ?\" ce qui m'a amené à ces recherches sur la nature des émotions et en quoi elles empêchent ou permettent la réalisation de l'individu et du collectif. Un facilitateur crée les conditions des dialogues, des décisions et in fine des organisations qui prennent sens. Je ne peux juste pas faire l'économie des émotions dans mon métier... et en fait, qui que vous soyez vous non plus ! \r\n\r\nSi je ne m'occupe pas de mes émotions, mes émotions s'occupent de moi ! Alors autant plutôt les co-créer.\r\n\r\nHâte de vivre cet atelier ensemble !",
        "end": "2022-05-25T12:30:00",
        "event": "2022",
        "format": "WORKSHOP",
        "id": "623ad67c8a5c755e7139c707",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM3",
        "slug": "nous-ne-sommes-pas-a-la-merci-de-nos-emotions-nous-les-co-creons",
        "speakerIds": [
            "fxpasquier"
        ],
        "start": "2022-05-25T10:40:00",
        "summary": "Venez changer de regard sur la nature des émotions et en co-créer de nouvelles. Oui, une émotion ça se créé.\r\n\r\nTelles sont les conclusion d'une neuro-scientifique de Harvard qui rejoignent la Communication Non-Violente. Actionnons à la fois intellects, coeurs et créativité dans cet atelier facilité.",
        "title": "Nous ne sommes pas à la merci de nos émotions. Nous les co-créons",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2022-03-23T09:12:00",
        "description": "Ca fait pas mal d'année que l'on a commencé le projet Valhalla au niveau de l'OpenJDK, on doit être au quatrième prototype et on commence à avoir une idée assez précise de comment cela doit fonctionner. Le but de ce talk est d'expliquer le modèle sur lequel on travaille, quels sont les choix que l'on à fait, comment cela s'intègre avec le reste de Java, comment les différentes features vont être délivré dans le temps et aussi de recueillir du feedback.\r\n\r\n",
        "end": "2022-05-25T11:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c718",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "valhalla-to-the-hell-and-back",
        "speakerIds": [
            "remi.forax"
        ],
        "start": "2022-05-25T10:40:00",
        "summary": "Valhalla veut révolutionner Java en introduisant une nouvelle sorte de classe qui marche plus ou moins comme des types primitifs mais défini par l'utilisateur.\r\n\r\nMais c'est quoi vraiment un type primitif ? java.lang.Object reste la classe mère de toutes les classes ? Et plein d'autres questions.",
        "title": "Valhalla: To the Hell and Back",
        "topic": "tech",
        "video": "https://vimeo.com/728605827"
    },
    {
        "addedAt": "2022-04-12T08:24:13.931",
        "description": "",
        "end": "2022-05-25T11:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "6255383ead7883553e81977b",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM1",
        "slug": "le-lean-startup-ca-donne-quoi-dans-la-realite-",
        "speakerIds": [
            "cedric.soubrie"
        ],
        "start": "2022-05-25T10:40:00",
        "summary": "Créer un business en quelques mois, c'est ce que promet le Lean Startup. Dans la réalité c'est plus compliqué.\r\n\r\nRetour d'expérience sur la première année de Treely et 5 conseils qui nous ont bien aidé.\r\n\r\nDe l'idée initiale, jusqu'aux premiers clients en passant par des occasions inespérées.",
        "title": "Le lean startup, ça donne quoi dans la réalité ?",
        "topic": "team",
        "video": "https://vimeo.com/730352903"
    },
    {
        "addedAt": "2022-03-23T09:12:00",
        "description": "Autrices : Natacha Portier et Nathalie Revol\r\nOrganisation lyonnaise : Natacha Portier (ENS de Lyon), Nathalie Revol (Inria), Jérôme Germoni (Université Claude Bernard - Lyon 1)\r\n\r\nPeu de femmes dans les métiers de l'informatique : moins de 30%, et même plutôt 15% si on se concentre sur les fonctions techniques. Ces chiffres ne sont hélas pas en progression, il ne suffit donc pas d'attendre benoîtement que la parité s'instaure d'elle-même. En effet, si on observe l'évolution des pourcentages depuis les années 1940 ou 1950, on constate une lente mais solide augmentation jusqu'en 1985 environ, puis une décroissance. Si on se concentre plutôt sur les effectifs, on observe que le nombre de femmes stagne alors que celui d'hommes a été multiplié par 3. Ce phénomène n'est pas propre à la France, il s'observe dans tous les pays occidentaux.\r\n\r\nSupériorité supposée de l'électronique sur le logiciel (où étaient cantonnées les femmes) aux débuts de l'informatique, assimilation des métiers de l'informatique à ceux de la bureautique, puis apparition de l'ordinateur personnel dans les foyers autour de 1985 et avec lui de la figure du geek asocial... entre des explications historiques et une vision de l'informaticien peu faite pour séduire les jeunes filles au moment de choisir leur orientation, les explications de ce phénomène sont multiples. Dans d'autres pays cependant, tels que la Malaisie, où les métiers de l'informatique sont vus comme requérant peu de force physique et permettent de travailler depuis son domicile, et donc de concilier vie personnelle et vie professionnelle, on observe un renversement complet des statistiques.\r\n\r\nPour contrer cette raréfaction des femmes dans les métiers liés aux mathématiques et à l'informatique, plus d'une centaine de journées \"Filles et maths-info : une équation lumineuse !\" à destination des lycéennes ont eu lieu depuis 2009, organisées par les associations Femmes&Math et Animath, soutenues par la Fondation Blaise Pascal. Nous organisons à Lyon une journée par an depuis 2015 et nous accueillons de 70 à 90 lycéennes pour chaque édition.\r\n\r\nLes objectifs de ces journées sont d'aider les jeunes filles à dépasser leur représentation des métiers scientifiques et techniques, à ne pas minorer leurs ambitions, à ouvrir l’éventail des choix possibles vers les filières scientifiques.\r\n\r\nLe format de ces journées est le suivant : puisque le thème central est l'informatique ou les mathématiques, nous commençons par une conférence scientifique, donnée par une chercheuse locale sur son domaine de recherche ou tout autre sujet de son choix, en lien bien sûr avec l'informatique ou les mathématiques (souvent appliquées). La deuxième partie de la matinée est consacrée à un atelier sur les stéréotypes : il s'agit à la fois d'informer, de mettre en évidence le poids des stéréotypes qui freinent les jeunes filles quand il s'agit de s'orienter vers un métier lié à l'informatique ou aux mathématiques, sans pour autant minorer leur importance, ni la majorer. L'équilibre est délicat et nous élaborons et améliorons ces ateliers en lien avec des sociologues spécialistes du sujet, Isabelle Collet et Clémence Perronnet. Ces ateliers s'effectuent en groupes de 25 à 30 lycéennes, ce qui permet à chacune de pouvoir s'exprimer.\r\n\r\nRencontrer des femmes qui travaillent dans l'informatique ou les mathématiques et échanger avec elles est primordial, pour une lycéenne, afin de pouvoir se projeter à son tour dans ces métiers, pour pouvoir s'imaginer les exercer : c'est pour cela que le début de l'après-midi est réservé à des speed-meetings où les lycéennes, en petits groupes de 10 au plus, rencontrent tour à tour 5 femmes pendant un quart d'heure. Ces femmes sont à des stades divers de leurs parcours : étudiantes ou en activité, et exercent dans des domaines variés : recherche ou privé, grosse entreprise ou petite structure...\r\nEnfin les lycéennes se retrouvent à nouveau toutes ensemble pour une représentation de théâtre-forum, avec une pièce conçue pour ces journées, adaptée à leurs préoccupations... et interactive.\r\n\r\nAvec Natacha Portier, nous présenterons ces journées, leur format, nos interrogations pour qu'elles soient le plus efficaces possible... et notre frustration de ne pas avoir de bilan chiffré, puisqu'il est difficile de savoir si nos actions ont permis à certaines lycéennes de considérer que les métiers de l'informatique et des mathématiques sont faits pour elles ou non, ni si elles ont franchi le pas.\r\n",
        "end": "2022-05-25T12:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c70c",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM2",
        "slug": "presentation-des-journees-filles-et-math-info-une-equation-lumineuse-",
        "speakerIds": [
            "revol.nathalie"
        ],
        "start": "2022-05-25T11:40:00",
        "summary": "Moins de 30% de femmes dans les métiers de l'informatique et les chiffres sont en baisse.\r\n\r\nPour contrer cela, nous organisons à Lyon une journée \"Filles et maths-info : une équation lumineuse !\" par an depuis 2015, à destination des lycéennes.  Nous détaillerons le contenu de ces journéees.",
        "title": "Présentation des journées \"Filles et math-info : une équation lumineuse !\"",
        "topic": "learn",
        "video": "https://vimeo.com/728605343"
    },
    {
        "addedAt": "2022-03-23T09:12:44.748",
        "description": "Un exercice de programmation vintage… et un outil d’aide à la composition électroacoustique\r\n==========\r\nJean-Jacques Girardot (programmeur), Jean-François Minjard (compositeur)\r\n\r\nQue faire quand un compositeur vous propose une collaboration tellement passionnante que vous ne pouvez refuser ?\r\nQue faire, également, lorsque l’on se retrouve à travailler dans une boîte à sable, avec un langage de programmation nu comme un ver ?\r\nOn redécouvre la roue, on commence à implémenter quelques structures, des tableaux, des tables de hashcode, et l’on finit par écrire une allocation mémoire, un compilateur, une gestion de processus légers, et une interface graphique… Ceci dans 32 Mo de mémoire.\r\n\r\nOn se félicite, dans ces conditions, de se souvenir de ses cours de structures de données du siècle dernier, et l’on s’étonne de voir à quel point ces algorithmes vintage sont encore pertinents aujourd’hui !\r\n\r\nC’est ainsi qu’est né le « Game Master », un outil multiphonique d’aide à la composition de musique électroacoustique, dont certains aspects de l’ingénierie vont être décrits dans cette présentation, qui se terminera, outil oblige, par une démonstration de ses possibilités,\r\nau travers de compositions de Jean-François Minjard. \r\n\r\nLa diffusion de ces pièces sera effectuée sur un système multiphonique en 14.1. ",
        "end": "2022-05-25T12:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c713",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "-un-exercice-de-programmation-vintage-et-un-outil-d-aide-a-la-composition-electroacoustique",
        "speakerIds": [
            "jflinjard",
            "jj.girardot"
        ],
        "start": "2022-05-25T11:40:00",
        "summary": "Votre environnement est une boîte à sable, avec un langage de programmation démuni de tout ? Redécouvrez la roue, implémentez quelques structures et terminez par un compilateur. Voici le \"Game Master\", un outil d'aide à la composition de musique électroacoustique, et les étapes de sa conception...",
        "title": " Un exercice de programmation vintage… et un outil d’aide à la composition électroacoustique",
        "topic": "aliens",
        "video": "https://vimeo.com/733370300"
    },
    {
        "addedAt": "2022-03-23T09:12:44.756",
        "description": "Vous avez peut-être parfois de la difficulté à déchiffrer certains concepts, à comprendre le point de vue ou le comportement de l'autre, ou ce qui provoque une certaine gêne ou tension chez vous.\r\nLorsque vous arrivez à donner du sens à un phénomène qui pouvait sembler nébuleux ou dont vous n'arriviez pas à relier tous les signes, vous faites de l’herméneutique.\r\nLa violence herméneutique, c’est quand on rend l’interprétation difficile pour l’autre, volontairement ou non.\r\nCe talk vise à faire prendre conscience du processus et à éviter ou s'armer contre ce type de violence.",
        "end": "2022-05-25T12:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c71a",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHID",
        "slug": "violence-hermeneutique-comment-eviter-le-malaise-",
        "speakerIds": [
            "Sara.Dufour",
            "malk_zameth"
        ],
        "start": "2022-05-25T11:40:00",
        "summary": "Apprendre à nous défendre des mécanismes qui nous empêchent de faire sens.\r\nDes mécanismes qui nous forcent à rester dans une situation de gêne de l’incompréhension. Qui nous font même douter de notre vécu.",
        "title": "Violence herméneutique - comment éviter le malaise ?",
        "topic": "team",
        "video": "https://vimeo.com/726166698"
    },
    {
        "addedAt": "2022-03-23T09:12:44.688",
        "description": "Un journal de codeur(se) vous permettra d'améliorer la qualité de votre code, de vous fixer et de suivre vos objectifs, de garder la trace de vos succès, de vos découvertes, de vos lectures, de soulager le stress de votre travail... C'est un outil presque sans limite, personnel et que vous pouvez tailler exactement à la mesure de vos besoins. ",
        "end": "2022-05-25T12:30:44",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6e9",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM1",
        "slug": "avoir-un-journal-de-codeur",
        "speakerIds": [
            "cosjava"
        ],
        "start": "2022-05-25T11:40:44",
        "summary": "Avez-vous déjà perdu du temps à rechercher les mêmes snippets de code ? L'impression d'avoir déjà résolu le même problème mais oublié comment ? L'envie de devenir un(e) meilleur(e) développeur(se) ? La réponse c'est d'avoir un journal de codeur(se). Comment ? Quand ? Pourquoi ? Parlons-en !",
        "title": "Avoir un journal de codeur",
        "topic": "tech",
        "video": "https://vimeo.com/733370082"
    },
    {
        "addedAt": "2022-03-23T09:12:44.725",
        "description": "Le développement de technologies relevant de \"l'intelligence artificielle\" (IA) occupe une place importante de l'espace médiatique contemporain et oriente de plus en plus les programmes d'investissements publics et privés. Ce développement s'accompagne de mouvements civiques plus ou moins organiques, dont l'émergence d'organisations non-gouvernementales dédiées. Ces mouvements semblent privilégier une \"éthique de l'algorithme\" aux \"droits numériques fondamentaux\" qui sont plus fréquemment associés avec des revendications d'accessibilité et d'usages équitables pour toutes et tous. Ces mouvements ainsi que des think tanks plus traditionnels souhaitent ainsi infléchir les manières dont \"on fait de l'IA\" en éditant, notamment, des guides et autres position papers sur les systèmes éthiques que la masse informe des \"développeurs d'IA/d'algorithmes\" devrait adopter pour le salut de l'humanité.\r\n\r\nSi ces activités sont nécessaires pour permettre à des visions d'émerger et signent une vivacité intellectuelle, l'impact réel de leurs apports reste encore à démontrer. Mais plus prégnante encore est la relative homogénéité des valeurs dans ces activités et de leur tendance à dessiner une morphologie particulière de \"l'éthique de l'IA\". Ainsi, l'analyse de près de 200 guides présentant de bonnes pratiques et des recommandations pour une \"IA éthique\" permet d'identifier les préoccupations principales de ces initiatives telles que les tensions entre développement économique et les limites d'une prise de décision automatisée appliquée à large échelle. D'une part, ces guides font émerger une \"éthique de l'AI\" difficilement dissociable d'une éthique business. D'autre part, lorsque les guides portent sur les droits fondamentaux, le parti pris est celui d'un universalisme occidental. Ainsi par ex., plus d'un quart de ces guides émanent d'initiatives nord-américaines et pratiquement autant d'initiatives d'Europe de l'Ouest ; une seule telle initiative provient d'Europe centrale et il ne semble pas y avoir de telles initiatives émanant d'Europe de l'Est ou de l'Afrique. Au-delà de la question de \"qui\" impose un système de valeurs émerge aussi la question de la forme que prennent ces recommandations et, ainsi, du danger du dévoiement de sens du mot \"éthique\".\r\n\r\nCette intervention propose une exploration des différents guides publiés à ce jour pour provoquer une discussion sur l'avenir moral qu'ils dessinent.",
        "end": "2022-05-25T14:30:00",
        "event": "2022",
        "format": "KEYNOTE",
        "id": "623ad67c8a5c755e7139c700",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "quelles-valeurs-pour-une-regulation-de-l-ia-par-l-ethique-",
        "speakerIds": [
            "MaliciaRogue"
        ],
        "start": "2022-05-25T14:00:00",
        "summary": "Le développement de technologies relevant de \"l'intelligence artificielle\" (IA) occupe une place importante de l'espace médiatique contemporain et oriente de plus en plus les programmes d'investissements publics et privés. Ce développement s'accompagne de mouvements civiques plus ou moins organiques, dont l'émergence d'organisations non-gouvernementales dédiées. Ces mouvements semblent privilégier une \"éthique de l'algorithme\" aux \"droits numériques fondamentaux\" qui sont plus fréquemment associés avec des revendications d'accessibilité et d'usages équitables pour toutes et tous. Ces mouvements ainsi que des think tanks plus traditionnels souhaitent ainsi infléchir les manières dont \"on fait de l'IA\" en éditant, notamment, des guides et autres position papers sur les systèmes éthiques que la masse informe des \"développeurs d'IA/d'algorithmes\" devrait adopter pour le salut de l'humanité.",
        "title": "Quelles valeurs pour une \"régulation de l'IA par l'éthique\" ?",
        "topic": "ethics",
        "video": "https://vimeo.com/733370342"
    },
    {
        "addedAt": "2022-05-03T20:29:15.022",
        "description": "Les inscriptions se font exclusivement via la billetterie [BilletWeb.fr](https://www.billetweb.fr/atelier-mixteen-2022). \r\nVous pouvez suivre les news sur le [compte Twitter](https://twitter.com/mixteen_lyon) et la page [Facebook](https://www.facebook.com/mixteen.lyon/).\r\n\r\nPlusieurs activités seront proposées:\r\n\r\n* Pour tous : Scratch\r\n* Ateliers de découverte des principes de l'informatique : jeux pour découvrir le binaire, le codage d'images...\r\n* Thymio : un petit robot facile à programmer qui permet de comprendre les bases de la robotique, et se déplace suivant les différentes instructions des enfants.\r\n* Micro:bit : une carte élaboré sous la supervision de la BBC à destination des écoliers anglais. Elle permet l’initiation à l’électronique, l’IoT et la programmation.\r\n\r\nLes enfants peuvent venir avec leur ordinateur portable et un goûter à base des célèbres crêpes de MiXiT leur servi\r\n\r\n* Accueil des enfants à partir de 14h pour démarrer l'atelier à 14h30\r\n* Accueil des parents à partir de 17h30 pour voir ce que les enfants ont codé \r\n* A 18h15, tout ce petit monde montera sur scène devant l'assemblée réunie de MiXiT.\r\n",
        "end": "2022-05-25T18:30:00",
        "event": "2022",
        "format": "TALK",
        "id": "627191cf79f6111e95ace03e",
        "language": "FRENCH",
        "photoUrls": [
            {
                "name": "MixTeen",
                "url": "https://farm1.staticflickr.com/948/40967510324_55436b510f_z_d.jpg"
            },
            {
                "name": "MixTeen",
                "url": "https://farm1.staticflickr.com/969/39870848370_af1db19128_z_d.jpg"
            },
            {
                "name": "MixTeen",
                "url": "https://farm1.staticflickr.com/909/40967509974_01d12b345e_z_d.jpg"
            },
            {
                "name": "MixTeen",
                "url": "https://farm1.staticflickr.com/944/40786994345_3cf4c3c3d2_z_d.jpg"
            },
            {
                "name": "MixTeen",
                "url": "https://farm1.staticflickr.com/965/40786995285_3bee2947d5_z_d.jpg"
            },
            {
                "name": "MixTeen",
                "url": "https://farm1.staticflickr.com/829/41676895901_0b2ecb4f29_z_d.jpg"
            },
            {
                "name": "MixTeen",
                "url": "https://farm1.staticflickr.com/907/41676895381_f91fb6a346_z_d.jpg"
            }
        ],
        "room": "ROOM7",
        "slug": "mixteen-2022-born-to-code",
        "speakerIds": [
            "106329914971209052078",
            "115833292931696563446",
            "Angelique",
            "anoseda",
            "charles.de-magneval",
            "clem",
            "gerald.quintana",
            "pierre.sassoulas",
            "titimoby",
            "vbonnefond"
        ],
        "start": "2022-05-25T14:30:00",
        "summary": "Cet atelier réservé aux enfants inscrits au préalable et aura lieu sur la mezzanine. \r\nSuivez les panneaux si vous voulez voir les ateliers et échanger avec les différents intervenants. \r\nLes participants, les enfants apprennent à créer des mini-jeux, à programmer des robots, à assembler des composants électroniques... \r\n",
        "title": "Mixteen 2022 : Born to code",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": "2022-05-25T14:50:44",
        "description": "Nous avons tou.te.s des certitudes, que l’on porte sur soi, les autres ou la vie en général... Et c'est normal !\r\nToutefois, ces dernières, conscientes ou inconscientes, influencent nos actions et peuvent parfois nous limiter. Je vous propose dans cet atelier, à faire seul.e ou en équipe, les clés pour reconnaitre, comprendre et agir sur vos croyances afin d’en faire les atouts de vos projets. \r\n\r\nAlors si vous ne voulez pas vous réveiller au même point dans 3 ans, passez à l’action en apprenant à sortir de votre schéma de résignation ! \r\nVia cet atelier qui s'équilibre entre théorie et pratique, faites le choix de vous détacher d'une croyance limitante afin de créer et/ou renforcer une croyance aidante.\r\n\r\nCet atelier peut vous aider à prendre conscience de vos croyances parfois tellement ancrées que vous pensez que c’est dans votre ADN. \r\n\r\nAvec cet atelier vous serez en mesure de : \r\n- Détecter ce qui vous empêche d’avancer \r\n- Lever vos blocages \r\n- Mettre en place des projets qui vous semblaient impossibles \r\n- Vous libérer des pensées qui vous freinent et vous prennent de l’énergie\r\n- Désamorcer des tensions en équipe\r\n",
        "end": "2022-05-25T16:40:00",
        "event": "2022",
        "format": "WORKSHOP",
        "id": "623ad67c8a5c755e7139c6e8",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM3",
        "slug": "-arretez-l-auto-sabotage-et-sortez-de-votre-boucle-systemique-",
        "speakerIds": [
            "albane.fagot"
        ],
        "start": "2022-05-25T14:50:00",
        "summary": "Combien de fois avez-vous renoncé à un projet sous prétexte que “ça ne marchera jamais”, “On ne peut pas tout avoir”, ou encore [insérez ici votre conviction] ?\r\nParce que vos croyances influencent vos actions, apprenez à sortir de ce schéma de résignation grâce à la systémique et aux neurosciences.",
        "title": "🤯 Arrêtez l’auto sabotage et sortez de votre boucle (systémique)",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2022-03-23T09:12:44.703",
        "description": "> \"Je ne peux rien faire changer dans cette boîte, je suis seulement [ton titre de job] !\"\r\n\r\nPas terrible comme constat.\r\n\r\nEt pourtant, dans tes missions ce n'est pas rare qu'il faille sauver le projet de la noyade, ou éteindre les incendies. Alors de ton côté, tu finis avec **ce sentiment frustrant d'impuissance**.\r\n\r\nParce que, forcément, tu dois :\r\n\r\n- travailler dans le rush, parce que certaines US ne sont prêtes que 4 jours avant la fin du sprint en cours\r\n- rattraper les 3 mois de retards sur la livraison de la release 1.5.2\r\n- reprendre l'activité de quelqu'un qui sort du projet avec seulement 5 jours de biseau (dans le meilleur des cas)\r\n\r\nAlors tu proposes des changements, des améliorations pour aider.\r\n\r\nMais comme d'habitude, dans *ce* contexte tous les changements sont difficiles à entreprendre, tout est lent à mettre en place...\r\n\r\nEt les seules réponses que tu obtiens c'est :\r\n\r\n- \"*Mettre en place une intégration continue ? On y a pensé, mais chez nous on ne peut pas, c'est TELLEMENT compliqué.*\"\r\n\r\n- \"*La rétrospective ? Laisse tomber, nous on y va pas, ça sert à rien.*\"\r\n\r\n- \"*Bien sûr qu'on aimerait bien améliorer la couverture de tests, mais on a vraiment pas le temps.*\"\r\n\r\n**Et j’imagine que tu pourrais en citer d’autres.**\r\n\r\nDans ces conditions, tu t'épuises sans doute à essayer de faire bouger les choses sans résultat. \r\n\r\nPeut-être même que tu te demandes comment tu vas réussir la mission qu'on t'a confiée vu le contexte ?\r\n\r\n**Et c'est bien normal.** \r\n\r\nN'importe qui douterait..\r\n\r\nMais tu n'es peut-être pas n'importe qui... ?\r\n\r\nSi tu veux enfin savoir comment \r\n\r\n- mieux utiliser ton énergie, \r\n- redonner l'envie à ton équipe de s'améliorer sans que tu aies besoin de tout porter seul.e, \r\n- déclencher le tilt pour que les choses changent, \r\n\r\n🏆 Alors tu as trouvé le bon atelier !\r\n\r\nAu travers d'*exemples concrets* et de *mise en pratique*, nous allons t'initier à l’art subtile de faire bouger les choses en **détournant les pratiques des coachs et des managers**.\r\n\r\nMonte à bord de notre navire Pirate pour découvrir \r\n- les secrets de la *Stratégie des Alliés* ⚔, \r\n- le *Dead Poulpe* 🐙 \r\n- et des petites *techniques de manipulation* 😇... \r\n\r\n**Lance-toi et réveille la/le véritable pirate qui sommeille en toi.**\r\n\r\nQu'est-ce que tu attends ? arrête de frotter le pont moussaillon et... **À L'ABORDAGE** ! 🏴‍☠️",
        "end": "2022-05-25T16:40:00",
        "event": "2022",
        "format": "WORKSHOP",
        "id": "623ad67c8a5c755e7139c6f2",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM4",
        "slug": "deviens-un-e-veritable-pirate-",
        "speakerIds": [
            "alison.jorre",
            "melanie-cordero"
        ],
        "start": "2022-05-25T14:50:00",
        "summary": "\"Je ne peux rien faire changer dans cette boîte, je suis seulement  !\"😔\r\nC'est ce que tu penses en regardant ta job ?\r\nAlors monte sur le pont et apprends à faire bouger les choses avec des techniques de Pirate ! 🏴‍☠️\r\nCartographie 🗺, pieuvre 🐙 et manipulation 😈 au rendez-vous !",
        "title": "Deviens un.e véritable Pirate ! 🏴‍☠️",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2022-03-23T09:12:44.722",
        "description": "",
        "end": "2022-05-25T15:40:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6fe",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM2",
        "slug": "le-jaillissement-de-l-esprit-7-ans-apres-",
        "speakerIds": [
            "Saskia_Blanc"
        ],
        "start": "2022-05-25T14:50:00",
        "summary": "En juin 2016, je suis en CM2 et je peux sécher car je fais la keynote d'ouverture de RivieraDev ! Je vais même faire du live coding sur scène, j'y prends goût et ce n'est que le début. Sept ans plus tard vous découvrirez si mon esprit jaillit toujours et si je veux toujours être développeuse ...",
        "title": "Le jaillissement de l'esprit 7 ans après ... ",
        "topic": "aliens",
        "video": "https://vimeo.com/726160174"
    },
    {
        "addedAt": "2022-03-23T09:12:44.74",
        "description": "Développer une application, un site, un service, un jeu… c’est à peu près aussi simple que trois copier/coller après voir maté deux tutos YouTube. Bref, développer c’est facile. Mais l’elfique… Ah ça c’est compliqué l’elfique. C’est long, très long, et puis ça ne veut rien dire si on n’a pas fait elfique LV2. \r\n\r\n> On entend par représentation : le droit notamment de communiquer ou faire communiquer, présenter, représenter, ou faire présenter, représenter, transmettre ou faire transmettre, télétransmettre ou faire télétransmettre tout ou partie du Jeu Vidéo intégrant tout ou partie des Travaux, tout double ou copie, toute exploitation secondaire et dérivée, de manière permanente ou provisoire, en tout ou en partie, à titre onéreux ou non, pour tout format, forme et définition, en toute langue, ou multilingue, pour toutes les exploitations visées aux présents articles, par tout procédé ou support (notamment les supports Off-line et On-line)\r\nmême non prévisible ou non prévu au présent Contrat dans tout lieu privé et/ou accessible au public qui permet de la communiquer au public de manière directe et indirecte.\r\n\r\nQui, en 2022, fait des phrases de 122 mots ? Les elfes… et les avocats. Deux espèces qui sont beaucoup plus cool quand tu comprends ce qu’elles racontent. Le légal ça semble compliqué et ça fait peur… Mais le secret c’est que ça fait peur surtout parce que ça à l’air compliqué. \r\n\r\nLe développeur insouciant n’existe plus vraiment… aujourd’hui, oublier de mentionner une personne, ne pas fournir de CGU, ou publier une photo qui contient le mauvais élément peut mettre à mal la viabilité de ton site, service, ou produit… un truc aussi bête qu’une photo de la tour Eiffel postée sur ton site peut t’amener des courriers que tu aurais préféré éviter. \r\n\r\n**Maitre Florence Houisse** (elfe au barreau de Paris) et **Laurent Victorino** (humain développeur de jeux vidéo) debunkeront un sujet qu’on ne traite que trop peu de crainte de finir en prison : légal vs développeur. Par des exemples concrets, et quelques histoires persos, ils te donneront les outils et bases à intégrer dans tes réflexions de travail pour que tu puisses flex sans jamais te soucier de finir en prison*. \r\n\r\n\r\n* On va t’aider à ne pas finir en prison _à cause de ton boulot_ hein, on ne va pas non plus t’expliquer comment gruger les impôts ou importer de la drogue en douce, ca c’est pour notre autre talk, celui de 14h.\r\n",
        "end": "2022-05-25T15:40:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c70d",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHID",
        "slug": "quelques-petits-conseils-pour-eviter-la-prison",
        "speakerIds": [
            "florence.houisse",
            "lvictorino"
        ],
        "start": "2022-05-25T14:50:00",
        "summary": "Un talk détendu sur un sujet qui tend : le légal et le dev. \r\nAu programme :  des mots qui font peur, des contrats en elfique, des photos de méchants avocats, des conseils, et même des images si tu ne parles pas latin. Bref on va te debunk le légal et t'aider à éviter la prison.",
        "title": "Quelques petits conseils pour éviter la prison",
        "topic": "ethics",
        "video": "https://vimeo.com/726166681"
    },
    {
        "addedAt": "2022-03-23T09:12:44.746",
        "description": "97.4% – that’s how many of the world’s top 1M homepages have basic accessibility issues, according to the [WebAIM Million analysis](https://webaim.org/projects/million/). This appalling number is a reminder of how our choices as an industry have an impact on website users. It’s also a call to action! We’ll see how we got there, what systemic problems we’re dealing with, and potential solutions.\r\n\r\nAlong the way, we’ll learn about the choices the team behind [Wagtail](https://wagtail.org/) made, to improve the accessibility of all sites built with the CMS.",
        "end": "2022-05-25T15:40:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c711",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "the-97-4-north-star",
        "speakerIds": [
            "thibaud_colas"
        ],
        "start": "2022-05-25T14:50:00",
        "summary": "97.4% – that’s how many of the world’s top 1M homepages have basic accessibility issues, according to the WebAIM Million. This is unacceptable. We can do better. We’ll consider the impact of technology on accessibility, and potential solutions. We’ll look at how Wagtail tries to tackle this reality.",
        "title": "The 97.4% North Star",
        "topic": "tech",
        "video": "https://vimeo.com/726166919"
    },
    {
        "addedAt": "2022-03-23T09:12:44",
        "description": "Cette conférence se veut un retour d'expérience de mon utilisation de l'atelier Example Mapping introduit par Matt Wynne & les équipes de Cucumber Londres il y a 6 ans\r\n\r\nLe format de l'atelier est des plus simples. Je l'ai découvert à l'occasion d'un meetup DDD Paris en 2017 ou 2018 et ai voulu l'appliquer rapidement sur mes projets. Et là, ce fût le drame !\r\n\r\nJe partagerai donc ici avec l'audience mes 11 heuristiques pour réussi à coup sûr son atelier (ou plus probablement, réduire les chances de se planter ;)). Après avoir fait quelques rappels sur le Behavior-Driven Development, j'aborderai (dans cet ordre ou pas...) :\r\n\r\n1. Il faut savoir poser un exemple concret !\r\n2. Pas besoin d’écrire ses exemples au format Gherkin ! Faites au plus simple, croquis, schémas, etc.\r\n3. La pierre angulaire, c’est l’exemple concret. \r\n> Les règles et US ne sont que des blocs pour classifier les exemples entre eux de manière cohérente et compréhensible. \u2028Corollaire : ne pas toujours démarrer par les cartes jaunes et bleues (US et règles) : commencez par donner des exemples.\r\n\r\n4. Les cartes jaunes ne sont pas que rarement des US au démarrage de l’atelier.\u2028\r\n> Et on s’en fout ! L’atelier est un formidable outil pour grouper des exemples (cf. heuristique n°3).\r\n\r\n5. Le vote de confiance sera très souvent négatif sur l’ensemble de la carte : il reste souvent des inconnus. Le faire alors sur des sous-ensemble cohérents et qui sont prêts.\u2028\r\n\r\n6. Atelier difficile à tenir à distance. \r\n> Même si des outils tels que Miro proposent un template spécifique, on est en difficulté pour écrire les exemples efficacement (cf. heuristique n°2).\r\n\r\n7. S’assurer de capter toute la connaissance.\r\n> Chaque question / interrogation doit donner lieu à une carte rouge ou un exemple concret : souvent besoin d’un facilitateur dédié à cette tâche. Dur d’être partie prenante.\r\n\r\n8. S’assurer d’avancer : fast & furious @Bruno Boucard\r\n\r\n9. Préparez-vous au chaos  !\r\n> Inconfort car l’on ne navigue pas forcément dans la direction attendue. On peut découvrir des pans complets du métier et ce n’est pas forcément ce qui était attendu / prévu par le PO ou expert métier. _« Vous ne saviez pas que vous ne saviez pas. Maintenant, vous le savez ! »_.\r\n\u2028\r\n10. La couleur dominante de votre carte vous dira beaucoup sur l’avancée de l’atelier et le partage de votre connaissance.\r\n11. De l’art de trouver la fréquence idéale.\u2028\r\n> 25 minutes, c’est souvent court et frustrant. Alors comment optimiser cet atelier ? Quelle fréquence ? Combien de sessions à la suite ?",
        "end": "2022-05-25T15:40:44",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6e4",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM1",
        "slug": "11-heuristiques-pour-reussir-a-coup-sur-ses-ateliers-d-example-mapping",
        "speakerIds": [
            "c_heliou"
        ],
        "start": "2022-05-25T14:50:44",
        "summary": "L'Example Mapping apporte un cadre structurant à la pratique du BDD. Cet atelier efficace redonne ses lettres de noblesses à la collaboration entre experts métiers, développeurs et testeurs. Mais son format accessible cache bon nombre de pièges. Voici 11 heuristiques pour le réussir à coup sûr.",
        "title": "11 heuristiques pour réussir à coup sûr ses ateliers d'Example Mapping",
        "topic": "tech",
        "video": "https://vimeo.com/726166882"
    },
    {
        "addedAt": "2022-03-23T09:12:44.697",
        "description": "Vous ne connaissez pas Elm ? Ce n'est pas très grave, le compilateur de ce langage frontend qui garantit l'absence d’erreur d’exécution est là pour vous aider ! \r\n \r\nJe vous propose de coder sans connaître le langage avec ce format un peu particulier : étant des développeurs très distraits, nous avons commencé pas mal de refactorings et fonctionnalités sans vraiment les finir... à vous de prendre le relais pour achever la fonctionnalité, assisté par les messages d'erreur.\r\n \r\nPari un peu fou ou confiance absolue dans les capacités de mentoring du compilateur ? Venez et vous le saurez !",
        "end": "2022-05-25T16:40:44",
        "event": "2022",
        "format": "WORKSHOP",
        "id": "623ad67c8a5c755e7139c6ee",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM5",
        "slug": "compiler-driven-development-avec-elm",
        "speakerIds": [
            "jordane.grenat",
            "sebastien-fabrice-besnier"
        ],
        "start": "2022-05-25T14:50:44",
        "summary": "Un langage frontend sans aucune erreur d’exécution, c’est possible ? C’est le pari réussi de Elm ! Et bonne nouvelle, son compilateur est un mentor très pédagogique pour apprendre ce langage. Venez le découvrir lors de cet atelier !",
        "title": "Compiler-Driven Development avec Elm",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2022-05-25T15:50:00",
        "description": "Déroulé de l'intervention (20 minutes de présentation et le reste d'échanges) :\r\n- Le problème\r\n- Notre histoire et pourquoi nous sommes bien placés pour répondre à cette question\r\n- Étape 1 - Comprendre l'équation économique de la vie\r\n- Étape 2 - Réinterroger ses besoins\r\n- Étape 3 - Calculez votre RIB\r\n- Est-ce bien réaliste ?\r\n- Conclusion\r\n- Débat !\r\n",
        "end": "2022-05-25T16:40:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6e5",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHID",
        "slug": "3-etapes-pour-arreter-de-subir-la-societe-de-consommation",
        "speakerIds": [
            "haonfaure",
            "jeff.rochas-parrot"
        ],
        "start": "2022-05-25T15:50:00",
        "summary": "Vous avez l'impression d'être dans un cercle vicieux : travailler plus, pour gagner plus, pour consommer plus ? Nous vous proposons 3 étapes pratiques pour (re)prendre le contrôle sur votre vie et ne plus perdre votre vie à la gagner… vous serez heureux·se !",
        "title": "3 étapes pour arrêter de subir la société de consommation",
        "topic": "lifestyle",
        "video": "https://vimeo.com/728605840"
    },
    {
        "addedAt": "2022-05-25T15:50:00",
        "description": "Sous le titre anglais de \"Dark Patterns\", le design manipulatif est un corpus de pratiques et d'attitudes stratégiques qui jouent généralement sur deux leviers principaux: le routage de l'information par le \"système 1\" (rapide, instinctif et émotionnel) du cerveau, selon l'expression du psychologue et économiste Daniel Kahneman, et l'utilisation a des fins délibérément trompeuses d'appuis sur nombre de biais cognitifs généralement présents chez un utilisateur lambda. \r\nSi le design persuasif va se préoccuper de faire accomplir une tâche précise (bien voir le bouton et le cliquer), le design manipulatif, lui, va se focaliser à créer un vrai geste - appuyer sur le bouton \"acheter\" par exemple -, qui va générer en réalité ou en complément un effet souhaité par le business, mais rarement par l'utilisateur - par exemple, l'autorisation de transmettre les information personnelles de l'utilisateur à d'autres sociétés-. \r\nJe voudrais mettre en pleine lumière pour vous un certain nombre de patterns du design manipulatif, et vous inviter à réfléchir comment et quand faire entrer l'éthique dans les discussions de features, de produit, et de modèle économique d'un produit ou service.\r\nParce que chaque membre d'une équipe contribue un peu au profil éthique du produit ou service, dans cette session vous allez comprendre comme il est facile de manipuler, et d'être manipulé, et vous pourrez choisir en pleine conscience. \r\nCette session s'adresse à tous,  et offrira une perspective éthique vaste et ouverte à l'interrogation personnelle.",
        "end": "2022-05-25T16:40:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6fc",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "le-design-manipulatif-oui-mais-non",
        "speakerIds": [
            "sophie.freiermuth"
        ],
        "start": "2022-05-25T15:50:00",
        "summary": "Je crois confirmer un bénéfice gratuit, me voilà abonnée à un service payant. Entre camoufler un bouton pour faire croire à autre chose, et mettre un titre un peu trompeur, manipuler un utilisateur par le design est relativement facile, et... oui, mais non. On va voir ça ensemble, via l'éthique.",
        "title": "Le design manipulatif: oui, mais non",
        "topic": "ethics",
        "video": "https://vimeo.com/733370061"
    },
    {
        "addedAt": "2022-03-23T09:12:44.751",
        "description": "Un de nos clients nous a fait part de son besoin de refondre un de ses sites grand public réalisé avec Drupal. \r\n\r\nSes contraintes : plusieurs milliers de visites par jour, un futur site attractif et dynamique et un faible impact sur l'environnement.\r\nL'occasion rêvée de mettre en place un site statique avec une architecture JAMStack ! \r\n\r\nCette stack saura t-elle générer les 70000 pages nécessaires au site ? Tiendra t-elle ses promesses de montée en charge ? Et du côté de l'impact écologique et de l'éco-conception ?\r\n\r\nNous vous présenterons le principe de l'architecture JAMStack, les difficultés que nous avons rencontrées, et les adaptations que nous avons mises en œuvre pour aboutir à la nouvelle version du site.\r\n\r\nAlors, promesses tenues ?",
        "end": "2022-05-25T16:40:00",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c716",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM1",
        "slug": "un-peu-de-confiture-dans-votre-architecture-",
        "speakerIds": [
            "ceciliaBossard"
        ],
        "start": "2022-05-25T15:50:00",
        "summary": "Réaliser un site le plus éco-conçu possible, attractif visuellement et avec des technos récentes ? L'occasion rêvée de mettre en place un site statique avec une architecture JAMStack !\r\nCette stack saura t-elle générer les 70000 pages nécessaires et tiendra t-elle ses promesses de montée en charge ?",
        "title": "Un peu de confiture dans votre architecture ? ",
        "topic": "tech",
        "video": "https://vimeo.com/733369871"
    },
    {
        "addedAt": "2022-03-23T09:12:44.683",
        "description": "Connue et reconnues par une grande majorité des développeurs, Firebase propose depuis plusieurs années déjà, de nombreux services permettant de mettre en place facilement toute une partie back-end pour des applications. Avec une telle réussite, ce n'est pas étonnant que l’on ai pu voir ces derniers temps plusieurs technologies émerger avec pour ambition de devenir de véritables alternatives. \r\n\r\nAprès plusieurs projets réalisés à l’aide Firebase en duo, nous avons décidé de pousser un peu plus loin l’expérience en essayant cette fois une toute nouvelle solution. Laissez nous vous présentez Appwrite, un ensemble de services qui cherche justement à nous faire oublier la solution de Google. N’étant pas forcément d’accord l’un avec l’autre à l’issue de nos essais, nous vous proposons de venir assister à un duel sans merci pour savoir si oui ou non, Appwrite est prêt à éteindre Firebase.\r\n\r\nAprès les avoirs comparés aux niveaux de leur facilité d’installation, des nombreuses fonctionnalités qu’ils nous proposent ou encore du prix que cela représente, il se peut même que l’on ait besoin de vos avis pour les départager une bonne fois pour toutes !\r\n\r\nCe talk a pour but de présenter de manière simple les deux outils ainsi que leurs fonctionnalités phares. Que vous soyez développeur ou non, expert ou novice, ou juste un peu curieux, nous vous attendons sur le ring 🥊",
        "end": "2022-05-25T16:40:44",
        "event": "2022",
        "format": "TALK",
        "id": "623ad67c8a5c755e7139c6e7",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM2",
        "slug": "appwrite-est-il-pret-a-eteindre-firebase-",
        "speakerIds": [
            "alves.mckl",
            "slocalyy"
        ],
        "start": "2022-05-25T15:50:44",
        "summary": "Est-ce que Firebase vous dit quelque chose ? Vous en avez sûrement entendu parlé et vous l'avez peut-être même déjà utilisé ! Mais avez-vous déjà entendu parler d'Appwrite ❓ Venez découvrir avec nous le duel entre Appwrite la jeune solution open-source et Firebase la flamme de Google 🥊",
        "title": "Appwrite est-il prêt à éteindre Firebase ? 🔥",
        "topic": "tech",
        "video": "https://vimeo.com/725688099"
    },
    {
        "addedAt": "2022-03-23T09:12:44.7",
        "description": "Pour tout projet informatique, avant la première ligne de code, avant même le choix des langages ou frameworks utilisés, il faut des développeur·ses. Bien que l'explosion des besoins dans le secteur ne date pas d'hier, il y a toujours un gap considérable entre le nombre de développeur·ses disponibles sur le marché et le nombre de postes à pourvoir.\r\nNous sommes face à un métier dit pénurique qui chamboule complètement les modes de recrutement traditionnels. Ce n'est plus le candidat qui cherche un employeur mais l'employeur qui cherche des candidats. Pour cela, les entreprises travaillent leur marque employeur. C'est-à-dire qu'elles se montrent sous leur plus beau jour pour attirer les candidats qu'elles recherchent. Mais leur atout numéro 1 pour trouver de futurs employés, ce sont les recruteurs.\r\nIl existe deux types de recruteurs : les internes qui recrutent uniquement pour leur société et les externes qui recrutent pour différentes sociétés.\r\nEn ce qui me concerne, je me suis positionné comme recruteur externe pour accompagner des sociétés dans leur recherche de développeur iOS.\r\nJ'étais développeur iOS pendant plus de 10 ans et je suis très actif dans la communauté des développeur·ses iOS depuis 2016 à travers l'organisation de meetups et de conférences ou via les réseaux sociaux. Fort de cette connaissance du métier et de sa communauté, je me suis lancé début 2019 dans l'aventure malgré l'assez mauvaise image que j'avais du métier de recruteur.\r\nJ'y ai découvert pas mal de choses, des bonnes comme des moins bonnes. Étonnamment, j'ai également aussi beaucoup appris sur le métier de développeur, a posteriori. On ne se rend pas compte de certains aspect de notre métier tant qu'on n'a pas pris un certain recul ou côtoyé de plus près d'autres communautés de métiers.\r\nVenez assister à ce talk si vous voulez mieux comprendre ce métier à la réputation sulfureuse mais qui, quand il est bien compris, peut être un atout incroyable dans la carrière de tout développeur !",
        "end": "2022-05-25T17:20:00",
        "event": "2022",
        "format": "LIGHTNING_TALK",
        "id": "623ad67c8a5c755e7139c6f0",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM1",
        "slug": "de-developpeur-a-recruteur-la-reconversion-improbable",
        "speakerIds": [
            "greg3z"
        ],
        "start": "2022-05-25T17:00:00",
        "summary": "Après avoir été développeur pendant plus de 10 ans, j'ai eu la drôle d'idée de devenir recruteur de développeur·ses en 2019.\r\nPourquoi ?\r\nComment ?\r\nEt surtout, qu'est-ce qu'on apprend quand on passe de l'autre côté du miroir ?\r\nDécryptage du métier que les développeur·ses aiment tant détester.",
        "title": "De développeur à recruteur, la reconversion improbable",
        "topic": "aliens",
        "video": "https://vimeo.com/726178257"
    },
    {
        "addedAt": "2022-03-23T09:12:44.726",
        "description": "* Voici déjà 40 ans que Gerald Weinberg à travers son livre \"The Psychology of Computer Programming\" établissait une liste de conseils permettant d’augmenter la qualité du code en essayant de fournir des solutions pour mettre nos egos de coté. \r\n* Je vous invite donc à les découvrir ou les redécouvrir et plus particulièrement de les avoir en tête dans nos comportements quotidiens. ",
        "end": "2022-05-25T17:20:00",
        "event": "2022",
        "format": "LIGHTNING_TALK",
        "id": "623ad67c8a5c755e7139c701",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "les-10-commandements-de-la-programmation-sans-ego",
        "speakerIds": [
            "othelu"
        ],
        "start": "2022-05-25T17:00:00",
        "summary": "Peu importe votre architecture, peu importe vos choix de langage, le succès de vos équipes dépend des relations établies entre les individus.\r\nJe vous propose de parler de l’élément qui rend et rendra tous les projets compliqués : l’humain.",
        "title": "Les 10 commandements de la programmation sans ego",
        "topic": "team",
        "video": "https://vimeo.com/728605321"
    },
    {
        "addedAt": "2022-03-23T09:12:44.732",
        "description": "Dans ce talk, vous découvrirez un peu de théorie de l'apprentissage, du triangle pédagogique de Houssaye... Mais surtout vous apprendrez à reconnaître les situations d'enseignement dans lesquelles vous vous trouvez.\r\n\r\nJe présenterai quelques leçons apprises dans ma carrière en tant que consultant, mentor, et aussi enseignant en informatique - et comment les différentes techniques se transposent d'un domaine à l'autre.",
        "end": "2022-05-25T17:20:00",
        "event": "2022",
        "format": "LIGHTNING_TALK",
        "id": "623ad67c8a5c755e7139c706",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHID",
        "slug": "mentor-consultant-prof-memes-combats-memes-techniques-",
        "speakerIds": [
            "Kehrlann"
        ],
        "start": "2022-05-25T17:00:00",
        "summary": "Avec un peu d'expérience, les devs sont amené·e·s à accompagner et former des débutant·e·s. Si nous avons tou·te·s été élèves, ça ne fait pas pour autant de nous de bon·ne·s profs! \r\n\r\nVenez découvrir un peu de théorie de l'enseignement, et des techniques pratiques à appliquer avec vos mentoré·e·s.",
        "title": "Mentor, consultant, prof... mêmes combats, mêmes techniques!",
        "topic": "learn",
        "video": "https://vimeo.com/728604548"
    },
    {
        "addedAt": "2022-04-21T12:36:12.038",
        "description": "Développeurs, nous passons plus de 50% de notre temps sur la conception et la revue de code. L’autre partie se passe sur l’interface en ligne de commande de l’IDE ou le terminal de l’OS: pour lancer l’application, débugger, lire les logs, mettre à jour les dépendances, analyser les trames réseau… Est-il possible de gagner du temps ? Avez-vous pris le temps de configurer votre terminal ? C’est ce que nous allons voir. Je vais partager un ensemble de bonnes pratiques et d’alias pour votre ligne de commande favorite.\r\n\r\nA vos marques, prêt ? Kaizen ! kaizen = amélioration continue",
        "end": "2022-05-25T17:20:00",
        "event": "2022",
        "format": "LIGHTNING_TALK",
        "id": "626150526b650e399194a1c6",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM2",
        "slug": "reprenez-le-controle-de-votre-bash-en-devant-un-ninja-de-la-cli-",
        "speakerIds": [
            "david.aparicio"
        ],
        "start": "2022-05-25T17:00:00",
        "summary": "Développeurs, nous passons plus de 50% de notre temps sur la conception et la revue de code. L’autre partie se passe sur la ligne de commande de l’IDE ou de l’OS: pour lancer l’app, débugger les logs, mettre à jour les dépendances, analyse réseau… Avez-vous pris le temps de le configurer ?",
        "title": "Reprenez le contrôle de votre bash en devant un ninja de la CLI ! 😎 ",
        "topic": "tech",
        "video": "https://vimeo.com/730352366"
    },
    {
        "addedAt": "2022-03-23T09:12:44.713",
        "description": "Ingénieure informaticienne, j’ai quitté mon bled en 2010 pour immigrer chez les Gaulois. Je partage avec vous de « l’enfer »  vécu à la préfecture de Bobigny dans le 9-3, pour renouveler le titre de séjour.\r\nComment j’ai monté le GDGRennes-Android? Est-ce que mon premier prénom, à connotation africaine, a été un frein pour ma recherche d’emploi?  Est-ce que j’ai réussi à me faire une petite place dans l’écosystème informatique, associatif, collaboratif en France? Que suis-je devenue aujourd’hui?  Venez me poser toutes les questions, sans tabou. Je vous ferais un bilan de 12 ans de vie, d’une ingénieure informaticienne immigrée, vivant chez les Gaulois...InchAllah. ",
        "end": "2022-05-25T17:50:00",
        "event": "2022",
        "format": "LIGHTNING_TALK",
        "id": "623ad67c8a5c755e7139c6fa",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "journal-d-une-immigree-fondatrice-du-gdgrennes-android",
        "speakerIds": [
            "AnnetLenaNdiaye"
        ],
        "start": "2022-05-25T17:30:00",
        "summary": "En 2010, j’ai immigré chez les Gaulois. Je partagerai avec vous de l’enfer à la préfecture de Bobigny dans le 9-3, pour renouveler le titre de séjour. Est-ce que mon premier prénom, a été un frein pour ma recherche d’emploi? Je vous ferais un bilan de 12 ans de vie, d’une immigrée chez les Gaulois.",
        "title": "Journal d'une immigrée, Fondatrice du GDGRennes-Android",
        "topic": "aliens",
        "video": "https://vimeo.com/728605346"
    },
    {
        "addedAt": "2022-03-23T09:12:44.728",
        "description": "Chez **Innovorder**, nous sommes spécialisés dans les solutions Android pour les restaurants et nous n'utilisons pas les Play Services. Nous avons donc déployé un micro-service en **Ktor** dédié à la mise à jour de nos applications mobiles pour avoir un contrôle total sur les déploiements de nos mises à jour.\r\n\r\nNous croyons fermement en **Ktor** et avons massivement investi dans **Kotlin** au sein de l'entreprise.\r\n\r\nJ'ai écrit une série de 3 articles, dont deux ont été publiés par **Kotlin Weekly**, la plus grande newsletter **Kotlin**.\r\n\r\n- **[Déployer un microservice dans Kotlin avec Ktor — Partie 1](https://innovorder.dev/deploy-a-microservice-in-kotlin-with-ktor-part-1-2691fef75e1d)**\r\n- **[Déployer un microservice dans Kotlin avec Ktor — Partie 2](https://innovorder.dev/deploy-a-microservice-in-kotlin-with-ktor-part-2-8c431b56dc51)**\r\n- **[Déployer un microservice dans Kotlin avec Ktor — Partie 3](https://innovorder.dev/deploy-a-microservice-in-kotlin-with-ktor-part-3-e99312f0e7f8)**",
        "end": "2022-05-25T17:50:00",
        "event": "2022",
        "format": "LIGHTNING_TALK",
        "id": "623ad67c8a5c755e7139c703",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHID",
        "slug": "live-coding-d-un-serveur-web-avec-ktor",
        "speakerIds": [
            "renaud_mathieu"
        ],
        "start": "2022-05-25T17:30:00",
        "summary": "Ktor est un framework Kotlin dédié à la création de serveurs et de clients asynchrones dans des systèmes connectés. Dans cette session, nous découvrirons les concepts de base de Ktor 2 en codant en live un serveur HTTP à partir de zéro à l'aide de Ktor Server !",
        "title": "Live-coding d'un serveur web avec Ktor",
        "topic": "tech",
        "video": "https://vimeo.com/728604532"
    },
    {
        "addedAt": "2022-03-23T09:12:44.735",
        "description": "Ça y est, vous venez de terminer l'implémentation de votre dernière user story. Une semaine de travail, des dizaines de fichiers modifiés, des commits en pagaille, mais ça tourne et les tests sont au vert, alors place à la revue de code !\r\n\r\nDes revues de ce style, vous en avez sûrement déjà relu. Vous essayez tant bien que mal d'y trouver du sens, avant de vous rabattre sur le strict minimum (les noms de fonction, ils sont bien en _camelcase_ ?).\r\n\r\nQuel dommage, car la revue de code, lorsqu'elle est préparée avec soin, peut être un atout majeur de votre cycle de développement !\r\n\r\nJe vous propose, au travers d'un exemple simple, d'utiliser le **rebase interactif** pour nettoyer, réorganiser et clarifier votre historique de commits. 3 étapes, 10 minutes chrono pour passer vos revues de code au niveau supérieur et exploiter leur plein potentiel !",
        "end": "2022-05-25T17:50:00",
        "event": "2022",
        "format": "LIGHTNING_TALK",
        "id": "623ad67c8a5c755e7139c709",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM2",
        "slug": "optimisez-vos-revues-de-code-avec-le-rebase-interactif-",
        "speakerIds": [
            "sonia.seddiki"
        ],
        "start": "2022-05-25T17:30:00",
        "summary": "La revue de code est une étape cruciale qui reste souvent négligée. Pourtant, préparée avec soin, elle peut avoir un impact bien au delà de l'amélioration de la qualité ! Découvrons comment le rebase interactif peut vous aider à mieux présenter votre code, sans y passer la journée.",
        "title": "Optimisez vos revues de code avec le rebase interactif !",
        "topic": "tech",
        "video": "https://vimeo.com/726178882"
    },
    {
        "addedAt": "2022-03-23T09:12:44.743",
        "description": "Voici l’histoire de mon site [maposaic.com](maposaic.com). Un fond de carte dans un Canvas. Un algorithme qui parcourt tous ses pixels. Une mosaïque en couleurs. C’est beau ! Mais il faut attendre longtemps... Venez voir comment Rust m’a permis de booster les performances de ces calculs de pixels !",
        "end": "2022-05-25T17:50:00",
        "event": "2022",
        "format": "LIGHTNING_TALK",
        "id": "623ad67c8a5c755e7139c70f",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "ROOM1",
        "slug": "rust-a-la-rescousse-des-performances-de-javascript",
        "speakerIds": [
            "viconnex"
        ],
        "start": "2022-05-25T17:30:00",
        "summary": "Un fond de carte dans un Canvas. Un algorithme qui parcourt tous ses pixels. Une mosaïque en couleurs. C’est beau ! Mais il faut attendre longtemps... Venez voir comment Rust m’a permis de booster les performances de ces calculs de pixels !",
        "title": "Rust à la rescousse des performances de javascript",
        "topic": "tech",
        "video": "https://vimeo.com/728604543"
    },
    {
        "addedAt": "2022-04-01T11:22:00",
        "description": "",
        "end": "2022-05-25T18:20:00",
        "event": "2022",
        "format": "KEYNOTE",
        "id": "6246e1e0e0fb2108c68a5f8e",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "AMPHIC",
        "slug": "comment-et-pourquoi-le-groupe-ldlc-en-est-arrive-a-mettre-en-place-la-semaine-de-4-jours",
        "speakerIds": [
            "laurentldlc"
        ],
        "start": "2022-05-25T17:50:00",
        "summary": "Nous allons voir comment est arrivée cette idée un peu folle de passer nos 1000 collaborateurs à 4 jours de travail et 32H payés 35 début 2021, comment cela a été mis en place, et faire un bilan un peu plus d’un an plus tard, de ce que cela a apporté aux équipes, et au groupe.",
        "title": "Comment et pourquoi le groupe LDLC en est arrivé à mettre en place la semaine de 4 jours",
        "topic": "aliens",
        "video": null
    }
]
