[
    {
        "addedAt": "2021-04-05T08:29:36.299",
        "description": null,
        "end": "2021-05-18T18:00:00",
        "event": "2021",
        "format": "TALK",
        "id": "606acb9e097e11375ddbac73",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "tbd",
        "speakerIds": [
            "carole.adam"
        ],
        "start": "2021-05-18T17:00:00",
        "summary": "Nous sommes nombreux à travers le monde à nous interroger sur la pandémie de COVID-19 et sur les mesures individuelles et collectives mises en oeuvre afin de limiter la propagation du virus. Le site web interactif CovPrehension a été créé par une équipe de chercheurs de différentes disciplines, tous spécialistes de la modélisation des systèmes complexes et désireux de mobiliser leurs compétences pour répondre à ces interrogations légitimes. Notre projet est de répondre, par la modélisation et la simulation, à des questions sur l’épidémie de COVID-19.\r\n\r\nDans ce séminaire je présenterai l'approche de simulation multi-agent et ses avantages pour la gestion de diverses crises. J'insisterai sur les différentes utilisations possibles de la simulation lors de telles crises, depuis la prédiction de leur évolution, au test de stratégies de réponses, en passant par l'entraînement des équipes de secours. Un autre but est la pédagogie, un simulateur interactif permettant d'explorer des scénarios pour comprendre les mécanismes sous-jacents. Je me focaliserai ainsi plus particulièrement sur quelques questions posées par l'épidémie de COVID-19 et la réponse que l'équipe de CovPrehension a pu y apporter grâce à des simulateurs interactifs.\r\n",
        "title": "TBD",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2021-04-05T08:21:23.787",
        "description": null,
        "end": "2021-05-18T19:00:00",
        "event": "2021",
        "format": "TALK",
        "id": "606ac8fd097e11375ddbac71",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "tbd",
        "speakerIds": [
            "augerment"
        ],
        "start": "2021-05-18T18:00:00",
        "summary": "TBD",
        "title": "TBD",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2021-04-05T08:23:36.818",
        "description": null,
        "end": "2021-05-18T20:00:00",
        "event": "2021",
        "format": "TALK",
        "id": "606aca64097e11375ddbac72",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "metaux-rares-l-envers-des-technologies-numeriques",
        "speakerIds": [
            "guillaume.pitron"
        ],
        "start": "2021-05-18T19:00:00",
        "summary": "Cette conférence expliquera comment les outils numériques dépendent fortement de ressources métalliques, et en particulier de métaux rares. Extraits notamment en Chine dans des conditions peu respectueuses de l'environnement, ces ressources sont également l'objet d'un affrontement commercial entre Pékin et les pays qui dépendent des approvisionnements chinois. ",
        "title": "Métaux rares: l'envers des technologies numériques",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2021-04-05T08:35:43.211",
        "description": null,
        "end": "2021-05-19T18:00:00",
        "event": "2021",
        "format": "TALK",
        "id": "606acc30097e11375ddbac74",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "tou-tes-travailleur-ses-des-plateformes-le-travail-a-l-heure-du-covid-19",
        "speakerIds": [
            "antonio.casilli"
        ],
        "start": "2021-05-19T17:00:00",
        "summary": "Face à la crise provoquée par la pandémie de Covid-19, plusieurs contextes d’interaction humaine sont en train de subir des transformations majeures. Un nombre croissant d’individus fait désormais l’expérience du travail à distance, et doit composer entre sociabilités amicales, familiales et professionnelles. Dans plusieurs secteurs d’activité, on assiste à l’introduction massive de systèmes de surveillance et de modalités de rémunération qui étaient jusque-là limitées au travail sur les plateformes numériques. Ces dernières s’imposent, autant pour les personnes employées que pour celles faisant face au chômage, comme des paradigmes productifs qui conjuguent « travail à la demande » (livraison, logistique, etc.), « travail en ligne » (freelancing, gig economy et microtravail) et « travail social en réseau » (génération et modération de contenus). Le monde du travail qui s’annonce généralise des méthodes de gestion de l’humain qui transfèrent de manière exponentielle sur les travailleuses et travailleurs les risques, autant sur le plan sanitaire qu’économique.",
        "title": "Tou•tes travailleur•ses des plateformes ? Le travail à l’heure du Covid-19",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2021-04-05T10:00:00",
        "description": null,
        "end": "2021-05-19T19:00:00",
        "event": "2021",
        "format": "TALK",
        "id": "606accb0097e11375ddbac75",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "le-manque-de-femmes-dans-la-tech-n-est-pas-une-fatalite",
        "speakerIds": [
            "isabelle.collet"
        ],
        "start": "2021-05-19T18:00:00",
        "summary": "L’informatique joue un rôle croissant dans l’évolution de nos sociétés, mais les femmes sont largement sous-représentées dans ces métiers depuis plusieurs décennies. Pourtant, dans les années 80, l’informatique était un métier plutôt féminisé́, du moins, pour un métier technique. Si les femmes occupent 30% des emplois dans la Tech, elles sont essentiellement dans les métiers de support. En école d’ingénieur comme dans les filières courtes de l’enseignement supérieur, elles sont à peine 10%.\r\nEst-ce les femmes qui s’autocensurent ? Ou les institutions, école et entreprises qui peinent à être inclusives ? Je vous propose de tourner le dos au gender washing et de mettre en avant les pratiques qui permettent à toutes et tous de vaincre la censure sociale.\r\n",
        "title": "Le manque de femmes dans la tech n’est pas une fatalité",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2021-04-05T08:17:39.057",
        "description": null,
        "end": "2021-05-19T20:00:00",
        "event": "2021",
        "format": "TALK",
        "id": "606ac83f097e11375ddbac70",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "creating-baba-is-you",
        "speakerIds": [
            "arviteikari"
        ],
        "start": "2021-05-19T19:00:00",
        "summary": "The award-winning puzzle game took almost exactly 2 years to be finished after being first conceived at a game jam. In this talk the developer describes the development process and highlights elements that helped and hindered with bringing the game to completion",
        "title": "Creating Baba Is You",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2021-04-05T08:41:36.431",
        "description": null,
        "end": "2021-05-20T19:00:00",
        "event": "2021",
        "format": "TALK",
        "id": "606acd9a097e11375ddbac77",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "tbd",
        "speakerIds": [
            "gaelduval"
        ],
        "start": "2021-05-20T18:00:00",
        "summary": "TBD",
        "title": "TBD",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2021-04-05T08:47:06.547",
        "description": null,
        "end": "2021-05-20T20:00:00",
        "event": "2021",
        "format": "TALK",
        "id": "606acf9a097e11375ddbac78",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "i-have-a-pwn-in-my-hand",
        "speakerIds": [
            "esther"
        ],
        "start": "2021-05-20T19:00:00",
        "summary": "Son smartphone dans la main, Camille attend son colis qui n'arrivera jamais. Musique, emails, gestionnaire de mots de passe, chat, réseaux sociaux, jeux, tout y est, dans la paume de notre main. Cet objet quotidien semblant si souvent anodin se révèle être une formidable opportunité pour les acteurs malveillants de \"faire les poches\" des personnes et des entreprises.\r\n\r\nLors de cette conférence nous ferons un rapide tour d'horizon des menaces actuelles sur mobiles. Phishing, smishing, malware, squatting, blanchiment de données et autres scams en tout genre sont les menaces auxquelles nous faisons face aujourd'hui. Comment des applications et plateformes inoffensives telles que Fedex, Spotify, LastPass, Clubhouse ou Grindr peuvent faciliter ces menaces. Enfin, nous discuterons des impacts sur les utilisateurs et les entreprises.\r\n \r\n\r\n***\r\nSmartphone in hand, Camille is waiting for a package that will never arrive. Music, emails, password manager, chat apps, social networks, games, everything is there, in the palm of our hand. This everyday object that seems harmless at times is actually a great opportunity for malicious actors to \"pick the pockets\" of people and companies.\r\nDuring this conference we will go over the current threats on mobile devices and how we can address them. From Phishing, smishing, malware, squatting to data laundering and other scams. How innocuous apps and platforms such as Fedex, Spotify, LastPass, Clubhouse or Grindr can facilitate these threats. We will also discuss the impacts on both the users and the companies.\r\n",
        "title": "I have a pwn in my hand",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2021-04-05T08:40:17.627",
        "description": null,
        "end": "2021-05-20T21:00:00",
        "event": "2021",
        "format": "TALK",
        "id": "606acd37097e11375ddbac76",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "education-for-all",
        "speakerIds": [
            "pamelafox"
        ],
        "start": "2021-05-20T20:00:00",
        "summary": "How can we make educational materials available to everyone who has an Internet-connected computer? We'll explore the benefits of computers (like personalization) and the challenges in true global accessibility (such as internationalization and accessibility), using real examples from Khan Academy, Coursera, and other online educational offerings.",
        "title": "Education for All",
        "topic": "aliens",
        "video": null
    }
]
