[
    {
        "addedAt": "2019-03-04T22:33:57.62",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da824a6d40108c981f902",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "comment-perdre-sa-surchage-featurale-",
        "speakerIds": [
            "estelle.landry"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Le cycle de vie d'une application est un chemin nébuleux et plein de dangers. La complexité ne fait que croitre durant les mois et les années d'utilisation. L'un des plus gros challenges d'un développeur est de pouvoir la contrôler tout en ajoutant de nouvelles fonctionnalités (features).\r\n\r\nDes solutions existent : le ré-écriture de code ou encore la maitrise de la dette technique. En effet, ces deux actions permettent de lever \"la complexité accidentelle\". Mais que faisons nous de la \"complexité essentielle\" ? La complexité qui n'est pas liée au code.\r\n\r\nLa seule solution : Supprimer des fonctionnalités ! Ce talk vous expliquera comment perdre la surcharge featurale de vos applications en comprenant la différence entre la complexité essentielle et la complexité accidentelle, mais aussi en vous donnant des clés pour mener à bien ce changement dans vos équipes projet.",
        "title": "Comment perdre sa surchage featurale ?",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.629",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da824a6d40108c981f903",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "make-data-science-great-again-pourquoi-et-comment-crafter-la-data-science-sur-mesure-",
        "speakerIds": [
            "anastasia.lieva"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Il n'est pas évident d'intégrer de la Data Science dans les sociétés qui développent un business qui de base ne prévoyait pas de l’intelligence artificielle (IA), et pour lequel l’IA n'est pas au cœur du métier. Malgré la motivation d'utiliser l’IA, de nombreux projets Data Science dans ces sociétés échouent.\r\n\r\nC'est autant frustrant pour les responsables d'entreprises que démotivant pour les data-scientists, dont les projets finissent au placard. On va analyser ensemble cette situation, pour déterminer les raisons de ces échecs. On va également étudier comment éviter les erreurs les plus courantes, et comment mener ce changement sans encombre afin d'enrichir vos produits avec l’IA.\r\n\r\nL’objectif du talk est que peu importe le profil que vous avez - dev front, dev back, data-scientist, CTO, CEO, Product Manager - vous retournerez lundi dans votre société en sachant à la fois identifier et mener à bien les opportunités de Data Science.",
        "title": "Make Data-Science Great Again. Pourquoi et comment crafter la Data-Science sur mesure.",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.629",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da824a6d40108c981f904",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "comment-se-faire-hacker-bien-comme-il-faut-",
        "speakerIds": [
            "julien.topcu"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Et encore une fuite de numéros de cartes de crédit sur internet! https://www.infoq.com/news/2018/11/british-airways-data-breach\r\n\r\nC'est révoltant n'est-ce pas ? Mais attends, qu'est-ce qu'on fait nous pour s'assurer que notre appli n'est pas une passoire? \r\n\r\nDans cette live-coding-hacking session, venez découvrir les erreurs les plus communes en sécurité, que la grande majorité d'entre nous font sans même le savoir!\r\n\r\nAprès cela, vous ne verrez plus votre application de la même manière...\r\n",
        "title": "Comment se faire hacker bien comme il faut!",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.629",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "RANDOM",
        "id": "5c7da824a6d40108c981f905",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "le-bullshit-notre-indifference-a-l-egard-de-la-verite",
        "speakerIds": [
            "maryange.dichi"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Ce talk est de type \"random\". Pour cette track, nous choisissons le programme pour vous. Vous êtes dans une pièce et un speaker vient parler d'un sujet dont vous ignorez le contenu. N'ayez pas peur, c'est seulement pour 20 minutes. Comme c'est une surprise, nous n'affichons pas le résumé de la session avant ...",
        "title": "Le Bullshit, notre indifférence à l'égard de la vérité",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.63",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da824a6d40108c981f906",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "le-circular-design-designer-pour-une-innovation-soutenable",
        "speakerIds": [
            "jackfack.fb"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Le circular design est l'avenir de l'innovation et c'est IDEO qui le dit et qui porte le projet. Pour ses créateurs, c'est l'enfant naturel du design-thinking et de l'économie circulaire, cette économie basée sur la réutilisation et le recyclage. Le design subit ce qu'ont subi les industries : le temps est révolu où le concepteur de produit créait \"from scratch\" et sans se soucier des impacts, il faut tenir compte de l'existant, des empreintes environnementales, des déchets qu'on produit, de ce qu'on peut recycler. Dans cette vision, le concept même de produit évolue : celui-ci s'inscrit dans un écosystème complexe et dans une chaîne d'utilisation sur le modèle des chaînes alimentaires. Aucun produit ne meurt, tout se transforme.\r\nC'est donc un design respectueux de son environnement, en phase avec les grands sujets de société, désireux de limiter le gâchis. Cette présentation est l'occasion d'en comprendre les principes sous-jacents, les étapes et de sortir avec de premières idées d'expérimentations. C'est une des toutes premières conférences francophones sur le sujet.\r\n",
        "title": "Le circular design : designer pour une innovation soutenable",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.63",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "RANDOM",
        "id": "5c7da824a6d40108c981f907",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "peut-on-tromper-1000-fois-une-personne-",
        "speakerIds": [
            "fabrice.desmazery"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Ce talk est de type \"random\". Pour cette track, nous choisissons le programme pour vous. Vous êtes dans une pièce et un speaker vient parler d'un sujet dont vous ignorez le contenu. N'ayez pas peur, c'est seulement pour 20 minutes. Comme c'est une surprise, nous n'affichons pas le résumé de la session avant ...",
        "title": "Peut-on tromper 1000 fois une personne ?",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.63",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "RANDOM",
        "id": "5c7da824a6d40108c981f908",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "innover-dans-les-tech4good-pourquoi-comment-",
        "speakerIds": [
            "pierre.paci",
            "nsanitas"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Ce talk est de type \"random\". Pour cette track, nous choisissons le programme pour vous. Vous êtes dans une pièce et un speaker vient parler d'un sujet dont vous ignorez le contenu. N'ayez pas peur, c'est seulement pour 20 minutes. Comme c'est une surprise, nous n'affichons pas le résumé de la session avant ...",
        "title": "Innover dans les Tech4Good ? Pourquoi ? Comment ?",
        "topic": "ethics",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.63",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da824a6d40108c981f909",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "sortir-de-son-code-de-confort",
        "speakerIds": [
            "115428158670419649279"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Nous avons tous nos petites habitudes de code, nos petits réflexes. Et on aime travailler dans cette  situation. Cependant, cela biaise notre jugement. Grâce à trois petits exercice d’une heure, je vous forcerai à explorer des solutions dont vous n’avez pas l’habitude.",
        "title": "Sortir de son code de confort",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.631",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da824a6d40108c981f90a",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "dette-technique",
        "speakerIds": [
            "1338530083"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Le terme \"dette technique\" est devenu fourre-tout dès qu'on veut décrire un bout de code qui mérite d'être repris. Cette mauvaise interprétation de la métaphore et confusion mène à des décisions désastreuses sur nos projets.\r\nQu'est-ce qui est dette technique ? Qu'est ce qui ne l'est pas ? Pourquoi devrions-nous nous en préoccuper ? Quel est le coût de la confusion ? Que faire ?\r\nCette présentation me permettra de discuter des origines de la métaphore, expliquer ce qu'est la dette technique, et comment l'identifier au sein d'un projet et la gérer.",
        "title": "Dette technique",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.631",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da824a6d40108c981f90b",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "introduction-au-t-ype-dd-avec-f-et-web-app-reactive-avec-fable-io",
        "speakerIds": [
            "florent.pellet",
            "clem"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "La programmation fonctionnelle est de plus en plus mise en avant, mais pourquoi? Qu’y a-t-il de différent avec la POO?\r\n\r\nNous vous proposons de partir d’un kata bien connu pour illustrer les différences (implémentations en C# existantes) et dédiaboliser la soi-disant complexité de la programmation fonctionnelle. Les différences de notation forment le principal obstacle, une fois passé, la programmation fonctionnelle n’est pas plus compliquée. Nous aborderons le langage F# pas à pas en illustrant notamment le système de type (dit de “types algébriques”) pour avoir un design piloté par les types (TypeDD).\r\n\r\nEn bonus, nous vous montrerons comment créer une web app réactive du kata en F# avec Fable.io (transpiler F# vers JavaScript) et Elmish (oui la référence au langage Elm est fait exprès).",
        "title": "Introduction au T(ype)DD avec F# et web app réactive avec Fable.io",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.631",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da824a6d40108c981f90c",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "il-n-y-a-pas-de-magie-tout-est-dans-les-details-",
        "speakerIds": [
            "tbuvignier"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Et s’il était possible, en prenant garde aux petits détails d’une app ou d’un site web, de concevoir une app qui ait une réelle identité ? Une app qui ne soit pas seulement utile mais également agréable à utiliser et appréciée des utilisateurs ?\r\n\r\nPlongée dans un nouveau monde à la croisée de l’UX et de l’UI, plongée dans le monde des Micro-interactions.\r\n\r\nDécouvrez comment, en travaillant les petits détails d’une app et les micro cas d’usage il est possible :\r\n– D’apporter du réel dans une app virtuelle\r\n– De récompenser physiquement l’utilisateur pour le guider dans son parcours\r\n– De créer un lien émotionnel avec l’utilisateur\r\n– De créer un app qui ait une vraie identité non seulement visuelle mais également interactive.",
        "title": "Il n'y a pas de magie, tout est dans les détails !",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.632",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da824a6d40108c981f90d",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "una-gitlab-le-tp-a-roulette-",
        "speakerIds": [
            "davin.kevin"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "A l’image de Perceval et Karadock, Logan et Kevin reviennent d’une quête dans la contrée de Gitlab et vont vous compter leurs aventures pleines de découvertes et de rebondissements. L’on espère que Père Blaise réussira à prendre des notes…\r\n\r\n![](https://gabich.files.wordpress.com/2010/09/perceval.png)\r\n\r\nLors de cette quête, il sera nécessaire de mettre en place une intégration continue pour une armée de développeurs sanguinaires qui ont plein de besoins bizarres… Et à la force de leur épée, de leur courage et pas du tout de l’aide de Merlin (qui ne sait toujours rien faire…), Logan et Kevin vous guidereront afin de créer une CI complète avec job, stage, intégration avec des outils externes (PostgreSQL, Artifactory, Google Cloud Platform, Docker in Docker, SAST, DAST…) tout en la gardant simple et versionnable 😍.\r\n\r\nL’on pourra même finir sur un exemple de mise en place de la CI dans le cloud (Google Cloud ou Clever) pour avoir une CI qui file dans les nuages 🚀.",
        "title": "Una-Gitlab, le TP à Roulette !",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.632",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da824a6d40108c981f90f",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "sitting-considered-deadly",
        "speakerIds": [
            "marek.stoj"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "I assume your well-being is quite important to you. Then, do you do anything to take care of your health? Maybe you go for a run regularly or visit a gym? Practice yoga? Play squash? The thing is, it does not matter as much as you might think it does. Even if you exercise in leisure time on a regular basis, you spend most of your workday on your buttocks and that, as it turns out, is very unhealthy.\r\n\r\nThere is now 3 decades worth of research linking sedentary lifestyle to myriad health problems. What is even worse, you can not completely mitigate the risks by just exercising because prolonged sitting still wreaks havoc in your body.\r\n\r\nSo is there anything we can do about it? The solution is actually quite simple and yet very difficult to implement due to a combination of factors like our cultural upbringing, psychosocial barriers as well as all the technological advancements of the last century that cater to our lazy human nature and render us immobile.\r\n\r\nIn this talk, I can only show you the first step to getting out of your chair. You are the one that has to take it. Nevertheless, I believe that by uniting the IT industry around an idea, that I will tell you about, we will be able to stand it up and fight for our health.",
        "title": "Sitting Considered Deadly",
        "topic": "lifestyle",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.632",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f910",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "voyage-au-pays-merveilleux-des-unikernels",
        "speakerIds": [
            "ltearno"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Venez découvrir ce que sont les unikernels, entités hybrides repoussant les limites entre OS et applications. Si vous vous demandez comment faire tourner une application en ring 0, cette présentation est faite pour vous ! En démo : unikernels bare metal, kvm et sur un provider cloud !\r\n\r\nLes architectures logicielles d’aujourd’hui reposent de plus en plus sur les OS généralistes, les conteneurs et les machines virtuelles. Avec tout ce que ces outils ont apporté, des problèmes perdurent : sécurité, temps de démarrage, poids des images (embarqué)…\r\n\r\nLes unikernels apportent de nouvelles réponses et une approche alternative du déploiement logiciel. Il ne s'agit plus de reposer sur un OS mais d'en extraire les briques utiles à votre application. Les outils dans ce domaine progressent dans leur maturité et leur niveau d’industrialisation. Ils déplacent les frontières entre OS et application, votre application tournant en ring 0 !\r\n\r\nDans cette présentation, nous aborderons :\r\n\r\n- ce qu’est un unikernel, les concepts associés et son fonctionnement,\r\n- leurs champs d’application et l’écosytème,\r\n- une démonstration avec une application distribuée (standard: un reverse proxy, un front et un back) sur unikernels dans le cloud GCP et en local (le tout connecté, grâce aux projets IncludeOS, RumpKernels et RuntimeJS),\r\n- Q/A.\r\n\r\nLes démos sont un unikernel sur du bare metal communiquant avec un unikernel tournant dans un kvm en local qui lui-même appelle un unikernel déployé sur GCP.",
        "title": "Voyage au pays merveilleux des Unikernels",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.633",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f911",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "applications-web-efficaces-avec-spring-boot-2",
        "speakerIds": [
            "brian.clozel",
            "snicoll"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Comment peut-on améliorer l'efficacité et la scalabilité d'une application web existante?\r\nOn pourrait complètement la réécrire, avec de la programmation  concurrente, fonctionnelle, ou réactive.\r\nMais est-ce que ça vaut vraiment le coup, sans mesurer et savoir où concentrer nos efforts?\r\n\r\nDans cette présentation, Stéphane et Brian vont travailler sur une application Spring Boot MVC existante\r\npour la rendre pour efficace. Ils vont remplacer `RestTemplate` par `WebClient`\r\net utiliser des opérateurs Reactor pour améliorer la scalabilité, sans tomber dans les pièges de la programmation concurrente.\r\nIls vont utiliser des métriques fournies par Spring Boot, en ajouter des personnalisées, et garder un oeil sur les gains\r\nde capacité dans des dashboards.",
        "title": "Applications web efficaces avec Spring Boot 2",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.633",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f912",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "mon-premier-service-en-rust",
        "speakerIds": [
            "francois.teychene"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Vous avez surement entendu parlé de Rust, ce langage qui est à la mode mais qui ne semble pas vous concerner.  \r\nParce que bon, un langage sans VM, ultra performant, c'est sympa, mais c'est difficile de voir comment l'utiliser pour des besoins \"standards\". Et à chaque fois on présente comment faire des outil en CLI ou comment la mémoire est efficacement gérée ...  \r\nBref on a l'impression que c'est un langage réservé aux ingénieurs systèmes et on le compare à du C.\r\n\r\nEt si je vous disais que l'on peut faire des webservices en Rust, de manière simple et élégante et que l'on garde tout les avantages classique du langage (performance, safety, ...) ? C'est ce que je vous propose de découvrir dans cette session.",
        "title": "Mon premier service en Rust",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.633",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f913",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "rex-apres-2-ans-de-pwa-en-production-chez-un-client",
        "speakerIds": [
            "mickael.faust"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Le but de ce talk est de partir d'un retour d’expérience sur la mise en place depuis 2 ans d'une PWA (Progressive Web App) dans le cadre d'une refonte complète du SI chez ENEDIS (pour les industriels et non linky).\r\nLe contexte projet a comme  particularité différentes contraintes comme la seule utilisation d'un navigateur et l'existence de situation où le réseau est en mode dégradé voire inexistant.\r\n\r\nDifférents axes seront ici expliqués :\r\n- Historique/explication du pourquoi d'une PWA dans ce contexte et notamment dans le cadre d'une application devant fonctionner en mode \"déconnecté\"\r\n- Possibilités/Evolution mais aussi les limitations et \"zones de flou\" autour de ces technologies  (service-worker, stockage navigateur, etc.)\r\n- Comment tester (utilisation du BDD et TDD via JGiven et Jest)\r\n- Comment les utilisateurs ont accueillis le passage d'une application bureautique lourde à une Web App \r\n\r\nBref, ici plutôt que de \"prêcher\" une technologie et/ou un framework, nous allons voir en quoi ce choix nous a aidé à répondre à un ensemble de contraintes, de besoins et d'usage. Mais surtout, quels en sont les avantages et les inconvénients. \r\n",
        "title": "REX après 2 ans de PWA en production chez un client",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.633",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f914",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "choisir-entre-une-api-rpc-soap-rest-graphql-et-si-le-probleme-etait-ailleurs-",
        "speakerIds": [
            "ribreau"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Posons-nous et profitons de ce talk pour prendre un peu de hauteur sur l'état de l'industrie tech autour de la création d'API de persistence (CRUD).\r\n\r\nD'où venons-nous, ou allons-nous ? Pourquoi le choix entre RPC, SOAP, REST et GraphQL n'est peut-être qu'un sujet de surface qui cache un problème bien plus profond.",
        "title": "Choisir entre une API RPC, SOAP, REST, GraphQL? Et si le problème était ailleurs ?",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.633",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f915",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "sur-le-pont-de-la-riviere-kawai",
        "speakerIds": [
            "margaux",
            "augustin",
            "marion"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Un pont de Hamster City s’est effondré ! Il nous en faut absolument un nouveau. Si vous avez eu votre dose de sessions techniques pour la journée, répondez à l’appel à projet du maire de Hamster City.\r\n\r\nNous avons créé un atelier ludo-pédagogique qui vous permettra de ressortir avec des bonnes pratiques, applicables lors de la conception de produit ou service. En groupe de 4 ou 5 personnes, vous découvrirez le plateau de jeu et les 8 personnages qui composent l’univers de Hamster City.\r\n\r\nRéussirez-vous à concevoir un meilleur pont que les autres équipes en trois itérations ? Participez à notre atelier pour le découvrir !\r\n",
        "title": "Sur le pont de la rivière Kawaï",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.634",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f916",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "code-from-scratch",
        "speakerIds": [
            "115833292931696563446",
            "106558503016616394107",
            "jules.hablot"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Repensez à vos premières lignes de codes… vous laissent-elles un bon ou un mauvais souvenir ?\r\nNe vous a t-il pas manquer d’apprendre à programmer proprement dès le départ ?\r\n\r\n\r\nVenez challenger vos pratiques de développement et transposer des concepts que vous maitrisez dans un univers où le code s'écrit différemment :-D.\r\nImaginez tester votre code dans un environnement adapté aux enfants de 5 ans ! \r\n\r\nAu programme une découverte de l'environnement, des katas : code smells, TDD, etc.\r\nC'est l'occasion aussi de découvrir Scratch sous un autre jour...\r\n\r\nA vous de jouer !",
        "title": "Code from Scratch",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.634",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "KEYNOTE_SURPRISE",
        "id": "5c7da825a6d40108c981f917",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "the-internet-in-2030",
        "speakerIds": [
            "andre"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "This is a \"surprise\" talk. For our keynote we choose the programm for you. You are in a room, and a speaker come to speak about a subject for which you ignore the content. Don't be afraid it's only for 30 minutes. As it's a surprise we don't display the session summary before...   ",
        "title": "A surprise keynote... is a surprise",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.634",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "KEYNOTE_SURPRISE",
        "id": "5c7da825a6d40108c981f918",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "openrndr",
        "speakerIds": [
            "edwin"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "This is a \"surprise\" talk. For our keynote we choose the programm for you. You are in a room, and a speaker come to speak about a subject for which you ignore the content. Don't be afraid it's only for 30 minutes. As it's a surprise we don't display the session summary before...   ",
        "title": "A surprise keynote... is a surprise",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.634",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f919",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "generative-and-data-driven-posters",
        "speakerIds": [
            "edwin",
            "bydrotgans"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "An introductory workshop in which participants will work with OPENRNDR to create a series of posters. The posters are made using generative and data-driven methods; we will write programs that use scrapers, open datasets and media archives to create posters.",
        "title": "Generative and Data-Driven Posters",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.634",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f91a",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "les-habitants-de-l-open-space-la-posture-du-manager",
        "speakerIds": [
            "pcomfaits"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Retour d'expérience sur l'utilisation des outils Solution Focus, Host Leadership, Management 3.0 pour amener les habitants d'un Open Space à améliorer leurs conditions de travail.\r\nLa présentation est structurée en 3 étapes :\r\n1) description du contexte et de la problématique, et tentative de résolution managériale classique\r\n2) Changement de posture managériale\r\n3) Bilan et enseignements, pour le manager, pour les habitants.",
        "title": "Les habitants de l'Open Space : la posture du manager",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.635",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f91b",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "venez-coder-votre-1ere-application-flutter-",
        "speakerIds": [
            "ptibulle",
            "100578619938900089909"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Le 4 décembre dernier Google sortait enfin la 1.0 de Flutter, leur nouveau SDK open-source pour créer des application iOS et Android performantes et adaptées à l’OS. Sur le papier ça a l'air intéressant, mais est-ce que ça vaut la peine de s'y investir ? Pour nous la réponse est clairement oui !\r\n\r\nC'est comment coder avec du Flutter ? ‘Un peu comme React Native ou Xamarin ?’  Oui, un peu… mais avec une intégration avec les widgets natifs et des niveaux de performance qui vont au delà de ce que Xamarin ou React Native peuvent proposer, le tout avec très peu de lignes de code.\r\n\r\nDans ce bootcamp nous allons faire une introduction pratique à Flutter. Et lorsque je dis pratique, c’est du pratique, vous allez code : vous partez à la fin en ayant développé une petite application Flutter tournant sur Android et iOS, et plus important encore, en ayant intégré les principes basiques du développement sur cette plate-forme.\r\n\r\nPREREQUIS INDISPENSABLE, vous devez apporter un ordinateur (PC portable ou MacBook) avec un environnement Flutter opérationnel en ayant suivi les 3 étapes suivantes :\r\n* https://flutter.io/docs/get-started/install\r\n* https://flutter.io/docs/get-started/editor\r\n* https://flutter.io/docs/get-started/test-drive\r\n\r\nSi vous affichez l'application de base dans un émulateur c'est tout bon !!!",
        "title": "Venez coder votre 1ère application Flutter !",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.635",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f91c",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "innovate-organisations-from-ego-to-eco",
        "speakerIds": [
            "ojuncu"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Because the productivity driven world of the industrial era encouraged us to divide in order to control, we live today in disconnection. Disconnection from ourselves, from our team, from our society. This workshop proposes to shift the paradigm and innovate using \"reconnection\" principles as defined by the Theory U. To understand the way theory U operates at a people group level, a concrete framework, \"Process Work\", by Arnold Minundell, will be experienced.\r\n\r\nThe workshop is a hands-on experiment of impact of change on each member of a team, including the game change player. The different stages of transformation defined by the Theory U will be experimented via Process Work, and is equally inspired by the model of living systems.\r\n\r\nThe ultimate intention of this workshop is to offer participants a learning experience of emergent co-created innovation , via quality listening, and the ability to redirect perspective.\r\nThe Learning Outcomes of the workshop are :\r\n-Experience the transformation protocol of Theory U by using Process Work\r\n-Learn and concretely experiment the way Theory U operates as a systemic dynamic.\r\n-Sense and redirect the flow of the intelligence of the group.\r\n-Learn how the power of intention along quality listening can redirect focus and spot on potential innovation opportunities",
        "title": "Innovate Organisations - From Ego To Eco",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.635",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f91d",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "building-stateful-resilient-and-complex-serverless-systems-while-orchestrating-old-school-services",
        "speakerIds": [
            "ivan"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Serverless functions are by definition stateless. Also, when they crash there's no „top function“ out-of-the-box that will notice it. Building complex workflows with them mean that you'll usually use a whole bunch of queues, and place logic that determines what's the next step inside of each function (where it shouldn't be), instead of in a central place.\r\nNow enter Durable Task Framework and its Azure „implementation“ Azure Durable Functions.\r\nThey come with event-sourcing available out-of-the-box, meaning that all of a sudden your functions can remember state. Developing complex workflow is no different that awaiting for some Tasks in your „console C# app“, and chaining and error handling is built in.\r\nSo all of a sudden your serverless system start having simple, and clean code while being resilient.\r\nNot only that, but you'll be able to call some non-functions services, place your function to sleep (which doesn't incur costs), and wake out once the external event URL has been triggered.\r\nEnough said, let's build some live demos during this session 😉",
        "title": "Building stateful, resilient and complex serverless systems while orchestrating old-school services",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.635",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f91e",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "-css-clockwork",
        "speakerIds": [
            "igor.laborie"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Souvent décrié, le CSS est pourtant puissant, et surtout fun.\r\nAujourd’hui alors qu’on est entré dans l’ère post-IE, on peut utiliser beaucoup plus sereinement cette puissance ; pourquoi passer à côté !\r\n\r\nCette session de live-coding d’une horloge est l’occasion de montrer quantité de trucs et astuces utiles quotidiennement pour les développeu·rs·ses web.\r\nNous aborderons en particulier les _custom properties_ (c.-à-d. CSS variables), les transformations, les animations, les compteurs, et un peu de positionnement.",
        "title": "⏰ CSS Clockwork",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.636",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f91f",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "slow-ux-de-l-art-de-la-lenteur-dans-les-processus-de-conception-centres-sur-l-usage-",
        "speakerIds": [
            "yharrassarry"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "J’aurai pu intitulé cela juste « Slow UX » mais c’est justement ce genre de raccourci que je souhaite éviter, comme si il existait une « fast&furious UX ». Malheureusement, je crains que cela soit une croyance un peu trop répandu dans bien des milieux peu au courant des bonnes pratiques. Le marché de l’expérience c’est largement diversifié ces derniers temps, après la phase de croissance en UX pur et dur, une phase de design thinking, d’autres disciplines se confrontent à l’expérience et au facteur humain avec plus ou moins de bonheur.\r\nLes méthodes « Fast & Furious UX », design sprint ou guérilla font la course à l’échalotte, mais j’aimerai plus vous parler du temps nécessaire pour bien prendre en compte le facteur humain et ses usages.",
        "title": "Slow UX, De l’art de la lenteur dans les processus de conception centrés sur l'usage.",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.636",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f920",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "du-design-de-l-attention-a-l-ethique-du-designer",
        "speakerIds": [
            "yharrassarry"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Quand je conçois une page, un service, je vais faire attention aux besoins des utilisateurs, à leurs capacités cognitives. Je vais les guider dans le parcours que j’estime pertinent pour eux. Je vais attirer à leur attention vers certains éléments, la détourner d’autres éléments que je juge secondaire. Je peux jouer avec différents biais cognitifs pour arriver à mes fins.\r\nEn allant plus loin, je peux mettre en place une stratégie pour que les utilisateurs adoptent librement certains comportements, voir créer de l’addiction, que se soit numérique ou dans la vie réelle. Ces comportements peuvent être vertueux ou justes servir les intérêts d’une entreprise.\r\nQuand est-ce que, moi, designer je passe la ligne rouge ? Quelles règles je me fixe ou pas ? Il existe des codes de conduites comme celui de l’UXPA, mais concrètement ça donne quoi quand on essaye de l’appliquer dans la vraie vie ?",
        "title": "Du design de l’attention à l’éthique du designer",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.636",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f921",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "storytelling",
        "speakerIds": [
            "olivier.huber"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "L'attention d'un public serait de 15mn max, avec le Storytelling vous pouvez poussez cette limite, capter et garder l'attention de votre audience. Nous allons le démontrer comment avec humour et verrons comment il peut nous être utile dans notre métier de consultant/formateur.",
        "title": "Storytelling",
        "topic": "lifestyle",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.636",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f922",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "le-web-ses-frameworks-et-ses-standards-deconstruire-pour-mieux-re-construire",
        "speakerIds": [
            "hsablonniere"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Dans le monde merveilleux du frontend Web, les frameworks et leurs écosystèmes vont et viennent.\r\nCette course folle fatigue une grande partie des développeurs.\r\nPourtant, nous continuons à faire des choix d'architecture qui nous pousseront demain, à jeter et réécrire beaucoup de code.\r\n\r\nIl est devenu trop facile de s'enfermer dans un framework/écosystème X ou Y et trop facile de limiter ses connaissances à ce qu'il propose.\r\nOn en oublie les problèmes de bases, les fondamentaux, et le plus souvent cela nous pousse à écrire du code qui mélange les couches (UI, accès au DOM, accès aux données, router, state manager...) et qui résiste mal au temps.\r\n\r\nAu menu de cette session, je vous propose de décortiquer les différentes parties qui composent les frameworks Web modernes :\r\n\r\n* Pourquoi utilisons-nous ces outils ?\r\n* Quels problèmes nous aident-ils à résoudre ?\r\n* Comment réduire l'adhérence et le couplage de notre code avec ces écosystèmes ?\r\n* Comment produire du code de meilleure qualité, à l'épreuve du temps, de la hype et des évolutions des standards du Web ?",
        "title": "Le Web, ses frameworks et ses standards : déconstruire pour mieux (re?)construire",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.637",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f923",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "tensorflow-there-is-no-spoon",
        "speakerIds": [
            "tiffanysouterre"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "With the advance in Artificial Intelligence, neural networks are everywhere! But like all technologies, it has its flaws. Adversarial examples are able to fool neural networks used for critical applications such as self-driving cars, face recognition apps, security cameras... Together, we will see how to generate your own adversarial images and fool a neural network into seeing things that are not there. We'll also see how to defend against adversarial attacks.\r\nNo Tensorflow, there is no spoon!",
        "title": "Tensorflow, there is no spoon",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.637",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f924",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "vs-code-mode-collaboratif-active-",
        "speakerIds": [
            "leplus.olivier",
            "tiffanysouterre"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Vous aimez VS Code car il est simple, intuitif et qu'il fait ce que vous lui demandez. Mais saviez-vous que vous pouviez coder à plusieurs dans VS Code? et même permettre à une personne tierce de jouer avec votre débugger depuis l'autre bout du monde? Saviez-vous que vous pouviez avoir un client slack dans VS Code, et même un chat audio? Et avez-vous exploré toutes les possibilités que VS Code offre quand vous utilisez github? Nous verrons dans ce talk tout ce qui fait de VS Code l'éditeur de code parfait pour faire du code collaboratif.",
        "title": "VS Code: mode collaboratif activé!",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.637",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f925",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "knative-openfaas-kubeless-la-guerre-des-frameworks-serverless-est-lancee-",
        "speakerIds": [
            "laurentgrangeau"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Avec le récent lancement de Knative par Google, la guerre des frameworks serverless est officiellement déclarée ! Durant ce talk, je vous propose de revenir sur la genèse de ces frameworks et de vous présenter les pour et contre de chacun de ces frameworks.",
        "title": "Knative, OpenFaaS, Kubeless : la guerre des frameworks serverless est lancée !",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.637",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "RANDOM",
        "id": "5c7da825a6d40108c981f926",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "eloge-du-vide",
        "speakerIds": [
            "jb.lievremont"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Ce talk est de type \"random\". Pour cette track, nous choisissons le programme pour vous. Vous êtes dans une pièce et un speaker vient parler d'un sujet dont vous ignorez le contenu. N'ayez pas peur, c'est seulement pour 20 minutes. Comme c'est une surprise, nous n'affichons pas le résumé de la session avant ...",
        "title": "Éloge du vide",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.637",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f927",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "d-une-architecture-n-tiers-a-une-architecture-clean-hexagonale",
        "speakerIds": [
            "cgilet"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Aujourd'hui, de nombreuses applications ont été développées en suivant l'architecture N-Tiers.\r\n\r\nLa promesse de l'architecture hexagonale et de la clean architecture est de simplifier la maintenabilité de nos applications et l'évolutivité qui nous fait souvent défaut.\r\n\r\nEn partant d'une base de code java 3-Tiers (Controller/Service/Repository), nous ferons évoluer ce code pour passer à une architecture hexagonale en isolant le coeur métier de tout le reste (outils, briques d'infrastructures). Nous verrons comment séparer les accès à une base de données/un système de fichier/un serveur de mail de notre code métier. Et nous comprendrons ce que ça peut nous apporter dans notre quotidien de développeur.",
        "title": "D'une architecture N-Tiers à une architecture Clean Hexagonale",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.638",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "RANDOM",
        "id": "5c7da825a6d40108c981f928",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "le-genie-parametrise-metafont-et-ses-lecons",
        "speakerIds": [
            "sam.galson"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Ce talk est de type \"random\". Pour cette track, nous choisissons le programme pour vous. Vous êtes dans une pièce et un speaker vient parler d'un sujet dont vous ignorez le contenu. N'ayez pas peur, c'est seulement pour 20 minutes. Comme c'est une surprise, nous n'affichons pas le résumé de la session avant ...",
        "title": "Le génie paramétrisé: MetaFont et ses leçons",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.638",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f929",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "learn-how-to-write-micropython-on-the-micro-bit",
        "speakerIds": [
            "lespounder"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "In this workshop we create a project using a version of Python 3 for micro controllers on the BBC micro:bit.\r\nOur hacks are based on arts / crafts materials and cheap equipment that we can find on the high street.",
        "title": "Learn how to write MicroPython on the micro:bit",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.638",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f92a",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "vers-l-infini-et-au-dela-avec-angular-",
        "speakerIds": [
            "williamarques91"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "L'un des problèmes que l'on rencontre souvent avec Angular est: \"Comment faire évoluer mon projet tout en gardant de bonnes performances et une structure propre ?\"\r\n\r\nPourtant, de nombreuses pratiques et outils existent et sont simples à mettre en place pour qu'Angular reste très performant à la fois au chargement et au runtime. Il suffit de venir les découvrir au travers de ce talk qui sera accompagné de *live coding* afin de directement passer de la théorie à la pratique !\r\n\r\nDe l'AOT au Lazy Loading en passant par les stratégies de détection de changement, venez découvrir comment aller vers l'infini et au-delà avec Angular.",
        "title": "Vers l’infini et au-delà avec Angular !",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.638",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "RANDOM",
        "id": "5c7da825a6d40108c981f92b",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "cooperation-inter-entreprises-et-logiciels-libres",
        "speakerIds": [
            "arthru",
            "samira_rabaaoui"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Ce talk est de type \"random\". Pour cette track, nous choisissons le programme pour vous. Vous êtes dans une pièce et un speaker vient parler d'un sujet dont vous ignorez le contenu. N'ayez pas peur, c'est seulement pour 20 minutes. Comme c'est une surprise, nous n'affichons pas le résumé de la session avant ...",
        "title": "Coopération inter-entreprises et logiciels libres",
        "topic": "ethics",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.639",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f92c",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "vanilla-js-2019",
        "speakerIds": [
            "Swiip"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Imaginez une application Web qui utiliserait toutes les nouvelles APIs des navigateurs en même temps. Ce n'est peut être pas le projet le plus raisonnable pour un besoin client mais pour de la veille, c'est passionnant ! Je vous propose un retour sur cette expérience un peu hors du commun.\r\n\r\nAprès une première édition 2018 et des retours encourageant, j’ai poussé toujours plus loin l’expérience avec encore de nouvelles APIs, la principale nouveauté : Web Assembly !\r\n\r\nJe vous propose le retour d'expérience du développement d’un application Web combinant toutes les nouvelles normes du Web. Pour me guider, il y a des règles strictes (sinon on s'ennuie !) :\r\n- Interdiction totale de l'utilisation de code source externe au projet\r\n- ‎Volonté d'utiliser autant de nouvelles normes que possible. Quelque soit les univers : HTTP, HTML, DOM, JS, CSS.\r\n- ‎Tout est autorisé du moment que ce soit une norme non propriétaire et que cela fonctionne dans au moins 2 navigateurs (flags autorisés).\r\n\r\nNous parlerons d'un bon nombre de sujets :\r\n- HTTP/2\r\n- Web Components\r\n- Web Assembly\r\n- Virtual Dom\r\n- State Management\r\n- Web Workers\r\n- Service Workers\r\n\r\nJe vous propose de vous présenter les résultats d'un \"fun project\" qui, pour moi, a sûrement été le plus intéressant et enrichissant depuis longtemps si ce n'est depuis toujours.",
        "title": "Vanilla JS 2019",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.639",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f92d",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "changer-les-relations-difficiles-par-une-approche-systemique-interactionnelle",
        "speakerIds": [
            "julien.porot",
            "ckeromen"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Quand une relation est difficile, on aimerait disposer d’une télécommande pour changer l’autre !\r\n\r\nMalheureusement ( ou pas !) cela n’est pas possible.\r\n\r\nAu travers d’une étude de cas, cette conférence propose de vous initier au modèle d'intervention systémique et stratégique de Palo-Alto pour résoudre ce genre de problèmes.\r\n\r\nIl s’agira d’abord de comprendre les processus dysfonctionnels relationnels. Ensuite, d’adopter une stratégie spécifique d’amélioration de la situation.\r\n\r\nNous utiliserons pour cela une grille de représentation des interactions et des boucles de feedback. Nous verrons en particulier comment la compréhension des tentatives de solutions infructueuses nous amènera à proposer des prescriptions paradoxales.\r\n\r\nDécouvrez le réducteur de complexité proposé par le modèle de Palo-Alto et l’apport fondamental que constitue l’approche stratégique.\r\n\r\nVous êtes familier de l’agilité, mais vous ne connaissez pas la systémique. Le manifeste agile mentionne l’importance privilégiée à accorder aux \"Individus et à leurs interactions\". Le modèle Palo-Alto propose justement une démarche stratégique focalisée sur l’aspect interactionnel des dysfonctionnements.\r\n\r\nVous ne connaissez ni la systémique, ni l’agilité, mais vous êtes curieux d’en savoir plus sur une démarche non normative, considérant que tout problème est une question de perception de sa relation à soi-même, aux autres ou au monde. Venez découvrir en pratiquant sur des cas du monde de l’entreprise.",
        "title": "Changer les relations difficiles par une approche systémique interactionnelle",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.639",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f92e",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "comment-les-jeux-video-m-ont-forme-a-l-agilite",
        "speakerIds": [
            "r.lesieur"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Apprendre en jouant, c'est possible ! Le plus impressionnant est quand on s'en rend compte des années plus tard. Quels jeux m'ont préparés à l'agilité et au management et comment, c'est ce que je veux partager.",
        "title": "Comment les jeux vidéo m'ont formé à l'agilité",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.639",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "RANDOM",
        "id": "5c7da825a6d40108c981f92f",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "from-minimalism-to-building-a-tiny-house",
        "speakerIds": [
            "ramshorstvan Ramshorst"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "This is a \"Random\" talk. For this track we choose the programm for you. You are in a room, and a speaker come to speak about a subject for which you ignore the content. Don't be afraid it's only for 20 minutes. As it's a surprise we don't display the session summary before...   ",
        "title": "From minimalism to building a Tiny House",
        "topic": "lifestyle",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.639",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f930",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "great-features-implies-great-responsabilities",
        "speakerIds": [
            "mere-teresaHaïm-Lubczanski"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "\r\nLa documentation est indispensable et tout vos collègues se défilent ? Ou tout simplement, personne ne sait trop comment s'y prendre, et votre documentation est un patchwork ?\r\nDans une équipe, qui est en charge de la produire, de la relire et d'en assurer la qualité et la cohérence ?\r\nComment s'organiser pour mettre à jour la documentation et développer ?\r\nJe vous propose un retour d'expérience de 4 années en tant que Technical Writer, des conseils que je peux vous apporter, si vous n'avez pas la chance d'avoir une personne dédiée à la Documentation.",
        "title": "Great features implies great responsabilities",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.64",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f931",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "the-illusion-of-speed-hacking-users-perception",
        "speakerIds": [
            "elisabeth-engel"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Perceived page speed is all about the first visual impression. But what if you could make it seem to be even faster than it really is? What if we could make use of the strongly filtered and interpreted human perception of speed?\r\n\r\nThis talk will dive deeper into human perception and the assumptions we all make intuitively. You will learn how to manipulate time perception to make your page seem even faster than it technically is. This will include embedded content placeholders to provide a smooth loading experience, the clever use of animations and optimistic UI elements, as well as skillful distractions.",
        "title": "The Illusion of Speed - Hacking Users' Perception",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.64",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "RANDOM",
        "id": "5c7da825a6d40108c981f932",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "diminuer-ses-dechets-c-est-possible-",
        "speakerIds": [
            "ellene.dijoux"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Ce talk est de type \"random\". Pour cette track, nous choisissons le programme pour vous. Vous êtes dans une pièce et un speaker vient parler d'un sujet dont vous ignorez le contenu. N'ayez pas peur, c'est seulement pour 20 minutes. Comme c'est une surprise, nous n'affichons pas le résumé de la session avant ...",
        "title": "Diminuer ses déchets c’est possible !",
        "topic": "lifestyle",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.64",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f933",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "introduction-aux-word-embeddings-avec-word2vec",
        "speakerIds": [
            "paul.mougel",
            "tanguy.moreau"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Comment utiliser un modèle de réseaux de neurones pour utiliser l'analyse sémantique dans une application ?\r\n\r\nNous vous présenterons le modèle Word2Vec, qui permet d'encoder mathématiquement la sémantique des mots.\r\n\r\nDurant ce workshop, nous vous guiderons dans la construction de votre propre moteur de suggestion sémantique en Python :\r\n- vous construirez votre propre modèle Word2Vec ;\r\n- vous l'entraînerez sur différents jeux de données ;\r\n- vous apprendrez à l'explorer pour en comprendre le fonctionnement et les impacts des paramètres d'entraînement ;\r\n- vous construirez un moteur de suggestion.",
        "title": "Introduction aux Word Embeddings avec Word2Vec",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.64",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f934",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "migration-de-6play-vers-le-cloud-retour-d-experience",
        "speakerIds": [
            "pascal.martin"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "En 2018, nous avons entamé la migration de la plateforme 6play vers Le Cloud. À présent, nous pilotons notre infrastructure AWS avec Terraform, utilisons des services managés et déployons nos applications sous Kubernetes.\r\n\r\nPendant cette conférence, vous découvrirez comment nous avons réalisé cette migration. Vous trouverez des réponses aux questions que vous vous posez si vous envisagez de revoir votre hébergement. Comment avons-nous transformé notre infrastructure ? Quels impacts sur nos projets ? Comment nous sommes-nous organisés ? Quels choix avons-nous effectués tout au long du processus ? Qu’avons-nous appris, qu’avons-nous fait évoluer ? Comment nos équipes se répartissent-elles les tâches ? Avons-nous dû adapter nos applications PHP ? Quelles difficultés avons-nous rencontrées, quels compromis avons-nous acceptés et quelle route nous reste-t-il à parcourir ?\r\n\r\nJe commencerai par présenter les bases de l’Infrastructure as Code avec Terraform et de l’orchestration de conteneurs avec Kubernetes. Nous enchainerons avec un retour d’expérience de notre migration de la plateforme 6play vers Le Cloud.",
        "title": "Migration de 6play vers Le Cloud, retour d’expérience",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.64",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "RANDOM",
        "id": "5c7da825a6d40108c981f935",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "la-verite-sur-ce-qui-nous-motive",
        "speakerIds": [
            "i.gauthier"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Ce talk est de type \"random\". Pour cette track, nous choisissons le programme pour vous. Vous êtes dans une pièce et un speaker vient parler d'un sujet dont vous ignorez le contenu. N'ayez pas peur, c'est seulement pour 20 minutes. Comme c'est une surprise, nous n'affichons pas le résumé de la session avant ...",
        "title": "La vérité sur ce qui nous motive",
        "topic": "lifestyle",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.641",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f936",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "initiation-a-l-improvisation-theatrale",
        "speakerIds": [
            "coudot"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "L'improvisation théâtrale ça ne s'improvise pas, la plupart des personnes la pratiquant s'entraînent au moins une fois par semaine. Comme un magicien révélant ses tours, je vous propose de participer à un atelier d'initiation pour découvrir quelques techniques, et voir également comment elles peuvent vous aider dans votre vie personnelle et professionnelle",
        "title": "Initiation à l'improvisation théâtrale",
        "topic": "lifestyle",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.641",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "RANDOM",
        "id": "5c7da825a6d40108c981f937",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "combiner-respecte-de-la-vie-privee-et-personnalisation-des-services-en-ligne",
        "speakerIds": [
            "nitot"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Ce talk est de type \"random\". Pour cette track, nous choisissons le programme pour vous. Vous êtes dans une pièce et un speaker vient parler d'un sujet dont vous ignorez le contenu. N'ayez pas peur, c'est seulement pour 20 minutes. Comme c'est une surprise, nous n'affichons pas le résumé de la session avant ...",
        "title": "Combiner respecte de la vie privée et personnalisation des services en ligne",
        "topic": "ethics",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.641",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f938",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "mettre-en-place-une-chaine-de-livraison-continue-pour-vos-applications-serverless",
        "speakerIds": [
            "sebastien.stormacq"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Les architectures sans serveur vous permettent de construire et deployer des applications sans avoir à provisionner, gèrer et surveiller des infrastructures classiques (serveurs, OS, middleware etc).  Après avoir montré comment créer rapidement une API sans serveur, nous vous montrerons comment mettre en place une chaîne d'intégration et de déploiement continu pour vos backends sans serveur sur AWS.",
        "title": "Mettre en place une chaîne de livraison continue pour vos applications serverless",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.642",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f939",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "please-stand-up-",
        "speakerIds": [
            "priscille.fay",
            "emmanuel.herve"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Le stand up est considéré par certains comme le rituel phare de l’agilité. Par d’autres... comme un mauvais moment à passer. \r\nCette rencontre quotidienne, à priori simple à appliquer, est pourtant déclinée à l’infini par ceux qui l’utilisent.\r\nDes plus sérieux au plus inattendus, nous vous proposons un tour d’horizon des stand up du monde.\r\nVenez les (re)découvrir pour vous inspirer des meilleurs et mettre en perspective les différentes pratiques.\r\nVous repartirez forcément avec des clés pour que vos stand up soient à la fois porteurs de sens, efficaces et plaisants.\r\n",
        "title": "Please stand up !",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.642",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f93a",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "les-emotions-fortes-au-travail-qu-est-ce-que-j-en-fais-",
        "speakerIds": [
            "jquille"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Cette session de deux heures est née d'une situation en entreprise où je me suis retrouvée avec une équipe entière en situation de stress émotionnel, avec chacun qui s'enfonçait un peu plus dans une cacophonie émotionnelle dans laquelle nous ne pouvions plus voir grand chose. L'idée : prendre du recul, respirer, se poser et détricoter tout ça fils après fils.\r\nCe sont donc deux heures de cheminement au coeur d'une relation entre l'émotion de l'autre et la notre que je vous propose. Au court de ce voyage nous ferons des points d'étapes pour comprendre le concept de souveraineté, comment nous pouvons sortir d'une situation émotionnelle perdant-perdant ou encore le lien entre les émotions et les besoins. L'objectif de tout cela ? D'abord et avant tout, nous donner une vision différente des choses et nous permettre d'améliorer notre quotidien.",
        "title": "Les émotions fortes au travail : qu'est-ce que j'en fais ?",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.643",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f93b",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "decentralizing-internet-of-things",
        "speakerIds": [
            "dikshitrocks93"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Most IoT devices today use proprietary vertical technology stacks which are built around a central point of control and which don’t always talk to each other.When they do talk to each other it requires per-vendor integrations to connect those systems together. \r\n\r\nMany of the new devices connecting to the Internet are insecure, do not receive software updates to fix vulnerabilities, and raise new privacy questions around the collection, storage, and use of large quantities of extremely personal data. As new types of devices come online, they bring with them significant new challenges around security, privacy and interoperability.\r\n\r\nThe “Web of Things” (WoT) is an effort for creating a decentralized Internet of Things by giving Things URLs on the web to make them linkable and discoverable, and defining a standard data model and APIs to make them interoperable.\r\n\r\nIt is not just another vertical IoT technology stack to compete with existing platforms but is a unifying horizontal application layer to bridge together multiple underlying IoT protocols.\r\nThe \"Web of Things\" is built on existing, proven web standards REST, HTTP, JSON, WebSockets and TLS which helps to form a bridge with existing devices so that it can communicate with any device irrespective of the vendor.\r\n\r\nThe future of connected devices should be more like the open web. The future should be decentralized, and should put the power and control into the hands of the people who use those devices.\r\n",
        "title": "Decentralizing Internet of Things",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.643",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f93c",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "building-an-open-source-project",
        "speakerIds": [
            "Joshua.Lowe"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "In this talk, 15 year old software developer Joshua Lowe, will talk about his journey building an open source project. Josh has been running his open source project, EduBlocks, for 2 years and has learnt many things along the way. This talk will discuss the benefits of going open source, why open source may be a good idea for your project, the problems of making your project open source and advice for people who may be interested in building an open source project or may already be maintaining one. As well as discussing open source projects, Josh will talk a bit about his project EduBlocks, which is a visual block based programming tool that he has created to help teachers introduce programming languages, like Python, to children at an earlier age. It's being used in over 120 countries across the world in schools, homes and more!",
        "title": "Building an open source project",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.643",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f93d",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "responsabilisez-vous-qu-ils-disaient-",
        "speakerIds": [
            "olivier.my"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Vous rappelez vous d'une situation où vous étiez en toute possession de vos moyens, plein(e) de ressources, de créativité et d'énergie ? \r\n\r\nC'est dans le cas contraire que les choses se compliquent. Nous nous lançons alors dans un processus enfermant qui nous empêche d'affronter la situation telle qu'elle est. Cette séquence a été modélisée par Christopher Avery sous le nom de Processus de Responsabilité. \r\n\r\nJe vous propose de la découvrir afin d'avoir un autre regard sur les situations de votre quotidien et de les vivre de manière plus libre et plus épanouie.",
        "title": "Responsabilisez-vous qu'ils disaient !",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.643",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "RANDOM",
        "id": "5c7da825a6d40108c981f93e",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "le-paradoxe-du-poisson-rouge",
        "speakerIds": [
            "olivier.my"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Ce talk est de type \"random\". Pour cette track, nous choisissons le programme pour vous. Vous êtes dans une pièce et un speaker vient parler d'un sujet dont vous ignorez le contenu. N'ayez pas peur, c'est seulement pour 20 minutes. Comme c'est une surprise, nous n'affichons pas le résumé de la session avant ...",
        "title": "Le paradoxe du poisson rouge",
        "topic": "lifestyle",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.643",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f93f",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "la-5g-40-pour-presque-tout-comprendre",
        "speakerIds": [
            "alexisd"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "La 5G arrive à grand pas et de nombreux médias et industriels commencent à en parlé. Ce fut notemment le cas lors du Consumer Elecronic Show (CES) qui s'est tenu à Las Vegas en janvier dernier.\r\n\r\nAlors que le processus de standardisation n'est pas encore tout à fait finalisé, certain d'entre vous se posent surement de nombreuses questions : qui sont les acteurs ? quand ? que cela va-t-il changer ? Quelles sont les technologies qui se cachent derrière _\"5G\"_ ?\r\n\r\nAu cours de cette présentation, j'essairais de répondre à ces questions. Nous parlons notamment de 3GPP de mmWave, NFV, 5G-New Radio, Massive IoT, LPWAN, ou de beamforming.",
        "title": "La 5G, 40' pour (presque) tout comprendre",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.643",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f940",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "la-parole-au-travail-un-privilege-masculin",
        "speakerIds": [
            "quillejulie",
            "raphael"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "L’objectif de cet atelier est de permettre aux participant·e·s de prendre conscience de l’impact du genre dans la dynamique de la parole dans le cadre professionnel : Chaque personne a-t-elle le même droit à la parole, et sera-t-elle entendue de la même manière selon son genre ?\r\n\r\nNous souhaitons offrir aux participant·e·s une occasion de partager leur expérience, réfléchir ensemble et toucher du doigt les mécanismes qui leur permettent de ne pas percevoir ces phénomènes.",
        "title": "La parole au travail : un privilège masculin",
        "topic": "lifestyle",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.644",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f941",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "au-dela-des-couleurs-des-interfaces-adaptees-au-daltonisme",
        "speakerIds": [
            "laurawacrenier"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Nous ne percevons pas tous les couleurs de la même façon. Il est admis que 4,5% de la population a des difficultés à distinguer certaines teintes comme le rouge ou le vert. Et pourtant, nous continuons à utiliser ces couleurs comme des standards d'information dans nos interfaces. Erreurs en rouge, validations en vert… Malgré des recommandations d’accessibilité bien connues, le design d’interface moderne continue d’ignorer cette partie des utilisateurs aux profits de certaines tendances visuelles. Pour les personnes dites daltoniennes, grand nombre de services en ligne sont tout simplement inutilisables.\r\n\r\nAlors comment renverser cette tendance ? Une interface accessibles aux daltoniens doit-elle forcément être moche ? Pénible à mettre en place ? Essayons ensemble de transformer cette contrainte d’accessibilité en moteur pour de meilleures expériences.\r\n\r\nNous verrons ensemble les bonnes pratiques et les outils à utiliser pour s’assurer que nos interfaces sont accessibles à tous les types de vision des couleurs. Mais surtout nous verrons comment faire de ce sujet une priorité au sein de votre équipe.",
        "title": "Au delà des couleurs, des interfaces adaptées au daltonisme",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.644",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f942",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "histoires-de-gros-echecs-logiciels-et-si-on-testait-plus-souvent-et-mieux-nos-assertions-",
        "speakerIds": [
            "s_colson"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Des problèmes avec des logiciels, on en a tous eu: dans les produits auxquels on participe au développement ou même dans ceux qu’on utilise au quotidien. \r\n\r\nLorsque c’est le tunnel d’achat qui est cassé pour les quelques utilisateurs ayant mis dans leur panier un produit particulier, c’est une perte de revenue et d’image, mais l’impact reste limité. Mais lorsqu’il devient possible de mettre dans son panier des quantités négatives de produit et que le client peut être crédité de la somme au lieu d’en être débité, cela peut vite couter très cher si le “truc” vient à se faire connaitre; et pour cela les réseaux sociaux se feront un plaisir d’être vos pires ennemis.\r\n\r\nDe plus vous pouvez faire confiance à la diversité du monde pour avoir l’originalité suffisante d’avoir des données relativement improbables aux conséquences pouvant être désastreuses pour votre business.\r\n\r\nEn allant de la personne recevant toutes les amendes de sa ville, au logiciel de reconnaissance faciale ayant des réactions racistes, au chômeur régulier sommé de rembourser une somme énorme par les services sociaux, au formulaire ne vous permettant pas de saisir votre situation, les logiciels ne sont pas toujours là pour nous faciliter la vie lorsqu’ils ont oublié des cas de figure particuliers.\r\n\r\nDans ce talk, je présenterai plusieurs exemples d’échecs logiciels qui ont eu des conséquences parfois étonnantes. Cela peut être dû à une maladresse, un oubli, un bug ou même une utilisation frauduleuse du système. Avec des exemples parfois drôles, parfois dramatiques voire choquants, vous verrez que la complexité de nos métiers n’est pas que dans la technique. Je parlerai aussi un peu des biais cognitifs qui font qu’involontairement on ne fait pas toujours les bonnes décisions, même si on s’est armé de la meilleure volonté du monde, et d’une quantité de travail énorme.\r\n\r\nFinalement, pour pallier à cela, bien entendu il faut tester son produit, et pas seulement le produit développé mais aussi les idées et principes qui fondent celui-ci. Le contenu de ce talk peut donc potentiellement intéresser les responsables produits, les développeurs, les UX designers, les business analyst, les testeurs…",
        "title": "Histoires de gros échecs logiciels. Et si on testait plus souvent et mieux nos assertions ?",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.644",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f943",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "dynamic-kanban",
        "speakerIds": [
            "ygrenzinger",
            "pablopernot"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Faire progresser vos organisations et vos Kanbans en comprenant à quel niveau de maturité vous vous situez et où pourrait vous mener l’étape suivante. Un atelier sur Kanban, la spirale dynamique et les questions pour se découvrir et avancer.",
        "title": "Dynamic Kanban",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.644",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f944",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "the-subtle-art-of-recommendation-algorithms-",
        "speakerIds": [
            "simon.belak"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Recommendation algorithms and their variations such as ranking are the most common way for machine learning to find its way into a product where it is not the main focus. In this talk we’ll dig into the subtleties of making recommendation algorithms a seamless and integral part of your UX (goal: it should completely fade into the background. The user should not be aware she’s interacting with any kind of machine learning, it should just feel right, perhaps smart or even a tad like cheating); how to solve the cold start problem (and having little training data in general); and how to effectively collect feedback data. I’ll be drawing from my experiences building Metabase, an open source analytics/BI tool, where we extensively use recommendations and ranking to keep users in a state of flow when exploring data; to help with discoverability; and as a way to gently teach analysis and visualization best practices; all on the way towards building an AI data scientist. ",
        "title": "The subtle art of recommendation (algorithms)",
        "topic": "ethics",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.644",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f945",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "que-deviennent-nos-mots-de-passe-apres-un-leak-de-donnees-",
        "speakerIds": [
            "51680989",
            "mickaeljeanroy"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "De nos jours, les leaks de données sont devenus monnaie courante. On entend parler quotidiennement de failles exploitées sur nos sites préférés, qui ont rendu nos données vulnérables et disponibles dans la nature.\r\nDans ce talk, nous vous proposons de découvrir ensemble à quoi peut ressembler une base de données fuitée et ce qu’on peut en faire.\r\n\r\nNous vous montrerons entre autres (avec des démos) comment récupérer des mots passe à partir de ces fuites ainsi que les différentes fonctions de hachage, mais surtout comment les craquer !\r\n\r\nPour finir, nous verrons ce que chacun peut faire pour se protéger en tant qu’utilisateur.",
        "title": "Que deviennent nos mots de passe après un leak de données ?",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.645",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f946",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "modern-web-testing-going-beyond-selenium",
        "speakerIds": [
            "dmitryvinn"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "It is safe to say that Selenium WebDriver is the number one testing tool for many software engineers across the globe. However, as the tech world has been growing rapidly, so has the testing industry. More and more UI testing frameworks besides Selenium are gaining popularity. \r\n\r\nThese new test frameworks are especially appealing to its users because of the promise to solve speed, maintenance, development and other concerns of WebDriver implementations. These new, non-Selenium frameworks emphasize Rapid Test Development practices, and it has been resonating with the development community. \r\n\r\nIn this talk, we dive into test solutions evolved from Selenium like Protractor, and talk about non-Selenium frameworks like TestCafe and Cypress.io. We discuss why these new tools are gaining popularity and continue to disrupt the traditional testing standards of Selenium WebDriver. More importantly, we address how to get started and what mistakes to avoid when first implementing TestCafe or Cypress.io in your team.\r\n",
        "title": "Modern Web Testing: Going Beyond Selenium",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.645",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "KEYNOTE_SURPRISE",
        "id": "5c7da825a6d40108c981f947",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "faconner-des-futurs-souhaitables-concevoir-a-l-ere-de-l-anthropocene",
        "speakerIds": [
            "mcpaccard",
            "thomas+sessionize"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Ce talk est une \"surprise\". Pour cette track, nous choisissons le programme pour vous. Vous êtes dans une pièce et un speaker vient parler d'un sujet dont vous ignorez le contenu. N'ayez pas peur, c'est seulement pour 30 minutes. Comme c'est une surprise, nous n'affichons pas le résumé de la session avant ...",
        "title": "A surprise keynote... is a surprise",
        "topic": "ethics",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.646",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f948",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "remake-de-jeux-retro-avec-vue-js",
        "speakerIds": [
            "decoster",
            "blier.juliane"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Quoi de mieux que de recoder son jeu préféré pour apprendre une nouvelle techno ? Nous allons nous replonger dans notre enfance pour découvrir les concepts de Vue.js en codant un clone de Pokemon Red.\r\n\r\nUn jeu n'est rien d'autre qu'un joueur interagissant avec un univers représenté à l’écran. Et Vue est un framework pensé pour isoler interactions, informations (qui décrivent l'univers du jeu) et la représentation visuelle basée sur ces informations.\r\nNous verrons ensemble pourquoi Vue est un outil adapté au développement de jeu et qu'inversement, le développement d'un jeu offre un bon angle pour découvrir les concepts clés de Vue.",
        "title": "Remake de jeux rétro avec Vue.js",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.647",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f949",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "webassembly-dans-la-vraie-vie",
        "speakerIds": [
            "decoster"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Une petite conférence pour essayer de cerner ce qu'est cet OVNI dans l'univers des technos web. Ce nouveau standard vient de débarquer dans les navigateurs et soulève pas mal de questions sur ses promesses (rapidité ! cible de compilation universelle !) et sur ses cas d’utilisations concrets.\r\n\r\nLors de cette conférence je commencerai par un peu d'histoire et de technique pour s'éclaircir les idées et pour voir comment on travaille avec cette techno. Je présenterai ensuite mon retour d'expérience sur une étude menée pour le CNES pour expérimenter l'apport de WebAssembly pour la visualisation et le traitement de très grandes images satellites dans le navigateur. Il y aura de la lecture de format de fichier exotique (JPEG 2000), de la détection d'avions par machine learning et de la détection de nuages par deep learning. On ira même jusqu’à utiliser les Google Cloud Functions pour voir ce que WebAssembly a à raconter en dehors du navigateur.",
        "title": "WebAssembly dans la vraie vie",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.648",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f94a",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "empower-your-team-for-self-organization-using-liberating-structures",
        "speakerIds": [
            "ch.weinert"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Principles and Motivation\r\nWe believe that an empowered team is balanced between over-control and chaos. Our guiding theme for this session is the question what groups and individuals can do to support the habit of staying on the figurative horse of disciplined self-organization. We would like to introduce participants to Liberating Structures - a set of 33 patterns that have proven tremendously useful in aiding teams on their way towards true self-organization - as a first step towards finding the ideal balance between freedom and control within teams and companies. We believe we can offer the community something entirely new and immensely helpful.\r\n\r\nOur motivation for facilitating this session is to fill a glaring void we have encountered time and time again during our work as Agile Coaches and ScrumMasters. With the introduction of Scrum many companies see very good first results and get curious about deeper self-organization. Most ScrumMasters lack the tools to address this, however, and only focus on making managers relinquish some of their power. But then what? We often see a cycle of too little control and too much control happening in daily interactions - too little structure and then too much structure again. The dream of true self-organization is built on a shaky fundament of ideals, unsupported by the right tools to make it a lasting and productive way of working together. \r\n\r\nWith Liberating Structures it’s possible to include and unleash everybody, make every voice heard and still get amazing results in record time. Liberating Structures introduce tiny shifts to the way people interact in daily life which build the foundation for deeper democratic patterns to emerge. These exercises are easy to learn and use and wicked fun when done correctly.\r\nWe believe deeply in self-organization, but have struggled with successful implementations ourselves. Liberating Structures have been revelatory to us and we would like to share this experience with the wider community, contributing a tiny part towards building a more enjoyable workspace (and finally killing boring meetings in the progress). \r\n\r\nDuring the proposed session we will be using exercises from the Liberating Structures menu exclusively (except for a short introduction) since we want participants to understand how they can transform the way groups interacts. Instead of showing slides about them we will use these exercises to make the effect felt. They are highly interactive, so we expect this session to be extremely immersive and create an immediate a-ha moment in the participants. Novel and innovative solutions will be found together with the attendants, giving us as facilitators the chance to learn something new as well.\r\n\r\nJust to clarify: Liberating Structures have been invented by Keith McCandless and Henri Lipmanowicz. They are absolutely free and available to all. We don’t have any commercial interest and won’t advertise seminars or the like. You can find more information at www.liberatingstructures.com or www.liberatingstructures.fr\r\n\r\nOutline of the Session\r\nWe will start with a Celebrity Interview, where we take a short time to share powerful stories to introduce ourselves as facilitators and give the participants a vision for how Liberating Structures can help teams with their self-organization. \r\n\r\nThen we ask the question “When people fall off the horse (the figurative horse of disciplined self-organization), what are your boldest ideas for getting back on? What is a first step that you could implement right away to achieve this?”. For this we will use 25/10 Crowd Sourcing in combination with 15% Solutions. 25/10 is an exercise which helps to harvest the greatest ideas even in a very large group in a short amount of time. The result will be a list of the top ten ideas from this group complete with the first step towards making this idea real.\r\n\r\nTroika Consulting, a powerful exercise for participants to receive coaching advice from others in groups of three, will help participants expand their ideas of what they can personally do right away to strengthen the self-organization within their teams. \r\n\r\nThe session will end with a debrief using 1-2-4-All. We will reflect on the interaction between the participants in this session and how it differed from the usual interactions in their daily routine.\r\n\r\nCelebrity Interview: Sharing powerful stories to introduce facilitators and give everybody a vision for what Liberating Structures can do - 5 minutes\r\n\r\n25/10 Crowd Sourcing + 15% Solutions: Harvesting the best ideas from the group - 20 minutes\r\n\r\nTroika Consulting: Expanding individual ideas to give everybody a list of personal action items - 15 minutes\r\n\r\n1-2-4-All: Debriefing to summarize what happened during the session, what that means and how we will move forward - 10 minutes \r\n\r\nLearning Objectives\r\nIn this highly interactive session you will see and feel how Liberating Structures - a set of group facilitation tools - foster deep self-organization and help build a culture of shared ownership way beyond your Agile implementation. Join us in surfacing new approaches of how to sustain agile peak experiences and leave with a list of ideas you can implement right away to finally break the cycle of over- and under-control. \r\n\r\nTarget Audience \r\nBeginner\r\n",
        "title": "Empower your team for self-organization – using Liberating Structures",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.649",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f94b",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "contraintes-et-jeux-sociaux-pour-des-dojos-au-top-",
        "speakerIds": [
            "johan.martinsson",
            "bastien.david.info"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Aujourd'hui de plus en plus de devs cherchent à animer leur propre dojo en équipe ou en entreprise. Pas étonnant quand on constate que c'est le moyen de (auto)formation le plus efficace et marrant pour progresser. Mais comment se renouveler et s'assurer que d'avoir un moment de qualité entre devs?\r\n\r\nDeux pratiques commencent à se cristalliser, d'un côté l'utilisation de contraintes pour pousser à sortir de ses habitudes et faire appelle à la créativité, de l'autre côté les jeux sociaux, tels que le randori et le mob-programming pour mentionner les plus courants, pour apprendre des autres et pour s'entrainer à collaborer mieux. \r\n\r\nLes code retreats où les participants font le même algo 7 fois de suite en une journée(!) nous ont montré que ce n'était pas le sujet en lui-même qui était le principal. Les contraintes et les jeux sont la principale source de renouvellement.\r\n\r\nNous ferons un tour des qq contraintes et jeux sociaux intéressants que l'on espère apporteront du nouveau. Nous jouerons certains devant vous pour les rendre vivants et on discute de leur fonctionnement.\r\n",
        "title": "Contraintes et Jeux sociaux pour des dojos au top!",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.65",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f94c",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "kouizz-amann",
        "speakerIds": [
            "cedricbodin"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Kouizz Amann, c'est le Burger Quiz version bretonne : à la fois beurrée et barrée !\r\nCar pour tester vos connaissances sur l'Agilité, autant le faire avec des crêpes et du cœur... surtout dans la capitale de la gastronomie ; )",
        "title": "Kouizz Amann",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.651",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f94d",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "le-focus-votre-meilleur-ennemi",
        "speakerIds": [
            "fchabanois"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Un jour à la cafétaria, mon agenda à bout de bras, j’entends : « Florence, je ne sais pas comment tu fais pour être aussi organisée ». \r\n\r\nAlors comment dire…. « Organisé » n’est pas vraiment la qualité première que mes proches m’associent.\r\n\r\nPar contre, je connais mes « vagues » et en fonction des circonstances, je sors la petite barque ou le paquebot pour naviguer. \r\n\r\nJ’ai réalisé dernièrement que beaucoup ignoraient que rien ne prenait « que 2 minutes » et que même les personnes « interrompus » prenaient en réalité plaisir à être interrompus. Pas tout le temps mais souvent oui.  \r\n\r\nSi vous adorez que votre PO fasse obstacle au reste du monde et aimeriez être plus « protégé »; si au contraire, vous ne comprenez pas les gens qui portent des casques à longueur de journée;  si vous vous demandez pourquoi les projets sortent si peu à temps; \r\n\r\nAlors le sujet du focus peut vous intéresser : quand nous aide-t-il, quand nous nuit-il, comment mieux le maitriser chez nous et respecter ceux des autres pour faire avancer le bateau de votre projet.\r\n",
        "title": "Le focus, votre meilleur ennemi",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.652",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "KEYNOTE_SURPRISE",
        "id": "5c7da825a6d40108c981f94e",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "learning-how-to-learn",
        "speakerIds": [
            "mary"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "This is a \"surprise\" talk. For our keynote we choose the programm for you. You are in a room, and a speaker come to speak about a subject for which you ignore the content. Don't be afraid it's only for 30 minutes. As it's a surprise we don't display the session summary before...   ",
        "title": "A surprise keynote... is a surprise",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.653",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f94f",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "reliability-engineering-the-essential-discipline-for-complex-systems",
        "speakerIds": [
            "mary"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "The days of trying to prevent failures are gone. In today’s high-volume, cloud-based systems, anything that can go wrong will eventually go wrong. It is far better to spend our time engineering fault tolerance than pursuing the impossible goal of fault prevention. Not only is reliability engineering one of the highest paying jobs in software engineering today, it is also a job full of unique challenges that demand creative thinking and problem solving.  \r\nThis talk is about the multiple aspects of reliability engineering that have become critically important as our world has become increasingly dependent on software systems.\r\n",
        "title": "Reliability Engineering – The Essential Discipline for Complex Systems",
        "topic": "team",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.653",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "KEYNOTE_SURPRISE",
        "id": "5c7da825a6d40108c981f950",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "third-place-trajectories",
        "speakerIds": [
            "james.carlson"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "This is a \"surprise\" talk. For our keynote we choose the programm for you. You are in a room, and a speaker come to speak about a subject for which you ignore the content. Don't be afraid it's only for 30 minutes. As it's a surprise we don't display the session summary before...   ",
        "title": "A surprise keynote... is a surprise",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.654",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "KEYNOTE_SURPRISE",
        "id": "5c7da825a6d40108c981f951",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "le-nouveau-flatland",
        "speakerIds": [
            "davidbenque"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Ce talk est une \"surprise\". Pour cette track, nous choisissons le programme pour vous. Vous êtes dans une pièce et un speaker vient parler d'un sujet dont vous ignorez le contenu. N'ayez pas peur, c'est seulement pour 30 minutes. Comme c'est une surprise, nous n'affichons pas le résumé de la session avant ...",
        "title": "A surprise keynote... is a surprise",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.655",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f952",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "utopie-et-bellaminettes",
        "speakerIds": [
            "bruno"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "\"hopepunk\" et positivisme, dans les dessins, \r\nles histoires, et dans la façon de les diffuser. ",
        "title": "Utopie et bellaminettes",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.655",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f953",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "meetings-with-remarkable-trees",
        "speakerIds": [
            "bodil"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Everybody knows the classic cons list. Clojeurs brag about their bitmapped vector tries. Haskell weenies took it up a notch with their impossible finger trees. Rustaceans turned back the clock and gave us simple arrays again.\r\n\r\nAll of these have shortcomings. Hickey tries are magically indexable but the only other thing you can do to them is add things to the end. Finger trees are absurdly flexible but you can't index them efficiently. And so the search goes on...\r\n\r\nAnd today, you're going to learn about the ultimate list data structure: the RRB tree (\"relaxed radix balanced tree\") is an improved version of the tried and tested Hickey trie, which has achieved the impossible: /every/ basic operation is efficient - push and pop on either end, index lookup, split and join. RRB trees pull no punches.\r\n\r\nWatch as Bodil shows you diagrams with brightly coloured boxes in an enthusiastic effort to explain why data structures are amazingly exciting.",
        "title": "Meetings With Remarkable Trees",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.656",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f954",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "machine-learning-in-an-agile-world-keeping-models-fresh-with-continuous-intelligence",
        "speakerIds": [
            "egorcenski"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Increasingly, machine learning is finding its way into production systems. More and more people are learning data science, and AI tools and frameworks are getting better every day. Nevertheless, researching, implementing, deploying, and maintaining a machine learning application is still a challenge, and many struggle to develop AI systems with the same pace, flexibility, and agility that they develop deterministic software and service. In this talk, we'll explore Continuous Intelligence—a set of working principles to keep machine learning models up-to-date and maintainable, including why it is critically important that they are so.",
        "title": "Machine Learning in an Agile World: Keeping Models Fresh with Continuous Intelligence",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.657",
        "description": "",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "KEYNOTE_SURPRISE",
        "id": "5c7da825a6d40108c981f955",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "beyond-ethics-technological-citizenship-in-changing-times",
        "speakerIds": [
            "egorcenski"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "This is a \"surprise\" talk. For our keynote we choose the programm for you. You are in a room, and a speaker come to speak about a subject for which you ignore the content. Don't be afraid it's only for 30 minutes. As it's a surprise we don't display the session summary before...   ",
        "title": "A surprise keynote... is a surprise",
        "topic": "ethics",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.658",
        "description": "Les Raspberry Pi Jams peuvent prendre toutes sortes de tailles et de formes : ateliers pour débutants, sessions de travail sur vos propres projets, des démonstrations, des conférences...\r\nUne Jam rassemble toutes sortes de personnes : certains découvrent les interactions avec des montages électroniques, et d&#39;autres ont des tonnes d&#39;expérience qu&#39;ils sont heureux de venir partager.\r\nLes Jams sont des évènements accueillants où vous pourrez faire des rencontres et apprendre ensemble dans un environnement amical.\r\n\r\nPour son édition 2019, MiXiT a décidé d&#39;héberger une Raspberry Pi Jam.\r\nElle se fera avec l&#39;aide de :\r\n- Alan Mc Cullagh : un passionné dans cet univers de code et d&#39;électronique\r\n- Joshua Lowe : un jeune entousiasthe proposant une solution pour découvrir le code en démarrant par des blocs graphiques pour finir par du code en language python.\r\n- Les Pounder : maker, hacker, formateur, le tout avec passion.\r\n- Thierry Chantier : entre 2 ateliers avec les enfants de MixTeen, il est temps de partager aussi avec les adultes.\r\n\r\nVenez découvrir, discuter, bricoler et coder... Quelque soit le temps que vous avez, nous trouverons de quoi échanger.",
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "WORKSHOP",
        "id": "5c7da825a6d40108c981f956",
        "language": "FRENCH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "raspberry-pi-jam",
        "speakerIds": [
            "tyrower",
            "Joshua.Lowe",
            "lespounder",
            "titimoby"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Raspberry Pi Jam : venez découvrir, discuter, bricoler et coder... \r\nQuelque soit le temps que vous avez, nous trouverons de quoi échanger.",
        "title": "Raspberry Pi Jam",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": "2019-03-04T22:33:57.662",
        "description": null,
        "end": "2019-05-23T09:30:00",
        "event": "2019",
        "format": "TALK",
        "id": "5c7da825a6d40108c981f957",
        "language": "ENGLISH",
        "photoUrls": [],
        "room": "UNKNOWN",
        "slug": "mob-programming-a-whole-team-approach",
        "speakerIds": [
            "Woody.Zuill"
        ],
        "start": "2019-05-23T09:00:00",
        "summary": "Mob Programming is a development practice where the whole team works on the same thing, at the same time, in the same space, and on the same computer. It is a whole-team approach to doing all the work the team does including designing, coding, testing, and working with the customers, users and other stakeholders. This is an evolutionary step beyond pair programming and accentuates face-to-face",
        "title": "Mob Programming: A Whole Team Approach",
        "topic": "team",
        "video": null
    }
]
