[
    {
        "addedAt": [
            2017,
            3,
            29,
            19,
            43,
            15,
            493000000
        ],
        "description": "A l'automne 2011 un petit groupe de citoyens lyonnais eurent l'idée folle de créer une nouvelle monnaie. Quelques années plus tard La Gonette voyait le jour pour inonder les porte monnaies des gones et des fenottes. Mais au fait, a quoi ça sert de créer une monnaie locale?",
        "end": [
            2017,
            4,
            20,
            9,
            50
        ],
        "event": "2017",
        "format": "KEYNOTE",
        "id": "58de4d4b9312a300179a2a77",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "la-naissance-de-la-gonette",
        "speakerIds": [
            "briet.nicolas"
        ],
        "start": [
            2017,
            4,
            20,
            9,
            40
        ],
        "summary": "A l'automne 2011 un petit groupe de citoyens lyonnais eurent l'idée folle de créer une nouvelle monnaie. Quelques années plus tard La Gonette voyait le jour pour inonder les porte monnaies des gones et des fenottes. Mais au fait, a quoi ça sert de créer une monnaie locale?",
        "title": "La naissance de La Gonette",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            782000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            9,
            35
        ],
        "event": "2017",
        "format": "KEYNOTE",
        "id": "58de4d4b9312a300179a2a7f",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "l-orchestre-un-modele-de-gestion-de-groupe-",
        "speakerIds": [
            "samuel.couffignal"
        ],
        "start": [
            2017,
            4,
            20,
            9,
            10
        ],
        "summary": "Passons les portes d'une salle de concert, un orchestre s'installe et joue ; concert merveilleux et instants partagés entre musiciens et public, quelle réussite! Si l'on a idée du travail musical que cela peut susciter (appelons cela la partie artistique et technique), qui soupçonnerait le travail sur la foule de musiciens afin d'en faire une équipe qui s'établira durant l'ensemble des répétitions? Plusieurs heures de répétitions pour 1h30 de musique, autant d'heures permettant une découverte approfondie de l'œuvre, mais également son partage avec un groupe afin d'aller vers un objectif commun: le concert. Ce sont ces heures de répétitions en groupe, cette face immergée de l'iceberg, que nous partagerons ensemble au-cours de cette keynote.",
        "title": "L'orchestre un modèle de gestion de groupe?",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            759000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            18,
            0
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a4d",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "hexagon-challenge",
        "speakerIds": [
            "florent.pellet",
            "clem",
            "epecoul"
        ],
        "start": [
            2017,
            4,
            20,
            10,
            0
        ],
        "summary": "C'est une proposition qui sort un peu du cadre. L'objectif n'est pas d'animer quelque chose juste pendant 110min, mais durant toute la conférence, en parallèle, et donc pas vraiment un workshop.\r\n\r\nHexagon challenge est une sorte de codingame. L'objectif est de développer une AI pour conquérir des terrains. Les différentes AI sont évaluées en se rencontrant. Les participants peuvent ainsi s'amuser en développant et combattant les autres joueurs.\r\nLes règles sont simples et abordables à tout le monde.",
        "title": "Hexagon challenge",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            758000000
        ],
        "description": "Après une introduction rapide du concept et de la technologie sous-jacente, et de la notion d'application décentralisée, nous vous proposons un **atelier pour apprendre à programmer une solution blockchain**, en s'appuyant sur le framework et l'environnement le plus en vogue du moment : **[Ethereum](https://www.ethereum.org/)**.\r\n\r\nVenez donc programmer un jeu simple, de façon décentralisée. A la fin de la séance, vous serez reliés à tous les autres participants au sein de la même blockchain pour participer au jeu de manière collective.\r\n\r\nVous apprendrez à :\r\n* Comprendre les notions de base d'Ethereum.\r\n* Exécuter les commandes Ethereum dans un conteneur (ici [Docker](https://www.docker.com/)).\r\n* Créer un compte et une blockchain de test, démarrer un noeud et miner la blockchain.\r\n* Programmer un \"smart-contract\" en langage [Solidity](http://solidity.readthedocs.io).\r\n* Intégrer un \"smart-contract\" dans une application décentralisée (Dapp) en JavaScript.\r\n\r\n*Pré-requis : ordinateur portable équipé avec VirtualBox v5 et si possible Vagrant (une image de machine virtuelle, comportant tout le matériel nécessaire, sera fournie en séance).*",
        "end": [
            2017,
            4,
            20,
            12,
            0
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a4b",
        "language": "FRENCH",
        "room": "ROOM5",
        "slug": "jouer-et-gagner-en-programmant-une-blockchain-avec-ethereum-et-docker",
        "speakerIds": [
            "philippe.bazart",
            "112455790095465496145"
        ],
        "start": [
            2017,
            4,
            20,
            10,
            10
        ],
        "summary": "Peu connus avant le succès de la cryptomonnaie \"BitCoin\", la technologie **blockchain** et le concept de \"**smart contracts**\" ont maintenant commencé à tracer leur chemin. De nouvelles formes d'organisations distribuées font leur apparition. Et de grandes entreprises, embarquées actuellement dans une phase de numérisation intensive de leurs activités, regardent maintenant avec attention comment exploiter la blockchain, qui pourrait devenir un nouveau modèle disruptif de leurs relations économiques, financières, contractuelles, organisationnelles et de fonctionnement.",
        "title": "Jouer et gagner en programmant une blockchain avec Ethereum et Docker",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            764000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            11,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a53",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "cargo-cult-agile",
        "speakerIds": [
            "1326945522"
        ],
        "start": [
            2017,
            4,
            20,
            10,
            10
        ],
        "summary": "On appelle cargo cult le fait d’imiter des comportements, sans en comprendre le fonctionnement, en espérant obtenir les mêmes résultats.\r\nLes organisations adoptent un framework agile espérant livrer rapidement du logiciel à haute valeur ajoutée. Peut-on parler de cargo cult agile ? Quelles sont les pratiques agiles les plus vulnérables au cargo cult ?\r\nLe cargo cult agile n’est pas une fatalité. Voici mes solutions pour l’éviter.",
        "title": "Cargo cult agile",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            773000000
        ],
        "description": "In our workshop we will teach you how to use these cards, by giving you different assignments in small groups. Most importantly: this means you are going to to tell test stories. We are convinced that every tester has had interesting experiences, that deserve to be told and shared. After telling each other these stories, you can start to discuss the content of the story and the performance of the storyteller:\r\nDo you have similar experiences? \r\nWould you do something differently?\r\nDo you have a challenging question?\r\nHow can the story be told in a more captivating way?\r\n\r\nAfter you finished the discussion, you can reward each other by giving a small gift in the form of a sticker to show your appreciation of sharing a story and insights. \r\nContent is vital, but it is also important to look at your performance: “how to improve your storytelling”. A good story is priceless: It can help you convince your manager or drive home your point in a coaching session. In our workshop it is crucial that you give each other feedback on how to tell a good story.\r\n\r\nCompleting the workshop, you will have done many interesting activities: you’ll have heard and told lots of stories and have received feedback on how to narrate a great story. Maybe you were rewarded for your positive participation. Challenge yourself and your test colleagues by telling interesting test stories and who knows; maybe you can help us to finish our quest by performing for us: The Ultimate Test Story.\r\n\r\nStay awhile and listen. For the best place by the fire, is kept for,... the storyteller.",
        "end": [
            2017,
            4,
            20,
            12,
            0
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a66",
        "language": "ENGLISH",
        "room": "ROOM4",
        "slug": "the-quest-for-the-ultimate-test-story",
        "speakerIds": [
            "ard.kramer",
            "s_colson",
            "testeacher"
        ],
        "start": [
            2017,
            4,
            20,
            10,
            10
        ],
        "summary": "Good stories last: They release emotions, they have their own life, they make you proud and they can help you inform and move others. This is why we embarked on our quest: the quest for the Ultimate Test Story! We set forth to scour the earth in search of testers. Testers with interesting experiences and crazy stories to tell, but not having the words to bring them to life. Our weapon of choice: Test Sphere. A deck of hundred cards that inspires and supports these testers to craft, temper and shape their raw experiences into strong, red-hot stories of power.",
        "title": "The Quest for the Ultimate Test Story",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            776000000
        ],
        "description": "Ce talk vous présentera, benchmark à l’appuie, différentes bibliothèques scala et python proposant des fonctionnalités de prétraitement, de calcul scientifique ou encore de machine learning, afin de vous guider dans votre sélection d’outils pour la data-science.\r\n\r\nNous allons comparer les bibliothèques Saddle, Smile, Breeze et Spark Mllib qui profitent de l’aspect fonctionnel de scala et de ses prédispositions à la scalabilité, avec les bibliothèques Pandas, Scipy, StatsModels et Scikit-Learn, qui permettent un développement rapide et flexible en python, pour être plus confiant dans le choix de l'outil le plus adapté à votre projet.",
        "end": [
            2017,
            4,
            20,
            11,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a6f",
        "language": "FRENCH",
        "room": "ROOM2",
        "slug": "quelles-bibliotheques-choisir-pour-votre-projet-data-science-that-s-the-question-",
        "speakerIds": [
            "anastasia.lieva"
        ],
        "start": [
            2017,
            4,
            20,
            10,
            10
        ],
        "summary": "Des plus en plus de sociétés souhaitent intégrer de la data-science dans leurs projets. Difficile de ne pas se sentir perdu au milieu des nombreuses bibliothèques proposées, et il est encore plus difficile de sélectionner la librairie qui correspond le mieux à nos besoins métiers.",
        "title": "Quelles bibliothèques choisir pour votre projet data-science ? That's the question!",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            780000000
        ],
        "description": "L'objectif de cet atelier est de se faire une idée concrète du \"Jenkins moderne\" par la pratique plutôt que par du marketing.\r\n\r\nNous réaliserons ensemble un \"Pipeline\" de livraison continue basé sur du Jenkins moderne. Au menu:\r\n* Intégration avec Git\r\n* Configuration de l'environnement de build\r\n* Compilation\r\n* Tests & rapports\r\n* Visualisation\r\n* Déploiement et interaction avec les Ops\r\n\r\nDes environnements hébergé dans Amazon seront disponibles par défaut (Navigateur Web HTML5 requis).\r\n\r\nDes machines VirtualBox seront disponibles localement, en secours si l'internet est défaillant (et afin de vous permettre de rejouer l'atelier après la conférence).",
        "end": [
            2017,
            4,
            20,
            12,
            0
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a7a",
        "language": "FRENCH",
        "room": "ROOM3",
        "slug": "jenkins-moderne-et-livraison-continue-ecrivons-ensemble-des-pipeline-declaratifs-pour-votre-application",
        "speakerIds": [
            "DamienDuportal"
        ],
        "start": [
            2017,
            4,
            20,
            10,
            10
        ],
        "summary": "Le projet Jenkins tente cette année 2017 de rattraper son retard : \r\n* Une nouvelle interface graphique \"BlueOcean\" (réécriture de zéro en ReactJS), \r\n* Des nouveaux Pipelines Déclaratifs (plus de Groovy à apprendre, accès facile aux débutants), \r\n* Une (ré)adaptation aux pratiques récentes (Git/Github flows, collaboration, DevOps, Docker).\r\n\r\nQu'en est-il réellement ? (SPOILER alerte: je travaille pour CloudBees, mais adore utiliser Travis et GitLab CI).",
        "title": "Jenkins Moderne et Livraison Continue: écrivons ensemble des Pipeline Déclaratifs pour votre application",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            782000000
        ],
        "description": "Topics we will see:\r\n* Brief History of Rust - how did the project get started, main goals, first stable releases.\r\n* Main types and Functions - writing a very basic code and a deep comparison between Java style and Rust style. The level of verbosity is similar; however, the way you explicit the types may be different.\r\n* Structs and Traits, contrasting them with Interfaces and Abstract Classes in Java.\r\n* Lifetime vs GC - how can we remove objects from the memory without a GC? An interesting alternative approach from Rust to Java's GC. We will show the good and the complicated parts.\r\n* Notes about the compiler",
        "end": [
            2017,
            4,
            20,
            11,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a80",
        "language": "ENGLISH",
        "room": "AMPHI2",
        "slug": "rust-for-java-developers",
        "speakerIds": [
            "hanneli.tavante"
        ],
        "start": [
            2017,
            4,
            20,
            10,
            10
        ],
        "summary": "A quick introduction to the Rust Language. Code comparisons between Java and Rust, compiler features, type system, environment and integrating the two languages.",
        "title": "Rust for Java developers",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            784000000
        ],
        "description": "C'est de là qu'est né Elm, un langage fonctionnel qui se compile en JavaScript et qui certifie l'absence d'erreurs au runtime (fini les undefined is not a function!), dont les messages d'erreur à la compilation sont limpides et les performances excellentes. En court : si ça compile, c'est que ça marche !\r\n\r\nJe vous propose de découvrir ce qui fait de ce langage l'un des plus productifs et confortables que j'ai pu utiliser à travers sa syntaxe, et je vous montrerai ensuite qu'il est extrêmement simple d'ajouter progressivement des briques Elm à une application JavaScript standard ! Nous finirons enfin par un live-coding pour mettre en pratique ces connaissances nouvellement acquises.",
        "end": [
            2017,
            4,
            20,
            11,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4c9312a300179a2a83",
        "language": "FRENCH",
        "room": "ROOM1",
        "slug": "un-language-que-tout-le-monde-elm",
        "speakerIds": [
            "2827211758"
        ],
        "start": [
            2017,
            4,
            20,
            10,
            10
        ],
        "summary": "Depuis quelques années, de nombreux outils sont apparus pour nous permettre de structurer au mieux nos applications front-end. Des bibliothèques, comme React, des architectures de gestion d'états, comme Redux, et même des surcouches au langage comme TypeScript.\r\n\r\nEt si nous pouvions repenser JavaScript de zéro, et créer un langage adapté au développement web tel qu'on le pratique aujourd'hui, en tenant compte de toutes ces bonnes pratiques découvertes sur la route ?",
        "title": "Un language que tout le monde Elm",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            758000000
        ],
        "description": "Au cours de cette présentation, nous allons revenir sur les raisons du succès grandissant d’Electron et passerons en revue tout ce qu’il offre en matière de packaging, de mises à jour automatiques et de stratégies de testing au travers du livecoding d’une application meme generator.",
        "end": [
            2017,
            4,
            20,
            12,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a4c",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "developpez-des-applications-web-desktop-avec-electron-de-github",
        "speakerIds": [
            "eric.briand",
            "yvonnick.frin"
        ],
        "start": [
            2017,
            4,
            20,
            11,
            10
        ],
        "summary": "D’un côté, nous avons la communauté web qui maintient un écosystème riche permettant de construire des interfaces utilisateurs rapidement. De l’autre côté, l’écosystème desktop possède des outils très performants mais qui demandent beaucoup d’investissement. Github s’est retroussé les manches pour tirer le meilleur des deux mondes et a créé Electron ! Electron, c’est la possibilité de construire des applications grâce aux composants web tout en profitant des interactions riches avec la machine d’une application desktop.",
        "title": "Développez des applications web desktop avec Electron de Github",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            774000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            12,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a69",
        "language": "FRENCH",
        "room": "ROOM2",
        "slug": "gamification-jouer-pour-apprendre",
        "speakerIds": [
            "114977533288635941721"
        ],
        "start": [
            2017,
            4,
            20,
            11,
            10
        ],
        "summary": "Les bénéfices du jeu pour les enfants n'est plus à démontrer: développant l'imagination et permettant la confrontation au monde réel, il encourage leur développement. Souvent à l'âge adulte celui ci est plus mal perçu, vu comme une perte de temps. Et si les bienfaits du jeux pouvaient nous servir à tout âge comme un outil d'apprentissage?",
        "title": "Gamification: Jouer pour Apprendre",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            781000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            12,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a7c",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "spring-boot-2",
        "speakerIds": [
            "snicoll"
        ],
        "start": [
            2017,
            4,
            20,
            11,
            10
        ],
        "summary": "La nouvelle génération de Spring Framework sera bientôt disponible ! Pour fonctionner sur Spring 5, les applications devront respecter de **nouveaux pré-requis** (versions minimales de JDK, conteneurs, libraries...). En contrepartie, vous pourrez vous préparer à l'arrivée de **JDK9**, profiter du **support de Kotlin** et même du nouveau **Spring WebFlux**. Cette session explique comment ces fonctionnalités sont intégrées dans Spring Boot 2, disponible cet automne.",
        "title": "Spring Boot 2",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            781000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            12,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a7d",
        "language": "FRENCH",
        "room": "ROOM1",
        "slug": "il-est-temps-de-repenser-notre-maniere-de-travailler-",
        "speakerIds": [
            "mcpaccard"
        ],
        "start": [
            2017,
            4,
            20,
            11,
            10
        ],
        "summary": "Le travail fait partie intégrante notre vie, à tel point que tout ce qui se passe en dehors devient presque anecdotique. Des hobbies, nous n'avons plus besoin : le travail est censé nous nourrir intellectuellement et nous offrir tout ce dont nous avons besoin pour nous épanouir. Mais que se passe-t-il quand il ne remplit plus cette mission, quand il ne nous nourrit plus, au propre comme au figuré ? Je vous propose une réflexion sur le travail, son histoire, le mal qu'il nous fait aujourd'hui et des pistes pour enfin le réadapter à l'humain. Entre autres sujets, nous parlerons burnout, entreprise libérée, taylorisme, sociologie, bien-être au travail, revenu inconditionnel de base, etc.",
        "title": "Il est temps de repenser notre manière de travailler !",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            787000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            13,
            40
        ],
        "event": "2017",
        "format": "KEYNOTE",
        "id": "58de4d4c9312a300179a2a8e",
        "language": "FRENCH",
        "room": "AMPHI1",
        "speakerIds": [
            "guillaume.champeau"
        ],
        "start": [
            2017,
            4,
            20,
            13,
            15
        ],
        "summary": "Les développeurs ne sont pas des machines qui programment d'autres machines, mais bien des hommes et des femmes doués de conscience dont les lignes de code qu'ils produisent peuvent avoir un impact important sur la société. Quelles sont les règles en matière d'éthique pour les développeurs et les startupers ? L'éthique est-elle un obstacle à la croissance d'une entreprise ? Cette keynote apportera des éléments de réflexion en s'intéressant, en particulier, au traitement des données personnelles des utilisateurs.",
        "title": "Quelle éthique pour les développeurs ?",
        "topic": "hacktivism",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            752000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            14,
            0
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4b9312a300179a2a47",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "la-marque-est-morte-vive-l-intelligente-artificielle-",
        "speakerIds": [
            "115190943418300876553"
        ],
        "start": [
            2017,
            4,
            20,
            13,
            40
        ],
        "summary": "Le monde a toujours été « Marqué ». \r\nDu nombre de pois sur les ailes du papillon Monarque au bande du tigre du bengal, ce système de «marques distinctives» a permis d’organisé la complexité de notre monde. Mais vers 2014, les choses se troublent. \r\nL’idée de Marque évolue avec l’arrivée de dispositifs comme Amazon Echo avec reconnaissance vocale soutenus par un AI incroyablement intelligent.\r\nLa Marque connaît un changement de paradigme.\r\nElle n’est plus juste un symbole, un signe. Elle n’est même pas une voix. Elle est devenue une entité intelligente, une personnalité, un algorithme capable d’apprendre.\r\nComment «Marqué» une intelligence artificielle ?\r\nQuel type de relation allons-nous avoir maintenant avec la Marque ?\r\nDeviendrons-nous des consommateurs complètements manipulés par la Marque ? \r\nLa Marque va-t elle tout simplement devenir notre meilleur ami?",
        "title": "La Marque est morte. Vive l’Intelligente Artificielle.",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            759000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            14,
            0
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4b9312a300179a2a4e",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "travailler-autrement",
        "speakerIds": [
            "florent.pellet",
            "clem"
        ],
        "start": [
            2017,
            4,
            20,
            13,
            40
        ],
        "summary": "Depuis plus d’un siècle, la société exhibe et encourage presque qu’une seule façon de travailler, c’est à dire 5j/5, 220 jours/an, avec un lien de subordination. Et cela alors que notre société est en pleine mutation. Qui rêve par exemple de travailler pour une seule société toute sa vie ?\r\nN’avons-nous pas mélangé l’objectif et le moyen pour y parvenir ?\r\nPeut être que vous souhaitez travailler moins, sur d’autres sujets, pour des clients correspondant mieux à votre éthique, être nomade…autant de façons de travailler, de vivre que d’individus, pourquoi voudrions-nous tous le même mode de vie ?\r\nCeci n’est pas réservé aux bisounours mais accessible à n’importe qui, encore plus pour les développeurs.\r\n\r\nDurant ce talk, nous aimerions vous faire réfléchir et envisager une remise en question de votre façon de travailler.",
        "title": "Travailler autrement",
        "topic": "hacktivism",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            769000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            14,
            0
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4b9312a300179a2a5e",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "probabilistic-programming-tuer-un-pieton-ou-sacrifier-les-passagers-",
        "speakerIds": [
            "didier.girard"
        ],
        "start": [
            2017,
            4,
            20,
            13,
            40
        ],
        "summary": "La programmation probabiliste crée des systèmes qui prennent des décisions à partir d'observations dont la certitude n'est pas garantie. Bien qu'encore peut développée, ce type de programmation va être une pièce essentielle des outils basés sur la composition d'algorithmes de machine learning.",
        "title": "Probabilistic Programming : Tuer un piéton ou sacrifier les passagers ?",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            776000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            14,
            0
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4b9312a300179a2a6d",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "la-mafia-lactee-au-travail",
        "speakerIds": [
            "tut_tuuut",
            "mere-teresa"
        ],
        "start": [
            2017,
            4,
            20,
            13,
            40
        ],
        "summary": "Les statistiques françaises d'allaitement maternel à 6 mois sont bien tristounes. Une grande majorité des femmes cesse l'allaitement à contrecœur au retour au travail après le congé maternité, et c'est dommage. (L'OMS préconise un allaitement maternel exclusif jusqu'à 6 mois, et open bar jusqu'aux 2 ans de l'enfant !) Avec quelques informations et un peu d'organisation, dans les conditions relativement favorables de l'IT, on devrait pouvoir améliorer les choses…\r\n\r\nQue pouvez-vous faire, *vous* ? Réflexions et retour d'expérience de deux mères (5 enfants en tout) sur l'allaitement au travail.",
        "title": "La mafia lactée au travail",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            778000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            14,
            0
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4b9312a300179a2a74",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "50-ans-de-programmation-toujours-vivant-",
        "speakerIds": [
            "110883641223381082460"
        ],
        "start": [
            2017,
            4,
            20,
            13,
            40
        ],
        "summary": "Programmer laisse-t-il des séquelles ? Pas nécessairement, mais des souvenirs, c'est sûr ! L'auteur nous raconte son passé de programmeur, et égrène quelques anecdotes d'une préhistoire héroïque, où Windows n'existait pas encore, mais où tout n'était pas rose pour autant...",
        "title": "50 ans de programmation, toujours vivant !",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            780000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            14,
            0
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4b9312a300179a2a79",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "le-logiciel-libre-et-leurs-communautes-peuvent-ils-contribuer-a-un-monde-meilleur-",
        "speakerIds": [
            "alexis.duque"
        ],
        "start": [
            2017,
            4,
            20,
            13,
            40
        ],
        "summary": "En 2014, en participant au programme Google Summer Code, j’ai eu l’opportunité de rejoindre la communauté du projet OpenMRS.\r\n\r\nOpenMRS est une plateforme de collecte de données médicales (EMR), libre, gratuite et utilisées dans de nombreux pays du tiers monde. L’origine de ce projet remonte à 2004, pour améliorer la lutte contre le SIDA en Afrique subsaharienne. Plus de dix ans après, le projet rassemble une communauté de près de 150 contributeurs actifs et 3000 utilisateurs dans le monde.\r\n\r\nLa nature humanitaire de ce projet, m'a poussé à me questionner sur l’impact et l’influence qu’un tel projet, et plus généralement les logiciels libres pouvaient avoir sur la société et le monde actuel. L'objectif de ce talk est donc de partager cette experience et  de suciter votre reflexion  !",
        "title": "Le logiciel libre et leurs communautés peuvent-ils contribuer à un monde meilleur ?",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            784000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            14,
            0
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4c9312a300179a2a85",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "developpeur-sans-domicile-fixe",
        "speakerIds": [
            "vinyll"
        ],
        "start": [
            2017,
            4,
            20,
            13,
            40
        ],
        "summary": "Les anciens modèles nous proposaient d’habiter à proximité de notre lieu de travail.\r\nL’Internet a créé le bouleversement et rendu nos bureaux virtuels, notre entreprise dématérialisée.\r\nOù habiter lorsqu’on a la vastitude du monde ouverte devant soi ?\r\n\r\nÊtre citoyen de l’univers numérique peut se transcender dans la vie réelle.\r\nOn troque alors les embouteillages pour les voyages, le bureau pour les lieux ouverts, la possession pour la liberté.\r\n\r\nLe “Digital Nomad” poussé à son extrême ne parle plus d’un domicile fixe, mais de lieux d’habitations éphémères.\r\nDes lieux de vie nouveaux et des paysages changeant, une vie sans routine dans un quotidien qui vient unifier vies professionnelle et personnelle.\r\n\r\nAprès avoir gouté à ce mode de vie, j’ai quitté la notion de “logement” il y a 3 ans.\r\nDifficile d’envisager la vie autrement quand tout est devenu possible.",
        "title": "Développeur sans domicile fixe",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            730000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            15,
            50
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a42",
        "language": "FRENCH",
        "room": "ROOM5",
        "slug": "sensibilisation-aux-bonnes-pratiques-techniques-du-software-craftsmanship-lego-a-la-rescousse-",
        "speakerIds": [
            "alice.barralon",
            "191394821"
        ],
        "start": [
            2017,
            4,
            20,
            14,
            0
        ],
        "summary": "Pour créer demain un code de qualité, venez (re)découvrir les bases des pratiques techniques du Software Craftsmanship de manière ludique !\r\nChers gens du métier, venez découvrir la vie d'un développeur agile.\r\nChers développeurs, venez pratiquer l'eXtreme LegoBuilding avec le framework LegoUnit !",
        "title": "Sensibilisation aux bonnes pratiques techniques du Software Craftsmanship : Lego® à la rescousse !",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            765000000
        ],
        "description": "L'objectif de notre atelier est d'expérimenter le design thinking sur un cas concret pour en comprendre le sens, la valeur ajoutée et les spécificités de chacune des étapes. Nous n'avons pas inventé cet atelier, nous animerons le \"design thinking workshop\" mis au point par l'université de Standford. Il vous sera proposé d’expérimenter chaque étape du design thinking à travers l’expérience d’offrir des cadeaux.\r\n\r\nA la fin de notre atelier, vous vous serez appropriés les notions du design thinking grâce à la pratique et aux moments de débrief. Vous aurez vécu un moment d'intelligence collective. \r\n\r\nNotre promesse : vous faire tout comprendre en moins de 2h et avec zéro slides !",
        "end": [
            2017,
            4,
            20,
            15,
            50
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a56",
        "language": "FRENCH",
        "room": "ROOM3",
        "slug": "offrez-vous-une-experience-de-design-thinking",
        "speakerIds": [
            "marine.cloux",
            "sylvia.cohen"
        ],
        "start": [
            2017,
            4,
            20,
            14,
            0
        ],
        "summary": "Design Thinking, Pensée Design : vous êtes de plus en plus nombreux (ou pas ?) à avoir entendu parler de ce mode d’application des outils de conception utilisés par les designers pour résoudre une problématique d’innovation.\r\n\r\nMais qu'est-ce qui rend le design thinking si attrayant ?",
        "title": "Offrez-vous une expérience de design thinking",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            770000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            15,
            50
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a60",
        "language": "FRENCH",
        "room": "ROOM4",
        "slug": "conquerir-le-monde-avec-coreos",
        "speakerIds": [
            "116929121394158032970",
            "antoine.stalin"
        ],
        "start": [
            2017,
            4,
            20,
            14,
            0
        ],
        "summary": "Sur le fond d'un star wars camp, nous vous proposons de réaliser le plus grand cluster de CoreOs jamais créé ! Un peu d'Ansible par ci et un peu de Fleet par la, et nous voici avec une armée de Docker à disposition !\r\n\r\nEt si les Ewok prenaient le pouvoir et installaient Kubernetes pour remplacer Fleet sur ce CoreOs que se passerait il ?\r\n\r\nRejoignez cette expérience XXL.",
        "title": "Conquérir le monde avec CoreOs",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            773000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            14,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a68",
        "language": "FRENCH",
        "room": "AMPHI2",
        "slug": "css-is-awesome-",
        "speakerIds": [
            "igor.laborie"
        ],
        "start": [
            2017,
            4,
            20,
            14,
            0
        ],
        "summary": "Non, le CSS c’est pas du coloriage !\r\n\r\nLa puissance du CSS est souvent sous-estimée, cette session de Live-Coding sera l’occasion de montrer quantité de trucs et astuces utiles quotidiennement pour les développeurs web.\r\n\r\nAujourd’hui on entre dans l’ère post-IE et on peut utiliser beaucoup plus sereinement la puissance que nous offre le CSS; pourquoi passer à coté !\r\n\r\nEn mode ‘no-javascript’ venez découvrir des solutions pour faire des : collapsibles panels, accordions, compteurs, popovers, modals, tabs, …",
        "title": "CSS is Awesome!",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            785000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            14,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4c9312a300179a2a86",
        "language": "FRENCH",
        "room": "ROOM2",
        "slug": "des-robots-qui-s-adaptent-a-leur-environnement",
        "speakerIds": [
            "stephane.doncieux"
        ],
        "start": [
            2017,
            4,
            20,
            14,
            0
        ],
        "summary": "Les robots sont de plus en plus présents, que ce soit pour réaliser\r\ndes tâches répétitives ou pour nettoyer le sol ou une piscine. Loin\r\ndes robots de science fiction, ces robots modernes sont parfois dotés\r\nde capacités surpassant celle des humains, mais il s'agit avant tout\r\nde super-spécialistes incapables de faire face à une situation non\r\nprévue par leur concepteur. Les humains et les animaux disposent donc\r\nde capacités d'adaptation encore hors d'atteinte en robotique. Les\r\nchercheurs s'intéressent à la biologie et à la psychologie pour\r\ndépasser ces limites et développer des robots qui, à terme, pourraient\r\nintervenir dans notre environnement quotidien. La robotique\r\ndéveloppementale vise à permettre aux robots d'apprendre de leurs\r\ninteractions avec l'environnement. Nous verrons les questions que cela\r\npose et les approches développées, notamment dans le cadre du projet\r\nEuropéen [DREAM](http://robotsthatdream.eu/).",
        "title": "Des robots qui s'adaptent à leur environnement",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            787000000
        ],
        "description": " La compréhension des cadences apporte des éléments de réponse aux questions suivantes (entre autres) :\r\n\r\n* Faut-il caler la production des user stories sur le calendrier des sprints, sur le release plan ? Y a-t-il d’autres possibilités intéressantes à explorer ? \r\n* Comment et quand intégrer les différents types de test au flux des travaux ?\r\n* À quel rythme faut-il livrer en production ? La question se pose-t-elle encore si vous utilisez une approche “continuous delivery” ?\r\n* Vous devez déjà avoir entendu parlé du fameux “rythme soutenable” nécessaire à la réussite d’un projet agile dans la durée. En théorie c’est très simple, mais en pratique, comment déterminer ce fameux rythme ?\r\n\r\nEt il y en a même qui pensent qu’avec de bonnes cadences on peut fluidifier l’ensemble des travaux à réaliser, de la collecte des besoins jusqu’au déploiement, s’affranchir des itérations et réussir un passage au Continuous Delivery !!",
        "end": [
            2017,
            4,
            20,
            14,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4c9312a300179a2a8a",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "trouvez-vos-cadences-et-faite-un-pas-vers-le-continuous-delivery",
        "speakerIds": [
            "anne.gabrillagues"
        ],
        "start": [
            2017,
            4,
            20,
            14,
            0
        ],
        "summary": "Cette session vous emmènera à la découverte de la notion de **cadence**,  celle qui rythme les activités des équipes, quelle que soit l’approche utilisée, du cycle en V au continous delivery en passant par Scrum et Kanban.",
        "title": "Trouvez vos cadences, et faite un pas vers le Continuous Delivery",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            788000000
        ],
        "description": "Topics we will cover: \r\n* Why Type Theory? \r\n* Quick introduction to logic\r\n * Where are those concepts used? \r\n* An analysis of Java Type System",
        "end": [
            2017,
            4,
            20,
            14,
            40
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4c9312a300179a2a8c",
        "language": "ENGLISH",
        "room": "ROOM1",
        "slug": "notes-on-type-theory-for-absolute-beginners",
        "speakerIds": [
            "hanneli.tavante"
        ],
        "start": [
            2017,
            4,
            20,
            14,
            0
        ],
        "summary": "One important subject we analyse in languages is its type system. Having a general overview of a type system provides information about the language structure, possible optimisations and may help us to understand how statements are evaluated. Those are topics that we shall consider for when creating a new project. This talk will provide a gentle introduction to type theory, explaining step by step how we transform source code into logical statements. ",
        "title": "Notes on Type Theory for absolute beginners",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            766000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            15,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a58",
        "language": "FRENCH",
        "room": "ROOM1",
        "slug": "how-to-become-a-good-open-source-contributor-in-1-hour",
        "speakerIds": [
            "simonbasle"
        ],
        "start": [
            2017,
            4,
            20,
            15,
            0
        ],
        "summary": "Etes-vous utilisateur de projets open source? Très probablement... Mais avez-vous déjà songé à sauter le pas et devenir contributeur? La démarche peut être difficile pour plusieurs raisons: vous ne savez pas par où commencer, vous vous dites \"personne ne voudra de mes contributions\", vous avez déjà proposé des patchs mais vous voulez augmenter vos chances ou devenir un meilleur contributeur... Et si vous avez vous même démarré un projet open source, peut-être vous demandez-vous comment mieux le gérer, être plus encourageant envers les contributions? Ce talk vous montrera avec humour que participer à l'open source et devenir un *bon* contributeur n'est pas si difficile.",
        "title": "How to become a good Open Source contributor in 1 hour",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            772000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            15,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a64",
        "language": "FRENCH",
        "room": "ROOM2",
        "slug": "vers-une-revolution-entrepreneuriale-de-l-effet-de-mode-a-la-realite-des-enjeux-et-des-pratiques",
        "speakerIds": [
            "jean-michel.degeorge"
        ],
        "start": [
            2017,
            4,
            20,
            15,
            0
        ],
        "summary": "Terme polysémique, l’entrepreneuriat reflète plusieurs réalités. Au-delà de l’effet de mode, les pays et les cultures proposent différentes acceptions, de la création d’entreprise à la start-ups … au développement de l’esprit d’entreprendre. Depuis la troisième révolution industrielle et l’apparition de l’ère du numérique, nous assistons à une véritable transformation de notre société. Ces mutations profondes ont fait apparaître de nouvelles attentes, au niveau économique et social. Ainsi, l’entrepreneuriat est devenu une préoccupation partagée répondant à de multiples enjeux (croissance économique, création d’emplois, insertion sociale, réalisation  de soi …) et semble paré de multiples vertus : créativité, innovation, sens de l’initiative, flexibilité … \r\nAu-delà des domaines d’activités, se pose la question de la création et de la croissance des jeunes entreprises, technologiques ou non. Au niveau technologique, la croissance des start-ups numériques est essentielle et concerne également les mutations du parc d’entreprises existantes (les PME/PMI représentent la grande majorité des entreprises). Le virage numérique permettrait d'apporter un demi-point de croissance annuel au PIB français. Accompagner les start-ups permet de marquer la rencontre entre l’innovation et certains attributs de l’esprit d’entreprendre (acceptation de l’échec, droit à l’erreur, valorisation financière de la prise de risque …). Des mesures sont mises en place afin de favoriser la création de start-ups, mais également d’inciter les particuliers à investir ou développer le financement participatif. Des outils juridiques (par exemple le statut de SCOP) se développent conjointement à l’évolution des besoins et des attentes des créateurs (impact de la génération, notamment Y et Z). Les approches afin d’accompagner ces mouvements de fonds évoluent également. Loin de l’approche classique déterministe et prévisionniste (rédaction d’un business plan), les processus de construction itératifs et effectuals permettent de se concentrer sur la valeur (lean start-up, nouveaux business model …). \r\nA partir d’une approche historique, nous proposons d’aborder l’entrepreneuriat à partir de son écosystème, en précisant les différents enjeux (notamment au regard du développement de la technologie et de l’innovation), les modalités de mise en œuvre (et les outils) et la place essentielle de l’individu créateur ou dirigeant.",
        "title": "Vers une révolution entrepreneuriale - De l’effet de mode à la réalité des enjeux et des pratiques",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            779000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            15,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a78",
        "language": "FRENCH",
        "room": "AMPHI2",
        "slug": "l-agilite-un-anarchisme-incompatible-avec-l-entreprise-",
        "speakerIds": [
            "fabien.maury",
            "olivier.my"
        ],
        "start": [
            2017,
            4,
            20,
            15,
            0
        ],
        "summary": "L'agilité ne fais pas toujours bon ménage avec la culture d'entreprise. Si certaines entreprises réforment totalement leur culture pour adopter l'agilité, il arrive aussi que ce soit l'agilité qui soit vidée de sa substance pour cohabiter avec la culture existante.\r\nà travers un voyage au cœur de l'anarchisme et de ses valeurs (l'auto-organisation, l'adaptation au changement, la responsabilisation de chacun et le refus du dogmatisme ) nous retrouverons le chemin du manifeste agile afin d'expliquer cette rupture qu'a apporté l'agilité et pourquoi elle fait débat ici ou là, quand pour certains elle n'est que pure raison.",
        "title": "L'agilité, un anarchisme incompatible avec l'entreprise ?",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            785000000
        ],
        "description": "We'll talk strategy: what we think our industry needs at large and how we are going to fit Kotlin into this picture. \r\nWe'll talk tactics: how we deal with legacy and compatibility issues, and whether there will ever be Kotlin 2.0.\r\nWe'll talk operations: can we do “continuous delivery” for language features? Or, more generally, how agile can language development be?",
        "end": [
            2017,
            4,
            20,
            15,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4c9312a300179a2a90",
        "language": "ENGLISH",
        "room": "AMPHI1",
        "slug": "the-future-of-kotlin-how-agile-can-language-development-be-",
        "speakerIds": [
            "andrey.breslav"
        ],
        "start": [
            2017,
            4,
            20,
            15,
            0
        ],
        "summary": "A successful project usually grows, and Kotlin is no exception. We are adding new targets (JavaScript and Native) and new computation models (coroutines). This talk is about our vision of the future of Kotlin as a language and a ecosystem.",
        "title": "The Future of Kotlin: How agile can language development be?",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            760000000
        ],
        "description": "Autour d’un plateau représentant la chaîne de production du magazine, vous expérimenterez la gestion de flux, en respectant les contraintes du système et en faisant de votre mieux pour vous adapter aux aléas du quotidien.\r\n\r\nCet atelier comprend un debrief ayant pour but de présenter les principes Kanban, notamment en lien avec ce qui aura été vécu lors de la session et se clôturera par une session de questions / réponses.\r\n\r\nCette expérience ludique a pour objectif :\r\n* de faire émerger les pratiques collaboratives au sein de l’équipe,\r\n* de toucher du doigt des concepts comme le coût du délai ou encore l’allocation de capacité,\r\n* d’expérimenter les bénéfices de l’approche de conduite du changement par les processus Kanban.",
        "end": [
            2017,
            4,
            20,
            18,
            0
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a4f",
        "language": "FRENCH",
        "room": "ROOM4",
        "slug": "a-la-decouverte-de-kanban-avec-kanbanzine-",
        "speakerIds": [
            "anne.gabrillagues",
            "arnaudG"
        ],
        "start": [
            2017,
            4,
            20,
            16,
            10
        ],
        "summary": "Cet atelier vous permettra de découvrir Kanban dans un contexte ludique. Vous y incarnerez un membre de l’équipe de rédaction d’un nouveau magazine hebdomadaire. Votre mission est simple : après une dernière édition ayant eu des résultats catastrophiques, vous êtes missionnés par la Direction pour redresser la situation en publiant chaque semaine une édition remportant toujours plus de succès.",
        "title": "À la découverte de Kanban avec Kanbanzine !",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            764000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            17,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a54",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "apprendre-a-apprendre-",
        "speakerIds": [
            "lvictorino"
        ],
        "start": [
            2017,
            4,
            20,
            16,
            10
        ],
        "summary": "Un échec scolaire, beaucoup d’amertume vis à vis du système éducatif classique, et le gout pour la vengeance, c’est le parcours un peu chaotique dont je suis issu et qui m’a forgé une solide envie de partager mes connaissances en programmation.\r\n\r\nVoilà comment un programmeur lambda de jeu vidéo se retrouve à essayer d’enseigner la programmation à des classes de 35+ élèves post-ados d’une formation très éloignée de la matière qui savent à peine lire une consigne. Retour sur trois années où j’ai autant enseigné qu’appris. \r\n\r\n**La suite va vous étonner.**",
        "title": "Apprendre à apprendre.",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            767000000
        ],
        "description": "**Au programme :**\r\n\r\n- Un peu de théorie avec quelques slides pour avoir les idées bien en place ;-)\r\n- Beaucoup de pratique avec :\r\n    - *Composition* de l'application de base\r\n    - Injection de dépendances\r\n    - Observables avec RxJS et Http\r\n    - WebSockets avec socket.io\r\n\r\nL'atelier est organisé de façon didactique et découpé en plusieurs étapes progressives. La correction de chaque étape est disponible pour permettre la progression en cas de blocage. Nul besoin de connaître Angular mais de bonnes connaissances en JavaScript (ES2015+) ou TypeScript seront utiles.\r\n\r\n**Pré-requis :**\r\n\r\n- Git\r\n- Node 7+ / npm 3.10.x\r\n- Votre éditeur de code préféré (je conseille **Visual Studio Code** pour le support TypeScript)",
        "end": [
            2017,
            4,
            20,
            18,
            0
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a59",
        "language": "FRENCH",
        "room": "ROOM3",
        "slug": "hands-on-angular-let-s-chat-",
        "speakerIds": [
            "npayot"
        ],
        "start": [
            2017,
            4,
            20,
            16,
            10
        ],
        "summary": "Le nouveau framework de Google est disponible dans sa version stable depuis mi-septembre 2016. Je vous propose de découvrir, par la pratique, les concepts et les fonctionnalités que propose Angular en développant une application web de chat (*almost from scratch...*). Si vous n'avez pas encore eu le temps de vous plonger dans cet écosystème bien particulier, cet atelier est fait pour vous !",
        "title": "Hands-on Angular: let's chat!",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            769000000
        ],
        "description": "Au programme:\r\n\r\n- JavaScript, frameworks et outils\r\n- Communautés et open source\r\n- Communication et «advocacy»\r\n- «Développeur JavaScript»: un métier d'avenir ?\r\n\r\nEssayons de réfléchir ensemble où l'on va !",
        "end": [
            2017,
            4,
            20,
            17,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a5f",
        "language": "FRENCH",
        "room": "AMPHI2",
        "slug": "javascript-soupirs-",
        "speakerIds": [
            "siegfried.ehret"
        ],
        "start": [
            2017,
            4,
            20,
            16,
            10
        ],
        "summary": "Vous baignez dans le JavaScript depuis quelques années ? Vous avez suivi ce qui se passe dans ce monde là ? Vous avez donc certainement croisé le terme de «fatigue», et vous l'avez peut être vécue.\r\n\r\nJ'ai envie de décortiquer un peu avec vous ce qu'il y a derrière ce terme dépassé (décembre 2015 !!), en prenant un peu de recul pour avoir une vision sur l'ensemble du paysage JavaScript, du langage aux développeurs.",
        "title": "JavaScript... *soupirs*",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            778000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            17,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a73",
        "language": "FRENCH",
        "room": "ROOM1",
        "slug": "serverless-transition-du-monolithique-au-systeme-distribue",
        "speakerIds": [
            "eunomie"
        ],
        "start": [
            2017,
            4,
            20,
            16,
            10
        ],
        "summary": "C'est l'histoire d'une application web. De base monolithique, elle a évolué pour intégrer de manière massive des technologies de type \"serverless\" (pool de 2000 AWS Lambda en production) : amélioration drastique des performances, meilleure expérience utilisateur. L'introduction de cette technologie a surtout transformé au plus profond l'architecture de l'application en un système distribué… et avec ma vision de tous mes futurs développements.",
        "title": "Serverless : transition du monolithique au système distribué",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            779000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            18,
            0
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a75",
        "language": "FRENCH",
        "room": "ROOM5",
        "slug": "deep-learning-pour-la-reconnaissance-de-chatons",
        "speakerIds": [
            "remiemonet"
        ],
        "start": [
            2017,
            4,
            20,
            16,
            10
        ],
        "summary": "Envie de comprendre le **deep learning par la pratique** ?\r\nDe nombreux frameworks existent aujourd'hui pour faire du deep learning mais les tutoriaux s'adressent souvent aux initiés.\r\n\r\nCet atelier sera l'occasion de **détailler les principes de base** nécessaires à la compréhension de ces frameworks.\r\nNous explorerons des éléments aujourd'hui typiques dans les réseaux profonds : perceptron, descente de gradient, graphe de calcul, réseaux convolutionels, ReLU, pré-entraînement, adaptation à une nouvelle tâche, etc.\r\n\r\nCet atelier utilisera la bibliothèque **TensorFlow**.",
        "title": "Deep Learning pour la Reconnaissance de Chatons",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            786000000
        ],
        "description": "Cloud storages are one example for a privacy-critical infrastructure as personal data is distributed across a broad network while the location of storage is often out of the user’s control. Client-side (end-to-end) encryption is a valid way to protect those data independent of security measures taken by the cloud provider and its privacy agreements. However, existing tools – e.g., for disk or file encryption – do not work seamlessly with the cloud.\r\n\r\nThe idea behind Cryptomator is to make cloud encryption as user-friendly, transparent, and understandable as possible to enable everyone to protect their data. In their talk, the developers of Cryptomator emphasize the importance of privacy in our information society in general and the significance of sophisticated and user-friendly tools to empower everyone to safeguard their privacy in particular. The general idea behind Cryptomator, its encryption scheme and challenges when targeting the cloud will be outlined. In addition, the architecture of the application and future development plans will be illustrated.",
        "end": [
            2017,
            4,
            20,
            17,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4c9312a300179a2a89",
        "language": "ENGLISH",
        "room": "ROOM2",
        "slug": "cloud-encryption-with-cryptomator-privacy-protection-for-everyone",
        "speakerIds": [
            "christian.schmickler",
            "markus.kreusch"
        ],
        "start": [
            2017,
            4,
            20,
            16,
            10
        ],
        "summary": "Current and past political events have initiated an extensive discussion on privacy and informational self-determination. The vast majority of consumers states their desire to keep personal data private while in everyday life, they use services and approve privacy agreements that undermine their informational self-determination on a large scale. This contradiction is referred to as the privacy paradox. While there are tools designed to keep personal data private, employing such tools is often associated with reduced functionality and/or usability and new privacy issues resulting from their use. Such deficiencies inhibit their widespread use.",
        "title": "Cloud Encryption with Cryptomator – Privacy Protection for Everyone",
        "topic": "hacktivism",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            29,
            20,
            33,
            36,
            336000000
        ],
        "description": "Nety & Mila are both members of JUG Indonesia, founders of Duchess Indonesia, and promotors of JENI (Java Education Network Indonesia). JENI is a curriculum created by JUG Indonesia on 2005 and officially adopted by the Ministry of National Education on 2006.\r\n\r\nApart from being a developer, they also have a big concern in IT education in Indonesia, especially in vocational high school students, because they’re also one of the graduates. But in fact, there is a gap between the IT curriculum in vocational school and the industry needs. So to reduce the gap, they held a voluntary roadshow on October 2012 and March 2013 to educate the students with one day free Java training. They visited 32 vocational high schools in 4 cities in Indonesia, by motorcycle, with the aim to teach additional knowledge to IT students, as well as to check on the progress of JENI (Java Education Network Indonesia).",
        "end": [
            2017,
            4,
            20,
            17,
            25
        ],
        "event": "2017",
        "format": "KEYNOTE",
        "id": "58de4d4c9312a300179a2a92",
        "language": "ENGLISH",
        "room": "AMPHI1",
        "slug": "take-java-on-the-road",
        "speakerIds": [
            "herawaty.nety",
            "yuliani.mila"
        ],
        "start": [
            2017,
            4,
            20,
            17,
            0
        ],
        "summary": "Nety & Mila are female developers from Indonesia.\r\nThey will share how they first get into programming, then why they decided to make coding as a career.\r\n",
        "title": "Take Java on the Road",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            764000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            20,
            18,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a52",
        "language": "ENGLISH",
        "room": "AMPHI1",
        "slug": "myths-and-patterns-of-organizational-change",
        "speakerIds": [
            "rising.linda"
        ],
        "start": [
            2017,
            4,
            20,
            17,
            10
        ],
        "summary": "Myths and Patterns of Organizational Change\r\n\r\nYou have great ideas. You're smart. The people in your organization are smart. Post Hoc, Ergo Propter Hoc -- the rest is easy -- simply make a transition plan and transparently explain the benefits. These and other organizational change myths will be tackled by Linda's talk about patterns for introducing new ideas. She will provide some useful tips for helping you start on Monday morning to grow any innovation step by step.",
        "title": "Myths and patterns of organizational change",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            768000000
        ],
        "description": "Il s'agit d'un retour d'expérience sur la configuration et l'exploitation d'un pipeline de données (des logs, des métriques...). A partir des problèmes rencontrés  en production, j'expliquerai le fonctionnement interne des outils utilisés, pour vous permettre d'éviter les même écueils. Je m’intéresserai à des problématiques comme la fiabilité (perte de messages), la résilience, la performance ou la sécurité.",
        "end": [
            2017,
            4,
            20,
            18,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a5c",
        "language": "FRENCH",
        "room": "ROOM1",
        "slug": "l-odyssee-de-la-log",
        "speakerIds": [
            "gerald.quintana"
        ],
        "start": [
            2017,
            4,
            20,
            17,
            10
        ],
        "summary": "Suivez le périple d'une log depuis son émission, jusqu'à sa destination finale. Un parcourt semé d’embûches pour sauver la belle application du méchant NullPointor. Des courses poursuites à plus 10000 messages/s dans le dédale des systèmes distribués.\r\nActeurs: Logback le faillot, Filebeat l'espion, Kafka le transporteur, Elasticsearch.... Costumes et Maquillage: Logstash",
        "title": "L'odyssée de la Log",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            780000000
        ],
        "description": "Cette présentation illustrera les avantages des Progressive Web Apps tout en expliquant comment les intégrer sur son application ou site web. Elle est basée sur un retour d’expérience de plusieurs conférences, ainsi que le développement d’une application web, en production, mettant en pratique les concepts des progressive web apps. Elle a pour but de démontrer les bénéfices qu'il y a d'utiliser ces concepts ainsi que la facilité de les implémenter sur un projet.\r\n\r\nNous expliquerons, en se référant à notre code d'exemple :\r\n\r\n- Quelles motivations soutiennent l'initiative des PWAs\r\n- Les bonnes pratiques à mettre en oeuvre (RWD, Sécurité, SEO, etc.)\r\n- Les outils à notre disposition et leur rôle (ServiceWorker, Push Notifications, Manifest, etc.)",
        "end": [
            2017,
            4,
            20,
            18,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a7b",
        "language": "FRENCH",
        "room": "AMPHI2",
        "slug": "progressive-web-apps-au-dela-du-buzzword",
        "speakerIds": [
            "paul-guillaume.dejardin",
            "antoine.le.taxin"
        ],
        "start": [
            2017,
            4,
            20,
            17,
            10
        ],
        "summary": "Le concept de Progressive Web App a pour ambition de permettre aux applications web de rivaliser, dans une certaine mesure, avec les applications natives. En s’appuyant sur quelques bonnes pratiques et certaines technologies, l'expérience utilisateur est considérablement améliorée en corrigeant par exemple les soucis de connectivité sur mobile ou en permettant l'utilisation de notifications.",
        "title": "Progressive Web Apps, au-delà du buzzword",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            788000000
        ],
        "description": "__Le temps d’une session avec des bouts de live-coding__, venez découvrir les trucs et astuces des gens qui préfèrent reprendre le contrôle plutôt que de subir. Voire qui préfèrent les opportunités cachées du Legacy aux pages blanches des projets Greenfield. Vous aussi, rejoignez le Legacy Club !",
        "end": [
            2017,
            4,
            20,
            18,
            0
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4c9312a300179a2a8b",
        "language": "FRENCH",
        "room": "ROOM2",
        "slug": "legacy-club",
        "speakerIds": [
            "tpierrain",
            "bruno.boucard"
        ],
        "start": [
            2017,
            4,
            20,
            17,
            10
        ],
        "summary": "Code non maintenable, bugs à répétition, corrections chronophages, moral dans les chaussettes... Pas étonnant que la plupart d’entre nous préfèrent travailler sur des projets où tout est à (re)construire (Greenfield) plutôt que sur du code Legacy (Brownfield). Il faut dire que le Legacy sur lequel on a perdu le contrôle est plus que pénible. C’est épuisant, voire décourageant. Et si nous nous trompions ? __Et si – munis de quelques techniques de refactoring et de communication- nous pouvions inverser les choses et reprendre le contrôle…__ \r\n",
        "title": "Legacy Club",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            29,
            20,
            16,
            15,
            841000000
        ],
        "description": "A venir ...",
        "end": [
            2017,
            4,
            21,
            9,
            40
        ],
        "event": "2017",
        "format": "KEYNOTE",
        "id": "58de4d4c9312a300179a2a91",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "regen-villages",
        "speakerIds": [
            "shiamatey.marjolein"
        ],
        "start": [
            2017,
            4,
            21,
            9,
            15
        ],
        "summary": "A venir ...",
        "title": "ReGen Villages",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            750000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            11,
            50
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a45",
        "language": "ENGLISH",
        "room": "ROOM4",
        "slug": "noestimates-game",
        "speakerIds": [
            "mattphilip"
        ],
        "start": [
            2017,
            4,
            21,
            10,
            0
        ],
        "summary": "Wondering what NoEstimates means in practice, or why you would want to use NoEstimates? Perhaps you’ve heard the buzz, read Vasco Duarte’s excellent book or simply want to understand how to plan better and reduce risk. If so, you should attend this workshop session for a multi-team game that will help you:\r\n * Learn the basics of NoEstimates and why the concept can help\r\n * Find out through experimentation what — and how much — different factors influence delivery time \r\n * Learn how to create a probabilistic forecast that provides a less risky way to plan \r\n * Understand how to reduce variation that affects — and creates risk in — delivery \r\n\r\nFor more information, including the game materials, please visit https://mattphilip.wordpress.com/noestimates-game/",
        "title": "NoEstimates Game",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            757000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            10,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a4a",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "le-streaming-d-api-pourquoi-et-comment-transformer-vos-apis-statiques-en-donnees-temps-reel-",
        "speakerIds": [
            "neveu.audrey"
        ],
        "start": [
            2017,
            4,
            21,
            10,
            0
        ],
        "summary": "Nous savons que l’animation est essentielle pour l'interaction avec nos utilisateurs. Mais aujourd'hui l'interactivité ne peut plus se résumer à l’UX. Twitter, Waze, Slack … toutes les applications à succès utilisent le temps réel pour rendre leurs utilisateurs addicts.\r\n\r\nMais comment faire pour transformer votre API statique en un flux de données temps-réel ? Du pull ? Du push ? Des Webhooks ? Vous connaissez sûrement les Web-Sockets, mais avez vous déjà entendu parler de Server-Sent Events ?\r\n\r\nDans ce talk nous comparerons ces technologies pour comprendre dans quel cas elles s'appliquent le mieux avant de voir comment on peut aller encore plus loin en réduisant la quantité de données échangées. Et parce qu'il n'y a pas que le web qui a besoin de temps réel (et parce que c'est bien plus fun), je vous montrerai comment faire danser des drones sur des APIs streamées.",
        "title": "Le Streaming d'API : pourquoi et comment transformer vos APIs statiques en données temps réel ?",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            765000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            11,
            50
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a55",
        "language": "FRENCH",
        "room": "ROOM3",
        "slug": "des-petits-carres-de-couleur-",
        "speakerIds": [
            "lvictorino"
        ],
        "start": [
            2017,
            4,
            21,
            10,
            0
        ],
        "summary": "Référencement, UX, Lean, Webdesign, Git, React, NodeJS, Performance, i18n, IoT, Open Source, CSS, Agile, Functional Programming, Data Viz, Google, Java, Marketing, Back End, Full Stack… Tout ça on s’en cogne un peu puisqu’à la base on voulait juste faire des jeux vidéo. Non ? \r\n\r\nVenez faire plaisir à votre vous d’il y a 15/20 ans qui avait des étoiles dans les yeux en voyant des carrés de couleurs bouger sur son écran. Découvrons ensemble Pico-8, l’émulateur officiel d’une console qui n’a jamais existé : de gros pixels, peu de couleurs, peu de fonctionnalités, beaucoup de limitations, mais 32Ko d’amour sincère et véritable qui fait du bien aux promesses faites il y a longtemps mais jamais oubliées.\r\n\r\nAttention : des **notions** de programmation sont nécessaires pour ne pas mourir de frustration durant ce workshop.",
        "title": "Des petits carrés de couleur.",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            768000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            10,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a5d",
        "language": "FRENCH",
        "room": "ROOM2",
        "slug": "data-engineer-s-toolkit",
        "speakerIds": [
            "horalass"
        ],
        "start": [
            2017,
            4,
            21,
            10,
            0
        ],
        "summary": "Avoir des données de qualité, mise à jour à la bonne fréquence et correctement présentées permet de prendre les bonnes décisions. Mais de nos jours, il y a de plus en plus de cloisons entre les différentes données au sein d’une entreprise pour différentes raisons. De ce fait, la donnée est en constant mouvement au sein du système d’information d’une entreprise. Un des rôles du data engineer est de s’assurer que les utilisateurs ne sentent pas ou très peu ce cloisonnement. Quand on est en charge de construire ces voies d’échange de données, on doit faire un choix entre les différentes options suivantes :\r\n\r\n* Coder les flux d’intégration à la main ou avec un framework\r\n* Utiliser un ETL\r\n* Mettre en place une architecture orientée bus avec un ESB\r\n* Utiliser les frameworks de data processing orientés Big Data (Spark, Kafka streams, etc).\r\nCette présentation se focalisera sur les différents outils et approches d’échange de données. Il présentera chaque outil dans son contexte historique et ces différents cas d’utilisation. Cette présentation posera les bases des questions qu'on se doit de se poser pour un choix adéquat.",
        "title": "Data Engineer's Toolkit",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            774000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            10,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a6b",
        "language": "FRENCH",
        "room": "ROOM1",
        "slug": "representer-l-economie-le-pouvoir-les-lobbies-grace-aux-visualisations-de-donnees-quand-le-designer-fait-l-equilibriste",
        "speakerIds": [
            "fabrice.sabatier"
        ],
        "start": [
            2017,
            4,
            21,
            10,
            0
        ],
        "summary": "A la frontière entre art, design, technologies et activisme se trouve ce que Carl DiSalvo appelle l’adversarial design : une production d’objets ou d’interfaces qui ouvrent des espaces de confrontation politique, offrent des ressources et des opportunités de participer au débat public ou à la contestation. La visualisation de données et d’informations s’inscrit dans cette famille d’artefacts quand elle permet aux citoyens de voir et percevoir des rapports, des tendances, des forces dans les enjeux publics, quand elle soulève de nouvelles questions et crée des zones de tensions idéologiques.\r\nA partir de cet angle d’approche, je présenterai le travail de recherche que j’effectue sur la visualisation de données économiques et en particulier sur la visualisation des réseaux de lobbying dans les institutions européennes. Ces exemples, auxquels s’ajouteront quelques visualisations historiques, permettront de dégager trois axes méthodologiques permettant de décrire la spécificité du design dans le champ de la visualisation de données. Le premier concerne le rapport à la complexité : à travers des interfaces sur mesure, des modes de scénarisation, nous verrons comment il est possible de guider dans la complexité plutôt que de la simplifier. Le deuxième axe abordera la prétendue objectivité ou l’impression de rationalité qui émane des visualisations de données et l’intérêt du designer à privilégier la transparence des méthodes à une neutralité veine. Enfin, nous verrons ce qu’implique le fait de considérer et de traiter les visualisations de données comme des images à travers la rhétorique et la puissance symbolique.",
        "title": "Représenter l’économie, le pouvoir, les lobbies grâce aux visualisations de données : quand le designer fait l’équilibriste",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            777000000
        ],
        "description": "D3.js a les caractéristiques suivantes que je présenterai dans l'atelier, afin de :\r\n\r\n* Facilement manipuler le DOM d'une page web à la JQuery, aussi bien en SVG qu'en Canvas\r\n* Facilement créer des axes, labels et autres finitions indispensables à une dataviz professionnelle\r\n* Interpoler différents états du DOM pour faire des transitions animées\r\n* Création des layouts complexes de graphes ou de Treemap\r\n\r\nCe workshop a pour but d'être très technique et s'adresse à un publique qui maitrise au moins la programmation web en général, mais idéalement JavaScript niveau avancé et maitrise l'utilisation de bibliothèques (JQuery, ..) ou framework JS (mais ce n'est pas indispensable).\r\n\r\nNous verrons donc pendant ce workshop :\r\n\r\n* Les principes de D3 évoqués ci-dessus en détails, et des exemples simples\r\n* Les spécificités de la V4 de D3 et ES6 et la création de modules https://github.com/romsson/d3-gridding\r\n* L'utilisation de graphiques ré-utilisables https://bost.ocks.org/mike/chart/\r\n* La création d'une mini biblio dataviz réutilisable https://github.com/cid-harvard/vis-toolkit\r\n* Le détail de nombreux exemples et quelques points intéressants dans le code source de D3.js https://github.com/d3\r\n\r\nLes participants pourront coder en live les exemples fournis au préalable dans l'interface http://blockbuilder.org/ . Les principes de base de la visualisation seront aussi rapidement rappelés, ainsi que l'utilisation de vrais jeux de données pour les exemples.\r\n\r\nLe code du workshop sera disponible sur GitHub, et il est fortement recommandé de venir avec une machine, sur laquelle Node JS sera pré-installé.\r\nUne bonne prise en main de Git est aussi utile.",
        "end": [
            2017,
            4,
            21,
            11,
            50
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a71",
        "language": "FRENCH",
        "room": "ROOM5",
        "slug": "la-dataviz-avancee-sur-le-web-en-javascript-avec-d3-js",
        "speakerIds": [
            "14898705"
        ],
        "start": [
            2017,
            4,
            21,
            10,
            0
        ],
        "summary": "D3.js est depuis quelques années la bibliothèque standard pour la création de visualisation de données (dataviz) sur le web. Il est donc indispensable de maîtriser cette bibliothèque si un programmeur souhaite :\r\n\r\n* Créer sa propre dataviz from scratch à partir de mockups\r\n* Adapter un des nombreux exemples D3.js disponibles sur https://d3js.org/ \r\n* Contribuer à une bibliothèque de visualisation basée sur D3.js (c3js, nvd3, ..)\r\n* Intégrer une visualization ou une bibliothèque basée sur D3.js dans un framework (react, angular) sous forme de component",
        "title": "La DataViz avancée sur le Web en JavaScript avec D3.js",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            766000000
        ],
        "description": "Les principes en ergonomie des IHM vous paraissent vraiment peu ergonomiques à traduire en écrans réels et en flow d'utilisation ? En effet.   \r\nAlors vous préférez ne pas trop vous y risquer. Mmmh, normal.\r\n\r\nMais dites, les utilisateurs qui deviennent rancuniers qu'on ne pense à eux qu'en mode \"bein-yzonka\", c'est un souci, non ? \r\nC'est pour ça que j'assiste actuellement l'équipe R&D de Bonitasoft à envisager l'ergonomie comme un système Booléen, simple, et non-négociable. \r\n\r\nCa va mieux ? Aaah... venez, je vous raconte.",
        "end": [
            2017,
            4,
            21,
            10,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a57",
        "language": "FRENCH",
        "room": "AMPHI2",
        "slug": "si-l-ergonomie-des-ihm-m-etait-contee-comme-un-systeme-booleen-simple-et-non-negociable",
        "speakerIds": [
            "nathalie.cotte"
        ],
        "start": [
            2017,
            4,
            21,
            10,
            0
        ],
        "summary": "Passer de zéro interactions avec vos utilisateurs à une méthode complètement centrée sur l'humain vous fait flipper ? \r\nJe vois bien ce que vous voulez dire.",
        "title": "Si l'ergonomie des IHM m'était contée comme un système Booléen, simple et non-négociable",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            749000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            11,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a43",
        "language": "FRENCH",
        "room": "AMPHI2",
        "slug": "au-secours-ma-prod-est-sous-docker-",
        "speakerIds": [
            "francois.teychene"
        ],
        "start": [
            2017,
            4,
            21,
            11,
            0
        ],
        "summary": "Docker est un outil très puissant qui connait une adoption très rapide grace aux nombreuses possibilitées qu'il offre aux équipes.\r\n\r\nAprès l'avoir essayé en dev puis avoir convaincu votre management et vos obs de le tester sur des environnements intermédiaires, il est temps de partir en prod, et là, c'est le drame ...\r\nLe passage d'une production sous Docker engendre des problématiques comme le monitoring, la gestion des logs, le scheduling ou la gestion des datas que l'on découvre.\r\n\r\nDans cette présentation, je ferai un retour d'expérience sur ces problématiques et présenterai des solutions adaptées.",
        "title": "Au secours, ma prod est sous Docker !",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            751000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            11,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a46",
        "language": "FRENCH",
        "room": "ROOM2",
        "slug": "compagnonnage-css-et-vexillologie",
        "speakerIds": [
            "tim.carry"
        ],
        "start": [
            2017,
            4,
            21,
            11,
            0
        ],
        "summary": "CSS Flags est un projet un peu fou dans lequel je recrée l'ensemble des drapeaux des pays du monde en pure CSS, en n'utilisant qu'un seul `div` par drapeau. Dans ce talk j'explique les différentes techniques secrètes qui vous permette d'utiliser un seul élément au maximum de ses capacités. On y voit aussi pourquoi des projets fous et stupides comme celui-ci sont en fait très importants.",
        "title": "Compagnonnage, CSS et Vexillologie",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            763000000
        ],
        "description": "Bref avez tout ça vous finissez la journée en étant plus ou moins fatigué et une impression désagréable que ça n'avance pas alors que vous vous donnez à fond !\r\n\r\nLa 1ère bonne nouvelle c'est que nous sommes sommes pas seuls à avoir une mauvaise gestion du temps, la 2ème bonne nouvelle est qu'il existe des actions simples pour sortir de cette spirale infernale :-)\r\n\r\nDans cette session, je vous inviterai à réfléchir sur votre propre gestion du temps individuelle et collective. Pour vous aider à trouver des pistes d'amélioration nous parlerons parallélisation, priorisation, délégation et dire non ...",
        "end": [
            2017,
            4,
            21,
            11,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a51",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "comment-gerer-son-temps-efficacement-individuellement-et-en-equipe-",
        "speakerIds": [
            "romain"
        ],
        "start": [
            2017,
            4,
            21,
            11,
            0
        ],
        "summary": "Il est possible que vous ayiez la sensation de manquer de temps. Peut-être même que vous manquez de temps tout le temps. Et quand vous prenez enfin de le temps, vous êtes interrompus par un collège, un mail, une demande client. S'ajoute à cela des urgences à traiter tout de suite car sinon ... ",
        "title": "Comment gérer son temps efficacement individuellement et en équipe ?",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            771000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            11,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a62",
        "language": "ENGLISH",
        "room": "ROOM1",
        "slug": "soft-robotics-for-space-applications",
        "speakerIds": [
            "kari.love"
        ],
        "start": [
            2017,
            4,
            21,
            11,
            0
        ],
        "summary": "The emerging field of soft robotics represents an opportunity for novel solutions in the demanding environment of space. This talk will feature a brief overview of the domain of soft robotics, its suitability to space exploration applications, and a survey of NASA funded projects involving soft and/or hybrid robotics. There will also be  discussion of the interpretation of next-generation space suits as wearable soft robots, and the exciting potential mechanical counter-pressure presents.",
        "title": "Soft Robotics for Space Applications",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            777000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            13,
            25
        ],
        "event": "2017",
        "format": "KEYNOTE",
        "id": "58de4d4b9312a300179a2a72",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "revenu-universel-25-minutes-pour-tout-comprendre",
        "speakerIds": [
            "écoloHumanistes"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            0
        ],
        "summary": "Et si l'on donnait une somme d'argent mensuellement à tout le monde sans conditions ? C'est le concept simple et clair du revenu universel. Il existe cependant de nombreuses concrétisations possibles que nous évoquerons en répondant aux questions suivantes : Pourquoi le mettre en place ? A quel niveau ? Comment le financer ? Puis nous parlerons des différentes expérimentations faites à travers le monde. Nous finirons par le REVE (Revenu Emancipateur pour Vivre Epanoui), notre revenu universel idéal.",
        "title": "Revenu universel, 25 minutes pour tout comprendre",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            760000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            13,
            50
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4b9312a300179a2a50",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "remote-first-",
        "speakerIds": [
            "william.durand"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            30
        ],
        "summary": "En entreprise, le télétravail est de plus en plus répandu, mais souvent limité ou difficile. En co-créant TailorDev, nous avons fait du travail à distance (remote work) le mode de travail par défaut. Entre exemples, astuces et retours d'expérience, je vous présenterai comment et pourquoi j'ai construit une entreprise \"remote-first\".",
        "title": "Remote-first?",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            775000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            13,
            50
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4b9312a300179a2a6c",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "travailler-moins-pour-gagner-moins",
        "speakerIds": [
            "thomas.parisot"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            30
        ],
        "summary": "Il y a un an j'ai décidé de passer à temps partiel, ou plutôt aux\nweek-end de trois jours. Est-ce que ça m'aide à rattraper mon retard\ndans Game of Throne, augmenter le nombre d'heures que j'alloue à ma\nveille technique ou bien à passer pour quelqu'un qui n'aime pas\ntravailler ?\n\nÀ vrai dire, j'ai surtout pu augmenter ma qualité de vie malgré ma\nbaisse de salaire, ainsi que dédier ce temps à du bénévolat, m'aérer\nl'esprit et voir du pays en me fatigant un peu moins.",
        "title": "Travailler moins pour gagner moins",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            776000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            13,
            50
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4b9312a300179a2a6e",
        "language": "ENGLISH",
        "room": "UNKNOWN",
        "slug": "being-a-girl-who-codes-in-romania",
        "speakerIds": [
            "catalina.dobrica"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            30
        ],
        "summary": "There are more male coders than female ones in the world. I don't know why. There just are. Little over a year ago I joined a French team of 30 or so developers - only two of whom were women. These numbers were surprising to me, coming from a team where there were as many women as there were men, and can be discouraging to girls considering a career in the industry. But they shouldn't be. I'm here to speak about the life of a coder in Romania from _a woman's perspective_ - not that it really changes anything. Coding knows no bounds - nor gender.",
        "title": "Being a girl who codes in Romania",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            777000000
        ],
        "description": "Au programme, le déroulement complet d'une attaque :\r\n\r\n- écoute réseau\r\n- vol de mot de passes\r\n- création de trojan\r\n- évasion antivirus\r\n- infection\r\n- prise de contrôle totale de la cible",
        "end": [
            2017,
            4,
            21,
            13,
            50
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4b9312a300179a2a70",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "comment-hacker-la-webcam-de-votre-voisin-e-",
        "speakerIds": [
            "charles.bochet"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            30
        ],
        "summary": "Ce talk est une démonstration de l'attaque de l'Homme du milieu (Man-In-The-Middle). L'objectif est de démystifier le hacking par la pratique (éthique!) et de sensibiliser aux risques que l'on court en permanence (au bureau, à la maison ou dans un café public).",
        "title": "Comment hacker la webcam de votre voisin(e) ?",
        "topic": "hacktivism",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            781000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            13,
            50
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4b9312a300179a2a7e",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "les-tests-utilisateurs-du-pauvre",
        "speakerIds": [
            "annso_"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            30
        ],
        "summary": "Vous n'êtes pas UX designer ? D'ailleurs, votre entreprise n'a pas d'UX designer car ça coûte trop cher/c'est inutile ? Mais vous avez envie de faire quelque chose pour votre pauvre produit qui devient de moins en moins utilisable et de plus en plus compliqué ? Alors, vous êtes probablement comme moi, l'année dernière quand j'ai décidé de lancer des tests utilisateurs avec zéro moyens. Dans ce retour d'expérience, je présenterais ma démarche pour monter un ou deux scénarios de tests, trouver des utilisateurs, organiser une session de tests et analyser les résultats.",
        "title": "Les tests utilisateurs du pauvre",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            783000000
        ],
        "description": "Aidé par l'Histoire de l'informatique, la psychologie et la sociologie, je vous donnerai des outils anti-mythes pour voir les problèmes actuels et commencer à les résoudre. Et vous verrez pourquoi la société toute entière en a bien besoin !",
        "end": [
            2017,
            4,
            21,
            13,
            50
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4c9312a300179a2a82",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "pourquoi-tous-les-developpeurs-sont-ils-barbus-",
        "speakerIds": [
            "116917682933277334027"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            30
        ],
        "summary": "Contrairement à beaucoup d’idées reçues, l’informatique n’a pas été créé par et pour les hommes blancs américains et européens, et seulement eux. Loin de là !\r\n\r\nComment se fait-il alors que les femmes et les « minorités » soient si peu nombreuses dans les écoles d'informatique, dans les réponses aux offres d'emploi, et qu'il soit si difficile de citer les contributeur•ice•s qui ne correspondent pas au cliché du développeur barbu amateur de pizza ?",
        "title": "Pourquoi tous les développeurs sont-ils barbus ?",
        "topic": "hacktivism",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            784000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            13,
            50
        ],
        "event": "2017",
        "format": "RANDOM",
        "id": "58de4d4c9312a300179a2a84",
        "language": "FRENCH",
        "room": "UNKNOWN",
        "slug": "eco-conception-web",
        "speakerIds": [
            "212689489",
            "PKoin"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            30
        ],
        "summary": "On n'y pense pas forcément, les choix de Design et de Développement des services Web ont aussi un coût environnemental : performances, stockage, multiplication des services, design, etc. Tour d'horizon en chiffres, exemples, et ligne de conduite sur des bonnes pratiques pour un développement web plus durable.",
        "title": "Eco-conception web",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            756000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            15,
            40
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a48",
        "language": "FRENCH",
        "room": "ROOM4",
        "slug": "ergonomie-du-poste-de-travail-et-si-l-erreur-etait-encore-aussi-entre-la-chaise-ergonomique-et-le-clavier-orthogonal-",
        "speakerIds": [
            "olivier.guery",
            "matthieu.lecoupeau"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            50
        ],
        "summary": "*Première partie* ayant pour objectif d’expliquer simplement «?comment fonctionne le dos?» afin de comprendre «?ce qu’on peut faire avec?» au quotidien à l’aide de propositions posturales du quotidien qui seront présentées ;\r\n*Seconde partie* autour du bépo, des claviers, des périphériques de saisie ayant pour but :\r\n* de répondre à des questions (y compris liées à la conférence sur le bépo) ;\r\n* de tester du matériel (apportez le votre ! L’idée est aussi de pouvoir échanger).",
        "title": "Ergonomie du poste de travail, et si l’erreur était {encore, aussi} entre la chaise ergonomique et le clavier orthogonal ?",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            767000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            14,
            40
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a5a",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "react-native-dans-vos-apps-vos-apps-dans-react-native",
        "speakerIds": [
            "230222279"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            50
        ],
        "summary": "React Native, ça fait buzzword. Oh wait, c'est carrément trop buzzword.\r\nReact Native, c'est pas histoire de laisser les Web Developer faire des Apps de manière pas trop sale.\r\nReact Native, c'est pas juste pour faire du Cross Platform.\r\nEn fait, c'est plus une techno assez fine qui va changer le développement mobile même pour les Devs Natifs !\r\nJe vous propose de découvrir le point de vue d'un dev Natif en voyage dans React native =D",
        "title": "React Native dans vos apps. Vos apps dans React Native",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            773000000
        ],
        "description": "Oh toi preux chevalier (chevalière), empare-toi de l’arme magique pour terrasser le dragon à grand coup de Sprint et sauver ta princesse (ou ton prince), s’il elle (ou il) le vaut bien ! Est-il vraiment possible de réaliser cette quête en 5 jours au lieu de 5 mois ? Comprendre pourquoi et comment ça marche, exemples à l’appui, astuces en bonus !\r\n\r\n1. __A quoi sert un design sprint ?__\r\nBonne question et merci de l’avoir posée ;)\r\n2. __Un design sprint de rêve…__\r\n\"Le chevalier, la princesse et le dragon\", laissez-vous guider au coeur de la méthode pour sauver la princesse !\r\n3. __Pourquoi ça marche ?__\r\nDécryptage des moments clés, retours d'expériences et cas d'études pour comprendre les mécanismes de la méthode qui transcendent le projet.\r\n4. __(re)Apprendre à travailler ensemble...autrement.__\r\nQuand le super cerveau du groupe devient plus puissant que la somme des individualités.",
        "end": [
            2017,
            4,
            21,
            14,
            40
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a67",
        "language": "FRENCH",
        "room": "ROOM2",
        "slug": "comment-sauver-la-princesse-et-si-le-design-sprint-m-etait-conte-",
        "speakerIds": [
            "benjamin.richy",
            "fabrice.liut"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            50
        ],
        "summary": "Le __Design Sprint__ est une méthode de conception ultra-rapide peaufinée par l’équipe Google Ventures (Jake Knapp) qui a largement puisé dans le __Design Thinking__. Elle mélange habilement diverses techniques d’idéation et conception, soutenue par __l’intelligence collective__, et produit un résultat étonnamment riche de sens.",
        "title": "Comment sauver la princesse... et si le Design Sprint m’était conté ?",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            774000000
        ],
        "description": "Vous apprendrez: \r\n\r\n1- Les techniques fondamentales du WireSketching (outils, technique, styles, écriture)\r\n2- Sketcher les différents éléments d’interface (menus, navigation, boutons, textes, images, etc.)\r\n3- Combiner le tout en mise en page\r\n\r\nLes participants seront ensuite capable de faciliter des sessions de brainstorm, Ils auront les outils en main pour faire des présentations client impressionnantes et efficaces. Finalement, ils sauront faire en 10 minutes ce qui prendrait des heures à faire autrement.",
        "end": [
            2017,
            4,
            21,
            15,
            40
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4b9312a300179a2a6a",
        "language": "FRENCH",
        "room": "ROOM3",
        "slug": "wiresketching-dessiner-les-interfaces",
        "speakerIds": [
            "cynthia.savard.saucier"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            50
        ],
        "summary": "“C’est très joli… mais est-ce qu’il va y avoir de la couleur?“ Me suis-je fait répondre plusieurs fois par des clients qui ne comprennaient pas que mes wireframes ne sont pas des propositions graphiques finales.  \r\n\r\nParfois, les mots manquent pour communiquer de nouvelles idées. En design d'interface, il existe plusieurs formes de \"pop-up\" et de \"dropdown”. Entre les designers, développeurs et autres professionnels, une rencontre de travail se transforme souvent en véritable tour de Babel! Les sketches sont rapides, ne coûtent rien, assure la compréhension commune et transposent une émotion, d’une façon que les wireframes et les maquettes n’en sont pas capables.\r\n\r\nJe propose donc une méthode sans douleur, pour apprendre à communiquer ses idées en utilisant une vocabulaire visuel pour les interfaces. Que vous n’ayez jamais tenu un crayon de votre vie, ou que vous soyez artiste visuel confirmé, cet atelier se prête parfaitement aux niveaux variables. ",
        "title": "WireSketching - Dessiner les interfaces",
        "topic": "design",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            783000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            14,
            40
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4c9312a300179a2a81",
        "language": "FRENCH",
        "room": "AMPHI2",
        "slug": "specifications-en-milieu-agile",
        "speakerIds": [
            "arnaudlemaire"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            50
        ],
        "summary": "Les spécifications ont parfois mauvaise presse : trop rigides, peu adaptées, elles sont vécues comme un fardeau par les développeurs. \r\n\r\nEn face, les méthodologies agiles sont parfois accusées d'être trop dans le détail et d'empêcher la vision à long terme du projet. \r\n\r\nEt s’il était possible d'associer spécifications fonctionnelles et techniques avec les méthodologies agiles pour associer vision à long terme et flexibilité ? En associant les pratiques du user story mapping, de l'impact mapping et de l'event storming, nous verrons comment concilier agilité et vision produit !",
        "title": "Spécifications en milieu agile",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            788000000
        ],
        "description": "Dans ce workshop, nous vous proposerons un \"Capture The Flag\" qui vous permettra de chercher, analyser et exploiter différentes failles de sécurité. Que vous soyez novice ou non, ne vous inquiétez pas, nous serons là pour vous aiguiller dans le seul but d'apprendre des choses tout en passant un excellent moment !\r\n\r\nCe workshop se déroulera en plusieurs temps :\r\n- D'abord un tour d'horizon de différentes failles, avec des exemples concrets mettant en évidence que même les meilleurs développeurs du monde font des erreurs :)\r\n- Ensuite, nous vous fournirons des liens vers différentes applications dont le but sera d'exploiter une faille vous permettant de récupérer un code.\r\n- Chaque code récupéré vous permettra de gagner un nombre de points dépendant de la difficulté.\r\n- Les plus chevronnés d'entre vous seront récompensés :)\r\n\r\nNotre rêve caché : trouver le Mr Robot de ce MiXiT !",
        "end": [
            2017,
            4,
            21,
            15,
            40
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4c9312a300179a2a8d",
        "language": "FRENCH",
        "room": "ROOM5",
        "slug": "ctf-sortez-le-mr-robot-qui-est-en-vous-",
        "speakerIds": [
            "mickaeljeanroy",
            "Houssem"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            50
        ],
        "summary": "Vous avez déjà entendu parler de SQL Injection, de failles CSRF ou autres ? Ok, mais les avez-vous déjà exploitées ?",
        "title": "CTF : Sortez le Mr Robot qui est en vous !",
        "topic": "hacktivism",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            766000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            14,
            40
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4c9312a300179a2a8f",
        "language": "FRENCH",
        "room": "ROOM1",
        "slug": "la-theorie-des-graphes-appliquee-a-git-",
        "speakerIds": [
            "ubermuda"
        ],
        "start": [
            2017,
            4,
            21,
            13,
            50
        ],
        "summary": "Comprendre Git n’est pas forcément chose aisée, pourtant ce n’est pas si compliqué qu’on ne le pense grâce à la théorie des graphes. Après une rapide introduction à cette fameuse théorie, nous verrons comment elle s'applique à Git. Ce talk ne vous apprendra pas de commande Git incroyable, ne parlera pas implémentation, code, ou “plomberie”, vous ne connaitrez probablement pas de nouveau tour de magie en sortant (ou peut-être bien que si), mais vous aurez une nouvelle compréhension du fonctionnement de git, et vous comprendrez enfin ce que vous faites avec `git rebase` et `cherry-pick`, ainsi que ce que fait `git gc`, et c’est déjà pas mal.",
        "title": "La théorie des graphes, appliquée à git.",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            760000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            18,
            0
        ],
        "event": "2017",
        "format": "WORKSHOP",
        "id": "58de4d4c9312a300179a2a93",
        "language": "FRENCH",
        "room": "ROOM7",
        "slug": "mixteen",
        "speakerIds": [
            "titimoby"
        ],
        "start": [
            2017,
            4,
            21,
            14,
            0
        ],
        "summary": "Les enfants, on fait quoi pendant les vacances ? On programme !\r\n\r\nPas besoin d’être un geek en herbe, pas besoin de passer son temps devant un ordinateur... Avec de la créativité et de la curiosité, il est possible de réaliser des programmes informatiques tout en s’amusant.\r\n\r\nPour les parents : Proposez à vos enfants de comprendre l’informatique de façon ludique, avec des outils qui leur sont adaptés. Nous leur ferons découvrir les clés de la programmation.\r\n\r\nPour les enfants : apprenez à créer vos mini-jeux, mini-films sur un ordinateur en venant programmer avec nous !\r\n\r\nPour plus d'info, rendez-vous sur [la page MixTeen du site](/mixteen).",
        "title": "MixTeen",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            757000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            15,
            40
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a49",
        "language": "FRENCH",
        "room": "ROOM2",
        "slug": "etre-un-developpeur-apres-40",
        "speakerIds": [
            "adrian.kosmaczewski"
        ],
        "start": [
            2017,
            4,
            21,
            14,
            50
        ],
        "summary": "Mon histoire personnelle de développeur, saupoudrée d'anecdotes, avec un message de paix et santé mentale, pour réussir une carrière longue dans le milieu de la création de logiciels, sans perdre la tête ni l'envie de continuer.",
        "title": "Être Un Développeur Après 40",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            770000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            15,
            40
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a61",
        "language": "FRENCH",
        "room": "ROOM1",
        "slug": "management-responsable-et-creation-de-valeur-partagee",
        "speakerIds": [
            "sandrine.berger-douce",
            "arnaud.gautier"
        ],
        "start": [
            2017,
            4,
            21,
            14,
            50
        ],
        "summary": "Le management responsable (inspiré des principes du développement durable) est-il un levier de compétitivité pour les entreprises ? Les transitions numérique, écologique et énergétique invitent à réinventer la création de valeur dans les organisations. Le concept de \"création de valeur partagée\" popularisé par Porter et Kramer en 2011 est-il une réponse aux enjeux sociétaux du 21ème siècle ? Autant de sujets au cœur de nombreux débats actuels dans les entreprises, notamment les PME-PMI...",
        "title": "Management responsable et création de valeur partagée",
        "topic": "learn",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            786000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            15,
            40
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4c9312a300179a2a87",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "project-amber-what-s-new-in-java-10",
        "speakerIds": [
            "rémi.forax"
        ],
        "start": [
            2017,
            4,
            21,
            14,
            50
        ],
        "summary": "Ca y est ! Java 9 est releasée ou presque. Bon alors y'a quoi dans Java 10 ?\r\nCe talk parle des nouvelles features qui vont être (ou pas) introduites dans Java 10, à savoir, les trucs laissés en plan de Java 8, l'inférence de type pour les variables locales, la covariance des types paramétrés à la déclaration et la grosse feature de Java 10 : le pattern matching et les types structurés.\r\n\r\nDans le cas du pattern matching, je ferai un petit tour des différents langages qui implémentent le pattern matching, leurs différentes sémantiques. Dans un second temps, je préciserai la sémantique qui est prévue pour Java et montrerai comment il est prévu d'implémenter le pattern matching en Java.",
        "title": "Project Amber - What's new in Java 10",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            786000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            15,
            40
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4c9312a300179a2a88",
        "language": "ENGLISH",
        "room": "AMPHI2",
        "slug": "email-how-hard-could-it-be-",
        "speakerIds": [
            "bart.butler"
        ],
        "start": [
            2017,
            4,
            21,
            14,
            50
        ],
        "summary": "Over the past 3 years, **ProtonMail** has grown into the world’s largest encrypted email service, with over 2 million users. I will discuss the benefits and challenges of working in the open and federated email space, the technical and usability hurdles surrounding encrypted email, and the importance of security-first development in the age of data breaches.",
        "title": "Email: How Hard Could It Be?",
        "topic": "hacktivism",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            750000000
        ],
        "description": "Bien que nous ayons des théories sur la naissance des planètes et la mort des soleils, force est de constater que bien des structures nous échappent. Trop lointaines pour y envoyer une sonde, pas assez lumineuses pour les voir avec nos télescopes, beaucoup de ces sources d'inconnu restent incomprises. Et parmi elles se trouvent les objets les plus fascinants qui soient: les trous noirs. Monstres phagocytant la matière autour d'eux, invisibles aux télescopes, courbant l'espace et le temps, les trous noirs restent une énigme. Comment se forment-ils ? Quels sont leurs processus physiques ? Peuvent-ils mourir ou s'évaporer ? Autant de questions que l'astrophysique moderne tentent de percer. A l'aide d'observations minutieuses, de théories mathématiques et de lourdes simulations informatiques, le voile se lève lentement. Durant cette présentation définitivement \"Alien\", je vous propose de vous expliquer de manière simple mais précise ce que sont les trous noirs et comment l'astrophysique moderne utilise les supercalculateurs, les Big Data Center ou les calculs sur GPU. Cette conférence se veut une passerelle entre les mondes de l'informatique et de l'astronomie.",
        "end": [
            2017,
            4,
            21,
            16,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a44",
        "language": "FRENCH",
        "room": "ROOM1",
        "slug": "balade-cosmique-autour-des-trous-noirs",
        "speakerIds": [
            "frederic.marin"
        ],
        "start": [
            2017,
            4,
            21,
            16,
            0
        ],
        "summary": "L'Univers, avec un grand \"U\" tel que le défini le concept d'Absolu cher à Hegel, est un lieu fascinant. Alors qu'à la nuit tombé nous n'y voyons qu'une lune, quelques planètes et de nombreuses étoiles, l'Univers est en réalité peuplé de nombreux objets cosmiques dont la compréhension nous dépasse encore aujourd'hui.",
        "title": "Balade cosmique autour des trous noirs",
        "topic": "aliens",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            771000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            16,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a63",
        "language": "FRENCH",
        "room": "AMPHI2",
        "slug": "webassembly-pour-les-developpeurs-web",
        "speakerIds": [
            "benjamin.bouvier"
        ],
        "start": [
            2017,
            4,
            21,
            16,
            0
        ],
        "summary": "WebAssembly est une proposition pour un nouveau standard W3C : un format d'exécution binaire pour le Web. Il se veut simple, compact et aussi rapide que le code natif à l'exécution. Se basant sur des idées dérivées d'asm.js, ce nouveau format permet de lancer des applications impressionantes et très avides de performances dans des navigateurs Web. Supporté par Mozilla, Google, Webkit et Microsoft, sa conception est ouverte et collaborative depuis le début. Et donc concrètement, qu'est-ce que tout cela signifie ? Qu'est-ce que cela va changer pour les développeurs, au quotidien ? Comment utiliser WebAssembly dès aujourd'hui et pour quels usages ? Et JavaScript dans tout ça ? Autant de questions que l'on va explorer ensemble.",
        "title": "WebAssembly pour les développeurs Web",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            772000000
        ],
        "description": "C'est pourquoi, nous, Pauline, ops, et Aurore, dev, souhaitons revenir avec vous sur un an de projet qui a abouti au lancement d'une nouvelle plateforme web d'un leader industriel mondial. Grâce à des exemples concrets, vous découvrirez nos bonnes idées, aussi bien techniques qu'organisationnelles, mais aussi les erreurs que nous avons commises et comment nous les avons corrigées afin que vous puissiez les éviter.",
        "end": [
            2017,
            4,
            21,
            16,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a65",
        "language": "FRENCH",
        "room": "ROOM2",
        "slug": "dev-rencontre-ops-1-an-apres",
        "speakerIds": [
            "aurore.malherbes",
            "pauline.bourjot"
        ],
        "start": [
            2017,
            4,
            21,
            16,
            0
        ],
        "summary": "Infrastructure AWS hautement résiliante, architecture blue-green, déploiements entièrement automatisés, application Symfony découplée en microservices gérés par un API Manager... Nous avions tous les outils pour former une équipe Devops performante. Pourtant il nous manquait un ingrédient essentiel: la pratique, qui nous a permis d'améliorer significativement la manière dont nous collaborons !",
        "title": "Dev rencontre Ops, 1 an après",
        "topic": "tech",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            785000000
        ],
        "description": null,
        "end": [
            2017,
            4,
            21,
            16,
            50
        ],
        "event": "2017",
        "format": "TALK",
        "id": "58de4d4b9312a300179a2a76",
        "language": "FRENCH",
        "room": "AMPHI2",
        "slug": "entrepreneur-dans-l-ame-comment-passer-de-l-idee-au-concret-",
        "speakerIds": [
            "vanrenterghem.caroline"
        ],
        "start": [
            2017,
            4,
            21,
            16,
            0
        ],
        "summary": "Voici les thèmes qui seront abordés lors de cette conférence qui sera interactive et se terminera par un partage a propos des projets et difficultés de chacun.\r\n\r\nComment savoir si j'ai une bonne idée ? Comment démarrer ? Seul ou en équipe, ai-je les mêmes chances ? Quelles aides publiques/privées ? À quel stade ? Quels planning, quelles deadline dois-je m'appliquer ? Test & simplicité comme trames pour avancer. La méthode agile. Quand mieux vaut-il abandonner ? Incubateurs, accélérateurs, dois-je en intégrer un ? Puis-je me rémunérer ? Comment ? La particularité des produits physiques et du hardware Ouverture sur les nexts steps : création d'une entreprise, levées de fonds et soutien à la croissance",
        "title": "Entrepreneur dans l'âme ? Comment passer de l'idée au concret.",
        "topic": "makers",
        "video": null
    },
    {
        "addedAt": [
            2017,
            3,
            28,
            15,
            51,
            12,
            768000000
        ],
        "description": "References:\r\nBalinski, M., and R. Laraki. 2011. Majority Judgment: Measuring, Ranking, and Electing. MIT Press, Cambridge, MA.",
        "end": [
            2017,
            4,
            21,
            18,
            35
        ],
        "event": "2017",
        "format": "KEYNOTE",
        "id": "58de4d4b9312a300179a2a5b",
        "language": "FRENCH",
        "room": "AMPHI1",
        "slug": "majority-judgment",
        "speakerIds": [
            "rida.laraki"
        ],
        "start": [
            2017,
            4,
            21,
            18,
            10
        ],
        "summary": "Majority Judgment is a new voting method where voters are explicitly charged with a solemn task of expressing their opinions precisely by evaluating the merit of every candidate in an ordinal scale of measurement such as:  « Having taken into account all relevant considerations, I judge, in conscience, that as President of the United States of America each of the following candidates would be: a Great , a Good , an Average , a Poor , a Terrible  President.» Majorities determine the electorate's evaluation of each candidate and the ranking between every pair of candidates —necessarily transitive— with the first-placed among them the winner. Majority judgment’s principal properties are presented. It best resists manipulation or “gaming the vote”. It is not subject to Arrow’s impossibility, nor to Condorcet’s paradox. The mechanism and its properties are presented via real data (French and US presidential elections, committee decisions, skating and wine competitions).",
        "title": "Majority Judgment",
        "topic": "aliens",
        "video": null
    }
]
