[
    {
        "format": "KEYNOTE",
        "event": "2025",
        "title": "Robustesse: une nouvelle culture Tech?",
        "summary": "Compétitivité débridée, flux tendu, agriculture de précision, smart cities... Paradoxalement, l&#39;âge de l&#39;optimisation, de la performance et du contrôle rend notre monde toujours plus fluctuant: méga-feux, dérive sécuritaire, guerre mondialisée. En s&#39;inspirant des êtres vivants, nous pourrions apprendre une autre façon d&#39;habiter la Terre. Alors que les sociétés humaines modernes ont mis l&#39;accent sur l’efficacité et l’efficience au service du confort individuel, la vie se construit plutôt sur les vulnérabilités, les lenteurs, les incohérences… c&#39;est-à-dire des contre-performances, au service de la robustesse du groupe. Un contre-programme?",
        "speakerIds": [
            "80c1435d-cfad-40dd-975c-663adb0ddd6d"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.64",
        "description": "",
        "topic": "aliens",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-29T09:30:00",
        "end": "2025-04-29T10:00:00",
        "photoUrls": [],
        "slug": "robustesse-une-nouvelle-culture-tech-",
        "level": "Beginner",
        "id": "867474"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "LLMs, toutes ces questions que vous n&#39;avez jamais osé poser à leur sujet",
        "summary": "Les grands modèles de langage (LLM) ont pris d&#39;assaut le monde, alimentant des applications allant des chatbots à la génération de contenu. Pourtant, sous le capot, ces modèles restent énigmatiques.\r\n\r\nCette présentation plongera dans les recoins cachés de la technologie des LLMs qui laissent souvent les développeurs perplexes. Il est temps de poser ces questions que vous n&#39;avez jamais osé poser sur les mystères à la base des LLMs !\r\n\r\nVoici quelques questions auxquelles nous répondrons : \r\n- Vous vous demandez pourquoi les LLM crachent des tokens au lieu de mots ? D&#39;où viennent ces tokens ? \r\n- Pourquoi ne sont-ils pas toujours très intelligents en mathématiques ? \r\n- Quelle est la différence entre un modèle &#34;fondamental&#34; / &#34;pré-entraîné&#34; et un modèle &#34;fine-tuné&#34; ? \r\n- Comment un modèle sait-il quand il a fini de répondre à votre question ? \r\n- Nous ajustons souvent des hyperparamètres comme la température, top-p, top-k, mais savez-vous vraiment comment ils affectent le choix des tokens ?\r\n- La quantification rend les modèles plus petits, mais que sont tous ces encodages numériques comme fp32, bfloat16, int8, etc. ? \r\n- Les LLM sont bons en traduction, n&#39;est-ce pas ? Parlez-vous aussi le langage Base64 ?\r\n\r\nNous réaliserons ensemble que les LLM sont loin d&#39;être parfaits : \r\n- Nous avons tous entendu parler d&#39;hallucinations, ou devrions-nous dire de confabulations ? \r\n- Avez vous entendu parler de la “reversal curse” qui fait que les LLM ignorent certains faits d&#39;un point de vue différent ? \r\n- On pourrait penser que les LLM sont déterministes à basse température, mais vous seriez également surpris de voir comment le contexte influence les réponses des LLM...\r\n\r\nAttachez vos ceintures, il est temps de dissiper la magie des LLM et de poser ces questions que nous n&#39;avons jamais osé poser !\r\n",
        "speakerIds": [
            "glaforge"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.64",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-29T10:20:00",
        "end": "2025-04-29T11:05:00",
        "photoUrls": [],
        "slug": "llms-toutes-ces-questions-que-vous-n-39-avez-jamais-ose-poser-a-leur-sujet",
        "level": "Beginner",
        "id": "819458"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "De la pseudoscience pour mon (pseudo) management",
        "summary": "Êtes-vous plutôt INFP, type Rouge, type D, Capricorne ? Cerveau Gauche, Cerveau Droit, Cerveau Reptilien ? Serdaigle, Gryffondor ? Dragon ? Licorne ? \r\n\r\nPourquoi les tests de personnalité et les types qui y sont liés nous fascinent-ils autant ? En quoi sont-ils basés sur de la pseudoscience, et peuvent-ils être réellement utiles au travail en équipe ?\r\n\r\nExplorons ensemble les promesses (et les pièges) des tests de personnalité dans le management ainsi que l’accompagnement agile, et posons-nous la question : est-il vraiment nécessaire de faire passer des tests à des personnes pour savoir si l’on peut travailler efficacement avec elles ?\r\n\r\nAprès tout, “les individus et leurs interactions plus que les processus et les outils”, donc quelque chose qui nous aide à cartographier les individus devrait nous être utile… Mais jusqu’à quel point ?",
        "speakerIds": [
            "anais.huet"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.64",
        "description": "",
        "topic": "team",
        "video": null,
        "video2": null,
        "room": "AMPHI2",
        "start": "2025-04-29T10:20:00",
        "end": "2025-04-29T11:05:00",
        "photoUrls": [],
        "slug": "de-la-pseudoscience-pour-mon-pseudo-management",
        "level": "Beginner",
        "id": "786340"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Leggins et dark patterns : quand une expérience sans couture dessert l&#39;utilisateur",
        "summary": "Pros du web, vous êtes immunisés contre les dark patterns et les arnaques en ligne. On ne vous la fait pas, à vous. À moi non plus, d’ailleurs ! Et pourtant…\r\n\r\nEn félicitant une prof de gym pour son jogging, jamais je n&#39;aurais pensé tomber dans les méandres d’un site d’articles de sport aux pratiques manipulatrices.\r\n\r\nVêtements de sport, captation de données et dark patterns, tout ça dans un même talk ? Si si, c’est possible ! Embarquez pour une analyse de cette expérience trop parfaite qui, sans que vous vous en rendiez compte, vous allègera de vos mensurations, votre consentement et de quelques centaines d&#39;euros.",
        "speakerIds": [
            "iris.vnaudin"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.64",
        "description": "",
        "topic": "ethics",
        "video": null,
        "video2": null,
        "room": "ROOM2",
        "start": "2025-04-29T10:20:00",
        "end": "2025-04-29T11:05:00",
        "photoUrls": [],
        "slug": "leggins-et-dark-patterns-quand-une-experience-sans-couture-dessert-l-39-utilisateur",
        "level": "Beginner",
        "id": "838384"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Et si on parlait de &#34;malware craftsmanship&#34; ?",
        "summary": "Derrière cette expression aux faux airs de buzzword, se cache un constat : les caractéristiques d&#39;un bon logiciel malveillant ne sont pas forcément celles que l&#39;on a l&#39;habitude de préconiser pour le développement de nos produits. \r\n\r\nSi leur objectif final peut varier (exfiltration d&#39;information, destruction de systèmes, chiffrement de données à des fins d&#39;extorsion...), les logiciels malveillants ont bien une contrainte commune : parvenir à leurs fins sans se faire prendre. \r\n\r\nAu travers de la création d&#39;un &#34;pseudo-virus&#34; inoffensif, nous vous présenterons quelques techniques de développement de malware utilisées pour contourner les outils de détection, avant de nous mettre dans la peau d&#39;un analyste et de disséquer le résultat !",
        "speakerIds": [
            "nailjabogrova",
            "sonia.seddiki"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM1",
        "start": "2025-04-29T10:20:00",
        "end": "2025-04-29T11:05:00",
        "photoUrls": [],
        "slug": "et-si-on-parlait-de-34-malware-craftsmanship-34-",
        "level": "Beginner",
        "id": "827511"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Au-delà des heures : La semaine de 4 jours comme levier d’égalité",
        "summary": "L’égalité…vaste sujet n’est ce pas ? \r\n\r\nÉgalité salariale, reconnaissance équitable, évolution dans l’entreprise… Il est temps de briser les barrières de genre ! Allons même plus loin sur la diversité et l&#39;inclusion en offrant une flexibilité accrue aux employé.es ayant des responsabilités familiales, des engagements ou des besoins particuliers.\r\n\r\nUne révolution du travail se profile à l&#39;horizon : la semaine de 4 jours. Un levier puissant pour l’égalité et je vais vous expliquer pourquoi.\r\n\r\nAu cours de cette conférence, nous explorerons en détail les mécanismes par lesquels la semaine de 4 jours contribue à la diminution des inégalités au travail. Des exemples concrets s’appuyant sur des témoignages et des études de cas mettront en lumière les bienfaits de cette approche. \r\n\r\nEnfin, je vous donnerai les clés pour insuffler cette nouvelle façon de travailler dans votre propre structure. \r\nSaisissez l&#39;opportunité d&#39;initier des transformations positives dès maintenant !",
        "speakerIds": [
            "albane.fagot"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "team",
        "video": null,
        "video2": null,
        "room": "ROOM5",
        "start": "2025-04-29T10:20:00",
        "end": "2025-04-29T11:05:00",
        "photoUrls": [],
        "slug": "au-dela-des-heures-la-semaine-de-4-jours-comme-levier-d-egalite",
        "level": "Beginner",
        "id": "813121"
    },
    {
        "format": "WORKSHOP",
        "event": "2025",
        "title": "Mission Jetpack Compose : révolutionnez le développement mobile 🕵️",
        "summary": "Félicitations, vous démarrez votre tout nouveau job en tant qu’espion·ne à la CIA, la Compose Intelligence Agency 🕵️\r\n\r\nVotre mission, si toutefois vous l’acceptez, consistera à intégrer notre équipe pour retrouver un dangereux fugitif 🥷\r\n\r\nDurant cette mission, votre objectif sera de créer une application “composée” de plusieurs écrans. Pour la mener à bien, vous aurez à disposition des gadgets fournis par Jetpack Compose, tels que les images, les animations et les previews 🧑‍💻\r\n\r\nVous aurez 2 heures, et pas une minute de plus, pour manier l’art de créer des applications mobiles ⏱️\r\nPas d&#39;inquiétude, vous aurez à vos côtés nos deux meilleurs agents spécialisés dans le Renseignement Jetpack Compose.\r\n\r\nVenez apprendre la maîtrise de ces outils qui révolutionnent le développement Android, et bien plus.\r\n\r\nCe message s&#39;autodétruira dans 5 secondes… 💣 Bonne chance.",
        "speakerIds": [
            "039f7151-c8b7-49e9-af49-35a93f8bdcd8",
            "olivier.perez.pro"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM3",
        "start": "2025-04-29T10:20:00",
        "end": "2025-04-29T12:15:00",
        "photoUrls": [],
        "slug": "mission-jetpack-compose-revolutionnez-le-developpement-mobile-",
        "level": "Beginner",
        "id": "837809"
    },
    {
        "format": "WORKSHOP",
        "event": "2025",
        "title": "Défi : L’accessibilité au bout des doigts !",
        "summary": "a11y, VoiceOver, TalkBack, sémantique, oralisation… Ces mots vous disent quelque chose ?\r\nOui ? Alors tant mieux : vous êtes sensibilisés à l’accessibilité !\r\nNon ? Ce n’est pas grave, il n’est jamais trop tard pour en apprendre davantage sur ces termes barbares.\r\n\r\nVenez à cet atelier avec votre smartphone (IOS ou Android), un casque (pour éviter la cacophonie avec les autres) et un masque d’avion ou une écharpe pour se bander les yeux.\r\nNous tenterons alors d’utiliser notre téléphone via des gestes, guidés par le doux son du lecteur d’écran, pour réaliser quelques actions simples. Cela permettra de comprendre comment les utilisateurs non voyants utilisent leur téléphone, afin d’être sensibilisés à l’accessibilité.\r\n\r\nPas de connaissance nécessaire en développement pour y participer.\r\n\r\nAlors n’hésitez pas à venir les yeux fermés à ce talk.",
        "speakerIds": [
            "oceane-gillard",
            "patrice.desaintsteban"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM4",
        "start": "2025-04-29T10:20:00",
        "end": "2025-04-29T12:15:00",
        "photoUrls": [],
        "slug": "defi-l-accessibilite-au-bout-des-doigts-",
        "level": "Beginner",
        "id": "787284"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Le pattern Hive : une stratégie de modularisation pour votre monolithe modulaire ou vos microservice",
        "summary": "Après une décennie, l&#39;industrie réalise que des microservices mal conçus peuvent facilement se transformer en un monolithe distribué, encore plus problématique que le monolithe en spaghetti qu&#39;ils visaient à résoudre. Pour remédier à ce problème, le concept de monolithe modulaire émerge comme une approche alternative.\r\n\r\nCependant, le défi reste de le scinder efficacement sans tomber dans le piège d&#39;un système fortement couplé et rigide. Comment le modulariser correctement tout en gérant la complexité croissante de votre système ? Comment survivre au-delà de notre dette de modélisation et reprendre le contrôle ?\r\n\r\nDécouvrez le pattern Hive qui découple votre stratégie de déploiement - monolithe modulaire ou microservices - de la conception de votre logiciel, en adoptant le principe « Model Once, Deploy as you wish ». Ce pattern vous apportera une conception souple et évolutive, résiliente face aux défis changeants pour les produits existants ou en développement.\r\n",
        "speakerIds": [
            "julien.topcu",
            "tpierrain"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-29T11:30:00",
        "end": "2025-04-29T12:15:00",
        "photoUrls": [],
        "slug": "le-pattern-hive-une-strategie-de-modularisation-pour-votre-monolithe-modulaire-ou-vos-microservice",
        "level": "Advanced",
        "id": "786208"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Null Safety en Java avec JSpecify et NullAway",
        "summary": "JSpecify est un ensemble d’annotations, de spécifications et de documentations permettant une vérification de la &#34;null safety&#34; des applications Java dans l&#39;IDE lors du développement et lors de la compilation grâce à des outils comme NullAway.\r\n\r\nSébastien, qui participe depuis plusieurs années au groupe de travail JSpecify réunissant plusieurs entreprises investies dans l’écosystème JVM comme Google, JetBrains, Oracle ou Broadcom, présentera comment JSpecify peut permettre aux développeurs Java de détecter avant le déploiement les potentielles NullPointerException de façon à rendre leurs applications plus fiables en transformant “the billion dollar mistake” en une fonctionnalité utile permettant de d&#39;exprimer l&#39;absence potentielle de valeur.\r\n\r\nIl présentera également comment les futures Spring Framework 7 et Spring Boot 4 utiliseront JSpecify côté framework et application afin de permettre la création d’applications Spring Boot plus robustes.",
        "speakerIds": [
            "sdeleuze"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "AMPHI2",
        "start": "2025-04-29T11:30:00",
        "end": "2025-04-29T12:15:00",
        "photoUrls": [],
        "slug": "null-safety-en-java-avec-jspecify-et-nullaway",
        "level": "Intermediate",
        "id": "795604"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Stimuler l&#39;Innovation de Votre Entreprise Grâce à une Plateforme Basée sur l’IA Générative",
        "summary": "Depuis l&#39;arrivée de ChatGPT, l&#39;intérêt pour l&#39;IA générative a explosé. Pourtant, pour en tirer pleinement parti, cette technologie doit être à la portée de tous les employés d&#39;une entreprise, pas seulement des experts en technologie.\r\n\r\nDans ce talk, nous allons explorer comment chaque employé peut devenir un acteur de l&#39;innovation grâce à l&#39;IA générative. Nous montrerons comment des outils simples et intuitifs peuvent permettre à tous de profiter des avancées des Large Language Models (LLM) et de l&#39;approche Retrieval Augmented Generation (RAG).\r\n\r\nPour illustrer cette idée, nous prendrons en exemple notre plateforme Moody&#39;s Copilot, conçue pour être un copilote intelligent pour chaque collaborateur. Cette plateforme non seulement aide chacun à utiliser les modèles de langage pour faciliter leurs tâches quotidiennes, mais elle permet aussi d&#39;accéder et de combiner les données de l&#39;entreprise de manière efficace et sécurisée. En plus, elle soulage les employés en leur permettant de déléguer les &#34;low-value tasks&#34;, contribuant ainsi à leur bien-être au travail.\r\n\r\nEn intégrant l&#39;IA générative au cœur des activités et des données de l&#39;entreprise, nous permettons à chaque équipe d&#39;innover dans ses pratiques et d&#39;explorer de nouvelles idées. Cette approche transforme la culture d&#39;entreprise, encourageant la collaboration et l&#39;amélioration continue.\r\n\r\nVenez découvrir comment cette méthode peut transformer votre organisation, en vous offrant les clés pour exploiter au mieux l&#39;IA générative. Nous serons ravis d&#39;échanger avec vous sur ces nouvelles perspectives et de vous aider à donner un nouvel élan à l&#39;innovation dans votre entreprise.",
        "speakerIds": [
            "philippe-laumay"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM2",
        "start": "2025-04-29T11:30:00",
        "end": "2025-04-29T12:15:00",
        "photoUrls": [],
        "slug": "stimuler-l-39-innovation-de-votre-entreprise-grace-a-une-plateforme-basee-sur-l-ia-generative",
        "level": "Intermediate",
        "id": "797436"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Retour d&#39;expérience sur la création de pépinière de tests - un mélange de reconversion et d’handicap",
        "summary": "Retour d&#39;expérience sur la création de pépinière de tests - un mélange de reconversion et d’handicap\r\n\r\nNotre pépinière de tests, c&#39;est aujourd&#39;hui 12 personnes handicapées et issues de la reconversion qui sont employées à plein temps en tant que testeuses et testeurs fonctionnels, et font partie à part entière de leurs équipes.\r\n\r\nNous sommes Solène et Jean, et en 2023, nous avons démarré cette initiative mêlant qualité logicielle, inclusion et reconversion professionnelle. Aujourd&#39;hui, il est temps de faire un retour d&#39;expérience sur ce projet, qu’on a nommé pépinière de test.\r\n\r\nNous expliquerons le déroulement de ce projet, l’origine, le nom, nos actions qui ont bien fonctionné et celles sur lesquelles nous pouvons progresser.\r\nNous nous intéresserons aussi à ce qu&#39;en retirent aujourd&#39;hui les parties prenantes : les personnes que nous avons accompagnées, l&#39;entreprise qui les ont accueillies … et nous, les accompagnateurs !\r\n\r\nSpoiler : nous sommes convaincues que ce type de projet peut fonctionner pour peu qu&#39;on ait les bonnes clés. Ces clés, c’est ce que nous proposons de vous transmettre afin que ce type d&#39;expérience se multiplie.",
        "speakerIds": [
            "af531cf2-44d8-4d89-a38a-86f6b50fa495",
            "so-lapouge"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "ethics",
        "video": null,
        "video2": null,
        "room": "ROOM1",
        "start": "2025-04-29T11:30:00",
        "end": "2025-04-29T12:15:00",
        "photoUrls": [],
        "slug": "retour-d-39-experience-sur-la-creation-de-pepiniere-de-tests-un-melange-de-reconversion-et-d-handicap",
        "level": "Beginner",
        "id": "815595"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Onboarding 2.0 : Réinventer l&#39;intégration des devs",
        "summary": "Quand Hugo, développeur fraîchement recruté, débarque dans sa nouvelle mission, l’aventure commence… mais pas sans accrocs ! Très vite, les méthodes d’intégration traditionnelles montrent leurs failles : manque d’accompagnement, processus interminables et objectifs flous transforment son onboarding en une véritable épreuve. Résultat ? Une productivité qui stagne et une frustration qui monte.\r\n\r\nEt si on réécrivait ce scénario ? Lors de cette conférence, embarquez dans une aventure où l’onboarding devient une expérience fluide, captivante et enrichissante. \r\n\r\nDécouvrez comment transformer l&#39;intégration des nouveaux développeurs et développeuses en une aventure enrichissante, boostant à la fois leur réussite et leur épanouissement. \r\n\r\nPréparez-vous à revisiter l&#39;intégration avec un soupçon d&#39;humour et beaucoup de bonnes pratiques !",
        "speakerIds": [
            "elmaizi.hafsa.it"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "team",
        "video": null,
        "video2": null,
        "room": "ROOM5",
        "start": "2025-04-29T11:30:00",
        "end": "2025-04-29T12:15:00",
        "photoUrls": [],
        "slug": "onboarding-2-0-reinventer-l-39-integration-des-devs",
        "level": "Beginner",
        "id": "786918"
    },
    {
        "format": "KEYNOTE",
        "event": "2025",
        "title": "TBA",
        "summary": "",
        "speakerIds": [
            "1cdd53ea-68d1-4acf-b832-3662da09d116"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "aliens",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-29T14:00:00",
        "end": "2025-04-29T14:30:00",
        "photoUrls": [],
        "slug": "tba",
        "level": "Beginner",
        "id": "868819"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Art génératif: de la découverte à la publication de projets dans des studios prestigieux",
        "summary": "Il y a 3 ans, il me prend l&#39;envie d&#39;apprendre à dessiner. Très vite, l&#39;ordinateur remplace le papier, et le code, le crayon. Je me passionne alors pour le code créatif et l&#39;art génératif (principalement avec p5.js, puis des fragment shaders en GLSL et du three.js). Je partage avec vous cette aventure inattendue qui me conduira à découvrir un univers fascinant, discuter avec des artistes du monde entier, faire une expo dans plusieurs villes du monde dont New York ou encore publier des projets avec des studios renommés.",
        "speakerIds": [
            "camilleroux"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "aliens",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-29T14:40:00",
        "end": "2025-04-29T15:25:00",
        "photoUrls": [],
        "slug": "art-generatif-de-la-decouverte-a-la-publication-de-projets-dans-des-studios-prestigieux",
        "level": "Beginner",
        "id": "794742"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Retrieval Augmented Generation (RAG) : Obtenez des réponses de qualité avec des techniques avancées",
        "summary": "Se lancer dans l&#39;aventure RAG peut sembler facile, mais obtenir des résultats satisfaisants s&#39;avère souvent complexe. Des réponses inexactes, incomplètes ou obsolètes, une récupération de documents sous-optimale et une mauvaise segmentation de texte peuvent rapidement ternir votre enthousiasme initial.\r\n\r\nDans cette session, nous utiliserons Java et LangChain4j pour améliorer vos implémentations RAG. Nous explorerons :\r\n- Stratégies de segmentation avancées : Optimisez le chunking des documents pour améliorer le contexte et la pertinence.\r\n- Techniques de raffinement de requêtes : Étendez et comprimez les requêtes pour améliorer la précision du retrieval.\r\n- Filtrage par métadonnées : Utilisez les métadonnées pour identifier les documents les plus pertinents.\r\n- Reranking des documents : Reclassez les documents récupérés pour une pertinence optimale des résultats.\r\n- Gestion du cycle de vie des données : Implémentez des processus pour maintenir la fraîcheur et la pertinence des données.\r\n- Évaluation et présentation : Évaluez l&#39;efficacité de votre pipeline RAG et fournissez des résultats qui répondent aux attentes des utilisateurs.\r\n\r\nRejoignez-nous pour transformer votre expérience RAG simpliste en une expérience qui ravira vos utilisateurs avec des réponses significatives et précises.\r\n",
        "speakerIds": [
            "glaforge"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "AMPHI2",
        "start": "2025-04-29T14:40:00",
        "end": "2025-04-29T15:25:00",
        "photoUrls": [],
        "slug": "retrieval-augmented-generation-rag-obtenez-des-reponses-de-qualite-avec-des-techniques-avancees",
        "level": "Intermediate",
        "id": "819462"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Quand le Terminal dévore la UI : TUI pour tout le monde !",
        "summary": "Lassé·es des interfaces graphiques gourmandes en ressources et complexes à utiliser ?\r\nVous n&#39;avez pas de temps à perdre entre votre terminal et un navigateur web ?\r\nDécouvrez le pouvoir de l&#39;interface utilisateur textuelle (Textual User Interface) !\r\n\r\nNous explorerons l&#39;univers des TUI et leur potentiel pour enrichir les applications en ligne de commande.\r\nEn partant d&#39;une CLI simple, je vous montrerai comment intégrer des éléments de TUI pour créer une expérience utilisateur plus intuitive et interactive.\r\n\r\nJe vous proposerai un aperçu de quelques frameworks TUI populaires tels que Textual, BubbleTea et Ratatui, respectivement pour les langages Python, Golang et Rust.\r\nQue vous ayez une grande maîtrise du développement ou que vous soyez novice, ce talk vous montrera comment ces frameworks pourront vous aider à créer des interfaces utilisateur textuelles de nouvelle génération.\r\n\r\nVous repartirez donc :\r\n\r\n    en sachant ce que les TUI peuvent vous apporter\r\n    avec un tour d&#39;horizon de solutions pour en développer vous même\r\n    avec des exemples concrets de code\r\n\r\nEt n&#39;oubliez pas : ne quittez plus le confort de votre terminal quand les TUI sont là pour vous !\r\n",
        "speakerIds": [
            "titimoby"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM2",
        "start": "2025-04-29T14:40:00",
        "end": "2025-04-29T15:25:00",
        "photoUrls": [],
        "slug": "quand-le-terminal-devore-la-ui-tui-pour-tout-le-monde-",
        "level": "Beginner",
        "id": "835982"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Le langage inclusif, un levier d’engagement dans les équipes",
        "summary": "Le langage que nous utilisons au quotidien a un réel impact sur le sentiment d’appartenance et l’engagement des membres d’une équipe. En intégrant des pratiques de communication inclusives, les organisations peuvent créer un environnement où chaque personne se sente reconnue, respectée et valorisée. Cette conférence explore comment le langage inclusif peut devenir un levier puissant pour renforcer la cohésion et la motivation au sein des équipes.\r\nÀ travers des exemples concrets et des études en psycholinguistique, nous analyserons les bénéfices tangibles de l’inclusion par le langage dans le monde professionnel. Nous verrons également comment surmonter les résistances éventuelles et accompagner le changement pour que la communication devienne un moteur d’engagement collectif, en phase avec les valeurs éthiques et les objectifs stratégiques de l’organisation.",
        "speakerIds": [
            "dianemoinet"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.641",
        "description": "",
        "topic": "team",
        "video": null,
        "video2": null,
        "room": "ROOM1",
        "start": "2025-04-29T14:40:00",
        "end": "2025-04-29T15:25:00",
        "photoUrls": [],
        "slug": "le-langage-inclusif-un-levier-d-engagement-dans-les-equipes",
        "level": "Beginner",
        "id": "838110"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Tu te mets combien en responsive CSS ? Edition 2025",
        "summary": "Le responsive en CSS, c’est la base non ? Depuis l’arrivée des smartphones, nos interfaces doivent s’adapter à toutes les tailles d’écrans possibles, du moniteur 4K au plus petit téléphone portable.\r\n \r\nVous faites ça comment, vous ? Au début on n’avait que les breakpoints et une armée de media queries. Puis de nouveaux outils sont arrivés : flexbox, grid, unités relatives… Aujourd’hui avec les container queries et toujours plus d’unités (dvmin, cqh…), nous disposons d’une jungle d’outils et de techniques et rares sont celleux qui peuvent prétendre tous les maîtriser. Alors, vous vous mettez combien en responsive CSS ?\r\n\r\nQue ce soit 1 ou 10, venez (re)découvrir avec nous les mille et une manières de faire du responsive en 2025 : on vous a préparé quelques maquettes, de la plus simple à la plus complexe, que nous allons implémenter en live-coding pour illustrer toutes ces techniques.\r\nOn verra ensemble que pour une fois, c’était pas mieux avant !\r\n",
        "speakerIds": [
            "julien.sulpis",
            "theo.gianella"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM5",
        "start": "2025-04-29T14:40:00",
        "end": "2025-04-29T15:25:00",
        "photoUrls": [],
        "slug": "tu-te-mets-combien-en-responsive-css-edition-2025",
        "level": "Beginner",
        "id": "794595"
    },
    {
        "format": "WORKSHOP",
        "event": "2025",
        "title": "Devenez un Astronaute : Découvrez le Framework Astro",
        "summary": "Un nouveau framework est sorti dans l&#39;univers JavaScript 🌌. C&#39;est Astro 🪐, qui se veut sans JS, orienté contenu, et UI-agnostic. React, Vue, Svelte… il accepte (presque) tout !\r\n\r\nVous voulez faire votre blog ou votre portfolio rapidement sans vous prendre la tête sur le framework ou la lib, contrairement à VitePress, Docusaurus, etc. ? Alors Astro est fait pour vous !\r\n\r\nDans cet atelier, vous allez pouvoir construire une petite application très rapidement et simplement ! Tout en découvrant les fonctionnalités sympas d&#39;Astro ! Devenez un Astronaute avec nous.\r\n\r\nPré-requis:\r\n- Un PC\r\n- Une connexion Internet\r\n- Node et Npm installés",
        "speakerIds": [
            "florent.albert",
            "jeremy.chauvin"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM3",
        "start": "2025-04-29T14:40:00",
        "end": "2025-04-29T16:50:00",
        "photoUrls": [],
        "slug": "devenez-un-astronaute-decouvrez-le-framework-astro",
        "level": "Beginner",
        "id": "800248"
    },
    {
        "format": "WORKSHOP",
        "event": "2025",
        "title": "Redécouvrir la coopération : Atelier de Mob Programming",
        "summary": "Vous est-il déjà arrivé de rester bloqué·e, dans le doute devant un problème complexe, surtout lorsqu&#39;un·e de vos collègues est absent·e ? De constater que votre équipe gère trop de tickets en parallèle et prend trop de temps pour délivrer de la valeur ? De vous impatienter pendant que votre code est relu et validé ?\r\n\r\nImaginez une équipe de développement où l&#39;onboarding se fait à une vitesse fulgurante, et où la sécurité psychologique est le socle permettant à chaque membre d&#39;apporter de la valeur et des idées, d&#39;apprendre des autres et d&#39;être écouté·e. Une équipe éliminant les silos d&#39;information et améliorant la qualité du code produit. Ce n&#39;est pas une utopie, c&#39;est le mob programming !\r\n\r\nVous vous demandez comment une équipe entière peut coder ensemble sur un seul ordinateur ? Le mob peut être redoutablement efficace, joyeux et épanouissant, avec les bonnes pratiques. Et le mieux est de venir l’expérimenter par vous-même.\r\n\r\nRejoignez-nous pour un atelier immersif en partant d’un jeu vidéo pour continuer autour d’un exercice (kata) de code simple où vous découvrirez comment cette approche coopérative peut transformer votre matière de travailler. L&#39;objectif principal de cet atelier n&#39;est pas le code en lui-même, mais de vous faire vivre l&#39;importance de la coopération et de la communication.\r\n\r\nQue vous soyez dev ou non, débutant·e ou confirmé·e, PC ou non, vous êtes toustes les bienvenu·e·s, même pour observer.",
        "speakerIds": [
            "manon.carbonnel",
            "marjorie.aubert"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "team",
        "video": null,
        "video2": null,
        "room": "ROOM4",
        "start": "2025-04-29T14:40:00",
        "end": "2025-04-29T16:50:00",
        "photoUrls": [],
        "slug": "redecouvrir-la-cooperation-atelier-de-mob-programming",
        "level": "Beginner",
        "id": "786829"
    },
    {
        "format": "LIGHTNING_TALK",
        "event": "2025",
        "title": "Rendre transparents les changements des CGUs avec Open Terms Archive",
        "summary": "« Si vous n&#39;êtes pas d&#39;accord avec ces nouvelles conditions, vous pouvez fermer votre compte. Sinon, elles seront considérées comme acceptées. » Vous faites quoi quand vous recevez ce genre de message, vous ? Vous relisez les 60 pages de CGUs ? Non, comme personne d&#39;autre d&#39;ailleurs. Mais si vous pouviez voir juste ce qui a changé, alors ce serait peut-être différent…\r\nOpen Terms Archive est un commun numérique qui enregistre publiquement chaque version des conditions d&#39;utilisation des services en ligne pour en permettre le contrôle démocratique.\r\nQue ce soit pour influencer la gouvernance des grandes plateformes, vérifier la conformité, ou informer les citoyen‧ne‧s, chaque changement est rendu lisible de manière transparente.\r\nDans cette session, nous verrons ce qu&#39;est Open Terms Archive, ce que ce produit a déjà permis, ce qu&#39;il est possible d&#39;en retirer en tant qu&#39;individu, et comment y contribuer.",
        "speakerIds": [
            "MattiSG"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "ethics",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-29T15:50:00",
        "end": "2025-04-29T16:10:00",
        "photoUrls": [],
        "slug": "rendre-transparents-les-changements-des-cgus-avec-open-terms-archive",
        "level": "Beginner",
        "id": "839194"
    },
    {
        "format": "LIGHTNING_TALK",
        "event": "2025",
        "title": "Tests E2E sans stress : Robot Framework à la rescousse 🚀",
        "summary": "Les tests end-to-end vous prennent trop de temps ⏳ ? Vous en avez marre des scripts complexes et des scénarios difficiles à maintenir 😩 ? Et si une solution permettait de rendre tout ça plus fluide et agréable ?\r\n\r\nAvec Robot Framework 🤖, l’automatisation devient un jeu d’enfant 🎮, alliant lisibilité, efficacité et flexibilité.\r\n\r\nVenez découvrir comment cet outil transforme vos scénarios de test en un levier puissant de qualité 💪, tout en restant accessible même aux non-développeurs 👩‍💻👨‍💻. Que vous soyez confronté à des tests complexes ou à des cycles de livraison rapides 🚀, Robot Framework vous apporte la simplicité nécessaire pour garantir une expérience utilisateur irréprochable ✨.\r\n\r\nAprès tout, qui n’aime pas travailler plus intelligemment 😉?",
        "speakerIds": [
            "kabdelouali"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "AMPHI2",
        "start": "2025-04-29T15:50:00",
        "end": "2025-04-29T16:10:00",
        "photoUrls": [],
        "slug": "tests-e2e-sans-stress-robot-framework-a-la-rescousse-",
        "level": "Beginner",
        "id": "839132"
    },
    {
        "format": "LIGHTNING_TALK",
        "event": "2025",
        "title": "Donjons et Pythons: la chevaleresse à la rescousse",
        "summary": "Il était une fois une équipe de chevaliers qui se lança dans une quête pour connecter des robots.\r\nSur leur chemin, ils rencontrèrent un monstre terrible : un Python, long de 5000 lignes, qui les bloquait dans leur progression.\r\nHeureusement, la chevaleresse data était là ! Elle leur suggéra quelques techniques de combat...\r\n\r\nA partir d&#39;une histoire vraie, je te raconte comment j&#39;ai totalement changé la gestion de la data sur un projet, et les différentes façons de faire remonter des données ! Plutôt streaming ou batch ? Tu le sauras à la fin !",
        "speakerIds": [
            "juliette.grillere"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM2",
        "start": "2025-04-29T15:50:00",
        "end": "2025-04-29T16:10:00",
        "photoUrls": [],
        "slug": "donjons-et-pythons-la-chevaleresse-a-la-rescousse",
        "level": "Beginner",
        "id": "825319"
    },
    {
        "format": "LIGHTNING_TALK",
        "event": "2025",
        "title": "&#34;Question pour un conteneur&#34; : Quiz sur les images, les conteneurs, OCI &amp; Docker",
        "summary": "Les conteneurs, ainsi que les technologies permettant de les manipuler, font partie du quotidien de notre vie de Dev ou d&#39;Ops depuis une dizaine d&#39;années maintenant. Nous les utilisons au quotidien, mais les connaît-on si bien ?\r\n\r\nTout au long de ce talk, avec un mix de quiz et de démos en live, vous apprendrez, entre autres, les différents formats qui existent, ainsi que les bonnes pratiques pour les sécuriser, les stocker, leur faire subir un régime et les utiliser sereinement sur plusieurs plateformes.\r\n\r\nUn format original avec un quiz, du fun et des démos, pour les débutants et les confirmés, afin de développer vos connaissances sur le merveilleux monde des conteneurs et leurs technologies ou réviser tout en s&#39;amusant.\r\n\r\nSoyez la ou le plus rapide pour tenter de gagner des cadeaux !",
        "speakerIds": [
            "scraly"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM1",
        "start": "2025-04-29T15:50:00",
        "end": "2025-04-29T16:10:00",
        "photoUrls": [],
        "slug": "-34-question-pour-un-conteneur-34-quiz-sur-les-images-les-conteneurs-oci-amp-docker",
        "level": "Beginner",
        "id": "792988"
    },
    {
        "format": "LIGHTNING_TALK",
        "event": "2025",
        "title": "À la découverte du code golf",
        "summary": "Qui a dit que coder ne pouvait pas être un sport ? Si les jeux vidéo ont droit à leur championnats, et que même les pros d&#39;Excel ont des arènes pour en découdre, sachez que les devs ne sont pas en reste. Le code golf est une compétition où le but est de résoudre un problème grâce à un programme comportant le minimum de caractères. Et c&#39;est tout un art. ",
        "speakerIds": [
            "sonia.seddiki"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-29T16:30:00",
        "end": "2025-04-29T16:50:00",
        "photoUrls": [],
        "slug": "a-la-decouverte-du-code-golf",
        "level": "Beginner",
        "id": "827506"
    },
    {
        "format": "LIGHTNING_TALK",
        "event": "2025",
        "title": "MedTech : Transformons la santé par la data",
        "summary": "Imaginez un monde où chaque donnée médicale sauve des vies. Pourtant, 85% des données de santé restent inexploitées au-delà des soins immédiats. Pourquoi ce paradoxe à l&#39;ère du big data ?\r\n\r\nJe vais vous embarquer dans les coulisses d&#39;un vrai projet data en santé. Mon fil rouge ? Un cas concret, ”la pneumopathie à mycoplasme”. Sans rentrer dans le détail de cette maladie, nous allons décortiquer ensemble comment une donnée récoltée pour soigner un patient peut se transformer en un élément précieux pour la recherche médicale.\r\n\r\nAu programme : \r\n1- une plongée dans le grand bain du RGPD (promis, je ne vais pas vous noyer)\r\n2- les obstacles surprenants de la collecte de données médicales (c&#39;est un vrai parcours du combattant) \r\n3- le futur de la santé (100% réalité, 0% fiction) : l&#39;IA médicale et l&#39;European Health Data Space (EHDS) - entre révolution technologique et débats sur la valorisation des données.\r\n\r\nLe secteur médical est en pleine transformation, avec des projets ambitieux au niveau national et européen. Ce secteur a besoin de nous et de notre expertise tech pour exploiter pleinement ses données et améliorer la prise en charge des patients.\r\n",
        "speakerIds": [
            "montaine.marteau"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "AMPHI2",
        "start": "2025-04-29T16:30:00",
        "end": "2025-04-29T16:50:00",
        "photoUrls": [],
        "slug": "medtech-transformons-la-sante-par-la-data",
        "level": "Beginner",
        "id": "800840"
    },
    {
        "format": "LIGHTNING_TALK",
        "event": "2025",
        "title": "En JavaScript, il y a un paquet pour tout... et souvent pour rien.",
        "summary": "Le petit module is-number totalise chaque semaine plus de 70 millions de téléchargements, tandis que des géants comme react plafonnent à seulement 25 millions. Surprenant, non ?\r\n\r\nMais ce raz-de-marée de dépendances dépassées n’est pas une fatalité. Un groupe de développeurs déterminés, connu sous le nom de e18e (Ecosystem Performance), s&#39;est donné pour mission de rénover l’écosystème JavaScript : un paquet à la fois. Leur objectif ? Nettoyer, accélérer et optimiser l&#39;écosystème JavaScript tout en aidant la communauté à réduire les dépendances inutiles.\r\n\r\nLe plus incroyable, c’est que toi aussi, tu peux contribuer à ce changement ! Que ce soit au sein de tes bibliothèques ou dans tes applications web, tu peux intégrer ces bonnes pratiques sans effort. Pour t’y aider, l’équipe e18e et la communauté ont conçu une panoplie d’outils :\r\nRègles ESLint\r\nPlugins Vite\r\nOutils pour CI/CD\r\n\r\nViens découvrir comment améliorer tes pipelines, réduire la taille de tes builds, simplifier la maintenance de tes projets, et même limiter la surface d’attaque de ton application. Rejoins-nous pour explorer comment rendre JavaScript plus propre, plus rapide et plus sûr !",
        "speakerIds": [
            "e.soubiran25"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM2",
        "start": "2025-04-29T16:30:00",
        "end": "2025-04-29T16:50:00",
        "photoUrls": [],
        "slug": "en-javascript-il-y-a-un-paquet-pour-tout-et-souvent-pour-rien-",
        "level": "Beginner",
        "id": "837591"
    },
    {
        "format": "LIGHTNING_TALK",
        "event": "2025",
        "title": "Mieux inclure la diversité de genre dans le monde du Libre : ça passe aussi par la radio !",
        "summary": "Le logiciel libre n&#39;est pas que pour les hommes ! Mais ça ne se voit pas… Comme ailleurs, la domination masculine est un problème dans le monde informatique et dans les communautés libristes.\r\n\r\nMaintenant, imaginez avoir la chance de pouvoir diffuser chaque semaine en direct sur la bande FM une émission sur les libertés informatiques : vous n&#39;en profiteriez pas pour contribuer à démasculiniser tout ça ?\r\n\r\nC&#39;est ce qu&#39;on s&#39;est dit dans l&#39;équipe de « Libre à vous ! » et que nous faisons avec joie depuis 2018 !\r\n\r\nVenez découvrir les actions que nous mettons en place pour donner de la voix - et de la lumière ! - aux femmes et autres minorités de genre présentes dans le monde du Libre.",
        "speakerIds": [
            "ivanni",
            "mgarnero"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "ethics",
        "video": null,
        "video2": null,
        "room": "ROOM1",
        "start": "2025-04-29T16:30:00",
        "end": "2025-04-29T16:50:00",
        "photoUrls": [],
        "slug": "mieux-inclure-la-diversite-de-genre-dans-le-monde-du-libre-ca-passe-aussi-par-la-radio-",
        "level": "Beginner",
        "id": "837016"
    },
    {
        "format": "KEYNOTE",
        "event": "2025",
        "title": "Design : sabotage, hacking &amp; politique.",
        "summary": "Au travers d&#39;un témoignage singulier, Geoffrey Dorne abordera ses questionnements sur les enjeux du design graphique et numérique contemporain. Des enjeux politiques, environnementaux, sociaux, financiers... Il présentera également ses nombreux projets comme des formes graphiques et numériques de contestation enthousiaste et impliquée. Vous ne repartirez peut-être pas avec toutes les réponses mais certainement avec beaucoup de questions.",
        "speakerIds": [
            "GeoffreyDorne"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "aliens",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-29T17:00:00",
        "end": "2025-04-29T17:30:00",
        "photoUrls": [],
        "slug": "design-sabotage-hacking-amp-politique-",
        "level": "Beginner",
        "id": "867468"
    },
    {
        "format": "KEYNOTE",
        "event": "2025",
        "title": "Faut-il changer d&#39;ère numérique pour préserver la démocratie ?",
        "summary": "Internet dans les années 1990, puis les réseaux sociaux dans les années 2000, ont fait miroité la promesse d&#39;un rapport renouvelé au débat public et à la liberté d&#39;expression. Qu&#39;en est-il aujourd&#39;hui ? À l&#39;heure où certains alertent sur les dangers de la désinformation en ligne et en appellent à une meilleure modération tandis que d&#39;autres dénoncent les modérations excessives et sont prêts à acheter des réseaux sociaux comme Twitter au nom de la &#34;liberté d&#39;expression&#34;, l&#39;heure est venue de se poser la question de l&#39;impact des réseaux sociaux sur les individus et la société.\r\n\r\nLes réseaux sociaux sont-ils compatibles avec la démocratie et si oui à quelles conditions ? Dans le sillage de &#34;Toxic Data - Comment les réseaux manipulent nos opinions&#34; (Chavalarias D. 2023 Ed. Champs), cette conférence interrogera à partir d&#39;exemples concrets l&#39;impact des réseaux sociaux, de leurs effets sur nos vies jusqu&#39;à leurs impacts géopolitiques, avec en toile de fond l&#39;arrivée d&#39;une nouvelle catégorie d&#39;acteurs : les intelligences artificielles.",
        "speakerIds": [
            "f2210236-eac4-49c2-be02-af1fa3650bb3"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "aliens",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-30T09:30:00",
        "end": "2025-04-30T10:00:00",
        "photoUrls": [],
        "slug": "faut-il-changer-d-39-ere-numerique-pour-preserver-la-democratie-",
        "level": "Beginner",
        "id": "867471"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Les Threads Virtuels vont-ils rendre la programmation reactive obsolète?",
        "summary": "Java 21 a été publié il y a environ un an et demi, et parmi les nouveautés de cette version se trouvent les threads virtuels, apportés par le projet Loom. Une des choses qu&#39;ils apportent est la possibilité de revenir au modèle &#34;un thread par requête&#34;, tout en maximisant l&#39;utilisation du CPU, quelque chose qui n&#39;est possible qu&#39;avec la programmation réactive. Comment les threads virtuels peuvent-ils apporter de telles performances ? Rendent-ils vraiment le modèle réactif obsolète ? Et d&#39;ailleurs que signifie l&#39;obsolescence dans ce contexte ? Voici les questions auxquelles nous allons répondre dans cette présentation. Les threads virtuels ne coûtent pas cher, on peut en créer autant que l&#39;on veut. Ils apportent une nouvelle API : la concurrence structurée, qui apporte un nouveau modèle de programmation asynchrone, plus simple que le modèle réactif. Le dernier élément qui complète le tout sont les ScopedValue, qui visent à remplacer les variables ThreadLocal, dont nous parlerons aussi.",
        "speakerIds": [
            "jose.paumard"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.642",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-30T10:20:00",
        "end": "2025-04-30T11:05:00",
        "photoUrls": [],
        "slug": "les-threads-virtuels-vont-ils-rendre-la-programmation-reactive-obsolete-",
        "level": "Intermediate",
        "id": "831072"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Les accidents du travail dans la tech",
        "summary": "Dans l&#39;imaginaire collectif un accident c&#39;est d&#39;abord «pas de chance».\r\nAu travail c&#39;est trop souvent «un problème individuel»\r\nEt dans la tech «on est pas vraiment concernée».\r\n\r\nVraiment?\r\n\r\nCette présentation démarra quelques généralité sur l’accidentologie du travail, pour ensuite mettre le projecteur sur ce à quoi nous sommes exposées dans nos métiers.\r\n\r\nNotre expérience respective en représentation du personnel permettra de rendre tous ça très concret et on est prêt a parier que vous allez apprendre des choses concrète pour vous et/ou vos collègues «tecos».",
        "speakerIds": [
            "431a0039-9160-4e34-81ee-7888dac21d27",
            "bd3298b6-2b7f-49b3-836e-7176ac9b4c0a"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.643",
        "description": "",
        "topic": "team",
        "video": null,
        "video2": null,
        "room": "AMPHI2",
        "start": "2025-04-30T10:20:00",
        "end": "2025-04-30T11:05:00",
        "photoUrls": [],
        "slug": "les-accidents-du-travail-dans-la-tech",
        "level": "Beginner",
        "id": "838130"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "La réactivité et les signaux : démystifions la magie du frontend",
        "summary": "Certaines choses dans l’univers resteront sans réponse, mais la réactivité et les signaux ne devraient pas en faire partie.\r\n\r\nDepuis plusieurs années, la réactivité (et son concept clé : les signaux) s’est imposée sur toute la scène frontend. Que ce soit dans Vue.js, Angular, React, Svelte, Solid, Qwik, ou Preact, ces notions sont partout. Pourtant, malgré leur popularité, il est souvent difficile de comprendre ce qui se cache réellement derrière les signaux.\r\n\r\nOn entend parler de tracking, de proxies, d’états dérivés, et même d’effects, mais… de quoi parle-t-on vraiment ? Comment ces mécanismes permettent-ils à des valeurs d’&#34;écouter&#34; et de réagir aux changements d’autres ? Quelle est cette &#34;sorcellerie&#34; qui met à jour nos interfaces en temps réel, simplement en assignant une nouvelle valeur à une variable ?\r\n\r\nDans cette session, plonge dans le monde fascinant (et parfois mystérieux) de la réactivité et des signaux. Ensemble, nous décortiquerons une bibliothèque comme Alien Signals, pour démystifier ces concepts et enfin comprendre la mécanique qui se cache derrière cette &#34;magie&#34; du frontend.",
        "speakerIds": [
            "e.soubiran25"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.643",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM2",
        "start": "2025-04-30T10:20:00",
        "end": "2025-04-30T11:05:00",
        "photoUrls": [],
        "slug": "la-reactivite-et-les-signaux-demystifions-la-magie-du-frontend",
        "level": "Advanced",
        "id": "837594"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Smartphone et accessibilité : Découvrez et apprenez en jouant !",
        "summary": "De nos jours, nos smartphones sont presque indispensables pour interagir avec le monde qui nous entoure. Pourtant, tout le monde n’y a pas accès de la même manière. Savez-vous par exemple si l&#39;expérience utilisateur de votre application native ou web est optimale pour les personnes non-voyantes utilisant un lecteur d’écran ?\r\n\r\nVenez tester vos connaissances sur le sujet à travers un quiz interactif, tout en apprenant comment améliorer l’expérience utilisateur de vos applications pour les personnes utilisant un lecteur d’écran.\r\n\r\nNous irons au-delà des pratiques classiques d&#39;accessibilité, comme l’ajout de textes alternatifs. Vous découvrirez des techniques avancées, telles que l’utilisation d’actions personnalisées pour réduire le nombre de gestes nécessaires à la navigation sur un écran.  \r\n\r\nPréparez-vous à découvrir des astuces qui rendront vos applications plus fluides et intuitives, pour le plus grand bonheur de vos utilisateurs et utilisatrices aveugles.\r\n\r\n**Bonus 🎁 :** La personne ayant le meilleur score au quiz recevra un petit cadeau !",
        "speakerIds": [
            "fanny.pluvinage"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.643",
        "description": "",
        "topic": "team",
        "video": null,
        "video2": null,
        "room": "ROOM1",
        "start": "2025-04-30T10:20:00",
        "end": "2025-04-30T11:05:00",
        "photoUrls": [],
        "slug": "smartphone-et-accessibilite-decouvrez-et-apprenez-en-jouant-",
        "level": "Beginner",
        "id": "798646"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Ma vie de développeur web dans le quantique",
        "summary": "“Quantique”. Souvent utilisé à tort et à travers, ce mot véhicule tout un tas d’images erronées ou purement fictives. Pourtant, nous sommes déjà entourés d’objets qui mettent en pratique cette branche de la physique. En l’appliquant maintenant à la conception d’ordinateurs d’un type nouveau, l’informatique quantique ouvre de nouvelles portes en matière de puissance et d’efficacité de calcul.\r\n\r\nDéveloppeur web chez Pasqal, acteur majeur du domaine qui conçoit ses propres processeurs quantiques, je vous propose un aperçu de l’intérieur de cette révolution. On verra sur quels principes et comment l’écosystème de l’informatique quantique se construit rapidement, et on répondra à cette question : ça veut dire quoi faire du web aux côtés de physiciens qui travaillent à l’échelle de l’atome ?",
        "speakerIds": [
            "benjamin.becquet"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.643",
        "description": "",
        "topic": "aliens",
        "video": null,
        "video2": null,
        "room": "ROOM5",
        "start": "2025-04-30T10:20:00",
        "end": "2025-04-30T11:05:00",
        "photoUrls": [],
        "slug": "ma-vie-de-developpeur-web-dans-le-quantique",
        "level": "Beginner",
        "id": "832158"
    },
    {
        "format": "WORKSHOP",
        "event": "2025",
        "title": "Workshop async-profiler",
        "summary": "🚨 CPU qui s&#39;emballe ? OutOfMemory qui frappe sans prévenir ? Votre application Java vous fait des caprices en production ?\r\n\r\nDécouvrez [async-profiler](https://github.com/async-profiler/async-profiler), le couteau suisse du diagnostic de performance pour les applications Java. Plus besoin de naviguer à l&#39;aveugle dans votre code !\r\n\r\nDans ce workshop pratique, vous apprendrez à :\r\n- appréhender async-profiler en conditions réelles\r\n- décrypter les FlameGraphs pour identifier les goulots d&#39;étranglement\r\n- simuler des scénarios de charge réalistes avec k6\r\n- diagnostiquer et résoudre les problèmes de performance courants\r\n\r\nUn workshop hands-on destiné aux développeurs évoluant dans l&#39;écosystème JVM. Focus sur la pratique : pas de théorie complexe, mais des outils concrets pour booster vos compétences en diagnostic performance.\r\n\r\nVenez avec votre laptop, repartez avec des compétences immédiatement applicables en production !\r\n\r\n👩‍💻 À qui s’adresse ce workshop ?\r\nAux développeurs JVM, qu’ils soient novices ou expérimentés, cherchant à enrichir leur arsenal pour analyser et résoudre les problèmes de performance.\r\n\r\n📋 Préparez votre terrain de jeu :\r\n - Linux ou Mac (désolé, Windows n’est pas invité à la fête)\r\n - Java 17&#43;, Docker Compose, k6 (ou Docker)\r\n - Ou utilisez notre environnement Gitpod préconfiguré pour un démarrage rapide\r\n\r\nVenez découvrir, apprendre, et surtout pratiquer. Parce qu’avec les bons outils, chaque problème a sa solution.\r\n",
        "speakerIds": [
            "106558503016616394107"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.643",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM3",
        "start": "2025-04-30T10:20:00",
        "end": "2025-04-30T12:15:00",
        "photoUrls": [],
        "slug": "workshop-async-profiler",
        "level": "Beginner",
        "id": "825309"
    },
    {
        "format": "WORKSHOP",
        "event": "2025",
        "title": "Nos corps biologiques à la rescousse pour comprendre “l’intelligence artificielle”",
        "summary": "Les algos d’IA ont souvent une aura magique dans l’imaginaire des gens. La SF et le journalisme de sensation véhiculent beaucoup de fantasmes à leurs sujets. Pourtant, actuellement, ces algos restent généralement élémentaires et ils sont plus impressionnants par la formidable percée en puissance de calcul des ordinateurs que par une supposée “intelligence” supérieure.\r\n\r\nÀ vrai dire, il est possible de sentir le fonctionnement de certains algos avec les mains, par des activités simples, sans ordinateur. Quelques billes de couleur, bâtonnets, gobelets et autres jetons remplacent processeurs, RAM et disques durs, pour faire tourner ces algos de manière ludique, tangible et visuelle.\r\n\r\nC’est ce que vous allez faire durant cet atelier : dérouler des algos d’IA avec vos mains, qui vont “bêtement” jouer à des jeux (comme le Mastermind ou le jeu de NIM), et vous allez sentir/voir qu&#39;ils ne sont pas si sorciers. On reprendra ensuite quand même un petit peu l’ordinateur pour poursuivre l’exploration du fonctionnement de ces algorithmes de manière ludique et visuelle.",
        "speakerIds": [
            "besbes.ines",
            "decoster"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.643",
        "description": "",
        "topic": "aliens",
        "video": null,
        "video2": null,
        "room": "ROOM4",
        "start": "2025-04-30T10:20:00",
        "end": "2025-04-30T12:15:00",
        "photoUrls": [],
        "slug": "nos-corps-biologiques-a-la-rescousse-pour-comprendre-l-intelligence-artificielle-",
        "level": "Beginner",
        "id": "839950"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "L&#39;architecture, pour tout le monde, partout, tout le temps",
        "summary": "Avec la complexité croissante des systèmes logiciels, le sens de l&#39;histoire est clair : l’architecture est de plus en plus l’affaire de tous, tout le temps, et partout. Si vous êtes dev, vous participez donc de plus en plus aux décisions d’architecture, et c’est mieux ainsi. Mais quel est le minimum à savoir parmi toute l’étendue du sujet, sans être expert de tout, et comment évolue le rôle des architectes ?\r\n\r\nCette session rythmée vous donnera les principales clés pour améliorer votre quotidien dans vos projets, de la posture face à un problème jusqu’aux techniques pour intégrer des modules, minimiser les besoins de coordination et assurer la cohérence à l’échelle. Vous ne verrez peut-être plus tout à fait l&#39;architecture comme avant !",
        "speakerIds": [
            "cyrillemartraire"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.643",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-30T11:30:00",
        "end": "2025-04-30T12:15:00",
        "photoUrls": [],
        "slug": "l-39-architecture-pour-tout-le-monde-partout-tout-le-temps",
        "level": "Intermediate",
        "id": "839844"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Spring Boot, la fin de la 3ème génération",
        "summary": "Cette présentation sera un mix de diapositives et d’exemples de code.\r\n\r\nNous aborderons les fonctionnalités liées à la plateforme comme les logs structurés, le contrôle d&#39;accès à Actuator amélioré et les nouveautés de l&#39;observabilité.\r\n\r\nIl y aura également un segment dédié à la nouvelle annotation « &#64;Fallback » dans Spring Framework et à la manière dont elle se rapporte à « &#64;Primary », « &#64;ConditionalOnMissingBean », aux beans candidates par défaut et aux auto-configurations en général.\r\n\r\nSpring a amélioré le support des tests web grâce à MockMvcTester: vous pouvez maintenant tester vos contrôleurs web avec des assertions AssertJ, sans démarrer un serveur web!\r\n\r\nSpring Boot 3.5 sera la dernière étape avant la version 4.0, préparant le terrain pour les mises à niveau (Maven, Gradle) et les changements d&#39;infrastructure. Nous discuterons des efforts en cours pour les prochaines versions majeures, notamment la prise en charge de JSpecify dans les API Spring et la gestion de null dans Java.\r\n\r\n",
        "speakerIds": [
            "brian.clozel",
            "stephane.nicoll"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.643",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "AMPHI2",
        "start": "2025-04-30T11:30:00",
        "end": "2025-04-30T12:15:00",
        "photoUrls": [],
        "slug": "spring-boot-la-fin-de-la-3eme-generation",
        "level": "Intermediate",
        "id": "831521"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Double authentification : parlons-en",
        "summary": "La double authentification, vous connaissez en tant qu&#39;utilisateur, mais avez-vous déjà envisagé de l&#39;ajouter sur les applis dont vous avez la charge en tant que technicien·ne ?\r\n\r\nJe voudrais insister sur l&#39;importance de se poser cette question, dans un contexte où le nombre de fuites de données personnelles est en augmentation nette et inquiétante. Sauf que les données personnelles, elles ne « fuient » pas toutes seules sur leurs petites pattes… Si la double authentification n&#39;est pas la solution à tout, elle permet de faire un premier pas, et d&#39;ajouter une protection efficace sans être expert·e en sécurité. Encore faut-il le faire correctement et comprendre ce que l&#39;on fait…\r\n\r\nAlors je vous propose un petit tour du vocabulaire et des outils relatifs à l&#39;authentification des humains dans un système informatique : par exemple, on parlera d&#39;authentification forte, de TOTP, d&#39;un certain nombre de clés, de système asymétrique… Ensuite, je vous montrerai comment ajouter tout cela de façon ciblée et efficace dans vos applications grand public.",
        "speakerIds": [
            "tut_tuuut"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.643",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM2",
        "start": "2025-04-30T11:30:00",
        "end": "2025-04-30T12:15:00",
        "photoUrls": [],
        "slug": "double-authentification-parlons-en",
        "level": "Beginner",
        "id": "832231"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Penser l’accessibilité numérique avec les handicaps cognitifs",
        "summary": "Les troubles cognitifs impactent la façon dont les personnes traitent l’information. Ces troubles connaissent un intérêt croissant dans le domaine de l’accessibilité numérique. Ils constituent un ensemble de troubles hétérogènes, et leurs impacts sur les interactions numériques sont variés. Leur compréhension et leur prise en compte dans la conception numérique sont cruciales pour garantir une expérience inclusive pour tous les utilisateurs et toutes les utilisatrices.\r\n\r\nCette conférence vise à sensibiliser aux besoins des utilisateurs et utilisatrices ayant un troubles cognitifs et apporter des pistes concrètes pour mieux les inclure dans une conception numérique accessible. Après un état des lieux de la prise en compte des troubles cognitifs dans les référentiels d’accessibilité numérique, cette présentation offrira un tour d’horizon des grandes fonctions cognitives et de leurs troubles en identifiant les obstacles potentiels et règles à suivre pour concevoir des interfaces accessibles aux personnes handicapées cognitives.",
        "speakerIds": [
            "lfanuel"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.643",
        "description": "",
        "topic": "ethics",
        "video": null,
        "video2": null,
        "room": "ROOM1",
        "start": "2025-04-30T11:30:00",
        "end": "2025-04-30T12:15:00",
        "photoUrls": [],
        "slug": "penser-l-accessibilite-numerique-avec-les-handicaps-cognitifs",
        "level": "Beginner",
        "id": "826123"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Highway to fail, ou l&#39;histoire d&#39;un échec prévisible",
        "summary": "Vous hésitez à vous lancer dans l’aventure de la startup ? Vous vous verriez bien créer votre propre société, mais vous n’osez pas ? En effet, on le sait maintenant, 90 % des start-up font faillite, dont 10 % dès la première année.\r\n\r\nFin 2017, je rejoignais 2 autres cofondateurs pour créer notre première startup. Et mi-2019, nous mettions la clé sous la porte. Pourquoi ? Entre produit, technique, business et humain, il est parfois difficile d’ajuster le curseur.\r\n\r\nA travers mon retour d’expérience entrepreneuriale, je souhaite revenir sur certaines de nos erreurs et voir s’il aurait été possible de faire autrement. Peut-être que cette introspection pleine d’honnêteté pourra vous permettre d’éviter certains écueils.",
        "speakerIds": [
            "celine-louvet"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.643",
        "description": "",
        "topic": "team",
        "video": null,
        "video2": null,
        "room": "ROOM5",
        "start": "2025-04-30T11:30:00",
        "end": "2025-04-30T12:15:00",
        "photoUrls": [],
        "slug": "highway-to-fail-ou-l-39-histoire-d-39-un-echec-previsible",
        "level": "Beginner",
        "id": "838924"
    },
    {
        "format": "KEYNOTE",
        "event": "2025",
        "title": "TBA",
        "summary": "",
        "speakerIds": [
            "1cdd53ea-68d1-4acf-b832-3662da09d116"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.643",
        "description": "",
        "topic": "aliens",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-30T14:00:00",
        "end": "2025-04-30T14:30:00",
        "photoUrls": [],
        "slug": "tba",
        "level": "Beginner",
        "id": "868820"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Un Pixel, puis un autre : Comment faire tourner DOOM sur une liseuse électronique 🕹️",
        "summary": "DOOM est un jeu culte qui a été porté des milliers de fois sur toutes sortes de supports, alors pourquoi ne pas essayer de le faire tourner sur ma liseuse électronique Kindle ?\r\n\r\nJe n’ai absolument aucune expérience en portage de jeux mais j’ai décidé de tenter l’expérience, un peu par curiosité, un peu pour le défi ! Je vous propose de suivre mon périple, un pixel après l’autre, pour jouer à DOOM avec de l’encre électronique.\r\n\r\nCa sera l&#39;occasion de parler d&#39;écrans 8 bits, d&#39;architecture processeur et de bricolage technique pour faire marcher tout ca\r\net bien sûr d&#39;une démo de DOOM en encre électronique 🚀",
        "speakerIds": [
            "moustapha-agack"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.643",
        "description": "",
        "topic": "aliens",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-30T14:40:00",
        "end": "2025-04-30T15:25:00",
        "photoUrls": [],
        "slug": "un-pixel-puis-un-autre-comment-faire-tourner-doom-sur-une-liseuse-electronique-",
        "level": "Beginner",
        "id": "827750"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Faut-il déconstruire l’intelligence artificielle?",
        "summary": "Avec GPT-4o, OpenAI a mis au point une IA multimodale, capable d’accomplir des tâches diverses – lecture, dialogue, vision – avec une ambition claire : tendre vers une intelligence artificielle générale. Cette approche préconise une structure monolithique pour les applications qui mobilisent l’intelligence artificielle. Plutôt qu’utiliser plusieurs modèles spécialisés, il faudrait s’appuyer sur une seule IA pour tout faire. Cette vision monolithique s’oppose cependant à l’architecture logicielle traditionnelle qui recommande une structure modulaire. Faut-il donc déconstruire l&#39;IA monolithique et la décomposer en IA modulaires ? \r\n\r\nAvec ce talk, nous explorerons différentes significations du verbe &#34;déconstruire&#34; pour mieux saisir les enjeux actuels de l&#39;IA. Nous examinerons les avantages et les inconvénients de l&#39;architecture monolithique par rapport à une architecture modulaire dans le contexte de l&#39;IA à travers des exemples d’applications. En passant de modèles spécialisés à une IA monolithique, on transfère la complexité du code vers l&#39;IA elle-même. C’est pourquoi, nous viendrons ensuite déconstruire ou plutôt démonter une IA multimodale pour décrypter son architecture complexe.",
        "speakerIds": [
            "5629542f-10c1-4e94-be75-2039c99162dd"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.644",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "AMPHI2",
        "start": "2025-04-30T14:40:00",
        "end": "2025-04-30T15:25:00",
        "photoUrls": [],
        "slug": "faut-il-deconstruire-l-intelligence-artificielle-",
        "level": "Beginner",
        "id": "835323"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Améliorer l&#39;implémentation du feature flip pour réussir à avoir du flow",
        "summary": "Vous utilisez peut-être le feature flipping dans vos projets et vous considérez cette technique indispensable. Mais les devs s&#39;arrachent les cheveux à la moindre évolution avec toutes les combinaisons de feature flips à gérer. Tout ça combiné fait que le feature flipping devient dur à maintenir voire détesté par les devs. On finit par avoir des if/else envahissants dans le code, sans prendre le temps de faire le ménage pour éliminer les feature flips devenus inutiles.\r\nJe vous propose d&#39;autres alternatives au feature flipping traditionnel. Selon le contexte, on verra des alternatives touchant l&#39;organisation du travail, la priorisation des besoins et des solutions de design comme des techniques de gestion de legacy (strangler application pattern ou branch by abstraction) ou le circuit breaker voire même Domain Driven Design.",
        "speakerIds": [
            "dorra.bartaguiz"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.644",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM2",
        "start": "2025-04-30T14:40:00",
        "end": "2025-04-30T15:25:00",
        "photoUrls": [],
        "slug": "ameliorer-l-39-implementation-du-feature-flip-pour-reussir-a-avoir-du-flow",
        "level": "Intermediate",
        "id": "836750"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Réduire les risques de sécurité : comment intégrer l&#39;IA pour une gestion de projet stratégique ?",
        "summary": "L&#39;année 2024 a marqué un record sans précédent en matière de violations de données. La question se pose : faut-il systématiquement intégrer des équipes cyber à tous les projets, ou peut-on s’appuyer sur des solutions d’intelligence artificielle pour réduire les risques efficacement ? Cette conférence explore comment intégrer la sécurité dès les premières phases d’un projet informatique. Nous examinerons les apports de l’IA pour anticiper les menaces, renforcer la protection des systèmes et améliorer la capacité de réponse en cas d’incident.",
        "speakerIds": [
            "m.jarrar"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.644",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM1",
        "start": "2025-04-30T14:40:00",
        "end": "2025-04-30T15:25:00",
        "photoUrls": [],
        "slug": "reduire-les-risques-de-securite-comment-integrer-l-39-ia-pour-une-gestion-de-projet-strategique-",
        "level": "Beginner",
        "id": "815159"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Un développeur sous couverture parmi les utilisateurs",
        "summary": "Quand on parle de DDD, on parle du fait qu&#39;un développeur doit s&#39;intéresser avant tout au métier du logiciel qu&#39;il doit implémenter.\r\n\r\nOui, mais comment ? en posant quelques questions à un proxy PO ? en cherchant la signification de certains mots clés sur google ? en faisant des réunions de &#34;raffinages&#34; interminables avec des business analysts ?\r\n\r\nPersuadé que la seule manière de comprendre vraiment un métier est de travailler en contact direct avec de vrais utilisateurs, je suis parti en mission d&#39;infiltration dans une société pour développer un nouveau produit et mettre en pratique cette théorie.\r\n\r\nMais en quoi consiste cette approche ? comment j&#39;ai convaincu le client de l&#39;adopter ? et surtout comment ça s&#39;est passé ? je vous détaillerai tout ça au cours de ce talk.\r\n\r\nLa suite va vous étonner.",
        "speakerIds": [
            "aurelien"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.644",
        "description": "",
        "topic": "team",
        "video": null,
        "video2": null,
        "room": "ROOM5",
        "start": "2025-04-30T14:40:00",
        "end": "2025-04-30T15:25:00",
        "photoUrls": [],
        "slug": "un-developpeur-sous-couverture-parmi-les-utilisateurs",
        "level": "Beginner",
        "id": "829111"
    },
    {
        "format": "WORKSHOP",
        "event": "2025",
        "title": "(Slow (code) retreat)",
        "summary": "&#34;La Simplicité, l&#39;art de maximiser le travail non-fait, est essentielle!&#34;… On n&#39;y est pas !\r\n\r\nIl serait peut être temps de faire quelque chose contre le burn-out de plus en plus présent dans notre industrie?\r\n\r\nVenez essayer le slow-programming ! Après une réflexion de groupe, vous découvrirez et expérimenterez 6 différentes pratiques de slow-programming: Slow pair programming, Slow feedback, Slow code-reviews, Slow TODO list, Slow coding, et Slow  ROTI ! Vous pouvez vous attendre à:\r\n\r\n- Moins de stress, en vous concentrant sur ce que vous faites MAINTENANT, dans le moment présent\r\n- Plus de création de valeur, en concentrant vos efforts sur ce qui importe vraiment\r\n- Moins de dette technique\r\n- De meilleures interactions avec vos collègues\r\n- De meilleures décisions grâce à plus de clarté sur ce qu&#39;il faut faire\r\n- De meilleures chances de gérer les défis éthiques de notre industrie\r\n- Des familles plus heureuses avec moins de stress ramener à la maison!\r\n- Une forme de pratique du zen au travers de la programmation\r\n- Plus d&#39;entraide\r\n\r\nVenez tester notre slow-dojo!",
        "speakerIds": [
            "mathieucans",
            "philippe.bourgau"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.644",
        "description": "",
        "topic": "aliens",
        "video": null,
        "video2": null,
        "room": "ROOM3",
        "start": "2025-04-30T14:40:00",
        "end": "2025-04-30T16:30:00",
        "photoUrls": [],
        "slug": "-slow-code-retreat-",
        "level": "Advanced",
        "id": "821320"
    },
    {
        "format": "WORKSHOP",
        "event": "2025",
        "title": "&#34;Mais qu&#39;est ce qu&#39;on va devenir ?&#34; - Le métier de dev passé au crible des scénarios de l&#39;ADEME",
        "summary": "Il est désormais acté que le numérique est une source non négligeable du dérèglement climatique actuel. Et lorsque l&#39;on commence à creuser ce sujet, on finit souvent par se demander si nos métiers ont encore un avenir.\r\n\r\nDans son exercice de projection &#34;Transitions 2050&#34;, l&#39;ADEME a défini 4 scénarios pour atteindre la neutralité carbone d&#39;ici à 2050. De la génération frugale au pari réparateur, venez découvrir ces différents scénarios et vous projeter dans chacun d&#39;entre eux pour imaginer avec nous l&#39;évolution de nos métiers et les adaptations qui seront nécessaires pour atteindre cet objectif. \r\n\r\nAprès avoir réfléchi en petits groupes sur les différents scénarios, nous effectuerons une mise en commun des conclusions. Et nous terminerons par un petit débat pour que chacun se positionne sur le ou les futurs qui lui semblent les plus désirables.",
        "speakerIds": [
            "ceciliaBossard",
            "jean-palies"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.644",
        "description": "",
        "topic": "ethics",
        "video": null,
        "video2": null,
        "room": "ROOM4",
        "start": "2025-04-30T14:40:00",
        "end": "2025-04-30T16:30:00",
        "photoUrls": [],
        "slug": "-34-mais-qu-39-est-ce-qu-39-on-va-devenir-34-le-metier-de-dev-passe-au-crible-des-scenarios-de-l-39-ademe",
        "level": "Beginner",
        "id": "820251"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Les super-pouvoirs méconnus de Docker Desktop",
        "summary": "Dans un monde où le développement logiciel ne cesse de se complexifier, la frontière entre les préoccupations des développeurs et celles des administrateurs système devient de plus en plus floue. Docker Desktop, souvent perçu comme un simple VM pour faire de la conteneurisation sous MacOs et Windows, cache en réalité un arsenal de fonctionnalités méconnues qui peuvent révolutionner vos workflows de développement et d&#39;exploitation.\r\nÀ travers une série de démonstrations live, Guillaume et Philippe vous plongeront dans les coulisses de Docker Desktop en abordant les problématiques quotidiennes qui font grincer des dents : des builds interminables aux déploiements Kubernetes capricieux, en passant par la gestion des vulnérabilités et la gouvernance des images. Vous découvrirez comment cet outil peut non seulement simplifier la vie des développeurs, mais aussi devenir le meilleur allié des administrateurs système dans leur quête de &#34;sécurité et de contrôle&#34;.\r\nCette session technique, ponctuée d&#39;exemples concrets et de cas d&#39;usage réels, vous révélera les dernières fonctionnalités de Docker Desktop qui en font un véritable &#34;couteau suisse&#34; de la modernisation des pratiques DevOps.",
        "speakerIds": [
            "guillaumelours",
            "ph.charriere"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.644",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-30T15:45:00",
        "end": "2025-04-30T16:30:00",
        "photoUrls": [],
        "slug": "les-super-pouvoirs-meconnus-de-docker-desktop",
        "level": "Beginner",
        "id": "836767"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Why Brian can&#39;t code in the kitchen ;-)",
        "summary": "Comme beaucoup de français, tu as peut-être juré de ne plus jamais utiliser la langue de Shakespeare une fois le bac terminé ! Mais… tu as choisi l’informatique… GAME OVER!\r\n\r\nJe suis américaine native et formatrice en anglais depuis 20 ans pour le public français. Beaucoup de mes stagiaires se sentent “nul en anglais”, enfermés dans cette INFINITE LOOP de la cuisine de Brian parce qu’ils n’ont pas retenu toute la liste de verbes irréguliers! Il est encore temps de faire un BREAK de ses peurs et RESTART sur de bonnes bases.\r\nEn effet la cuisine de Brian, l’ancienne méthode d’enseignement qui s’appuie beaucoup sur l’apprentissage par coeur, est beaucoup trop étroite pour développer ta créativité… pour coder… pour t’exprimer… t’ouvrir de nouvelles portes ! Si tu n’as pas réussi à retenir ne serait-ce que la moitié de la liste de verbes irréguliers, ou tu n’as pas réussi à bien faire la différence entre I was going, I went, et I have gone, ce talk est pour toi! \r\nBonne nouvelle, ce n’est pas forcément de ta faute et il existe d’autres méthodes très efficaces pour y remédier… \r\n\r\nJe vais donner quelques astuces et bons plans qui ont fait leurs preuves avec mes stagiaires et qui permettent d’avancer efficacement en anglais au quotidien. \r\nEt après, promis Brian will EXIT ;)\r\n",
        "speakerIds": [
            "sonyth.huber"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.644",
        "description": "",
        "topic": "aliens",
        "video": null,
        "video2": null,
        "room": "AMPHI2",
        "start": "2025-04-30T15:45:00",
        "end": "2025-04-30T16:30:00",
        "photoUrls": [],
        "slug": "why-brian-can-39-t-code-in-the-kitchen-",
        "level": "Beginner",
        "id": "839814"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Comment nous avons transformé les Restos du Coeur en Cloud Provider",
        "summary": "Cette conférence vous plongera au cœur d&#39;une transformation audacieuse, où les Restos du Cœur ont évolué pour devenir un fournisseur de services Cloud (en interne). À travers cette histoire captivante, nous explorerons en détail le projet de construction d&#39;une plateforme de cloud privé reposant sur les technologies robustes d&#39;OpenStack et de Kubernetes.\r\n\r\nNous commencerons par discuter des motivations derrière cette initiative avant-gardiste, mettant en lumière les défis uniques rencontrés dans l&#39;adaptation de concepts de cloud computing au sein d&#39;une organisation à but non lucratif. Nous examinerons également les raisons qui ont conduit à choisir OpenStack comme pilier fondamental de cette transformation et démontrerons pourquoi, même en 2024, il reste une option pertinente et performante.\r\n\r\nAu cours de la présentation, nous plongerons dans les détails techniques de l&#39;infrastructure, décrivant la conception de la plateforme de cloud privé, son architecture basée sur OpenStack et Kubernetes, ainsi que les choix de configuration spécifiques qui ont été faits pour répondre aux besoins particuliers des Restos du Cœur.\r\n\r\nAinsi, vous découvrirez comment la combinaison d&#39;OpenStack et de Kubernetes a permis de créer une infrastructure flexible, évolutive et résiliente, tout en maximisant l&#39;efficacité opérationnelle. Des retours d&#39;expérience concrets seront partagés, mettant en lumière les succès, les leçons apprises et les perspectives d&#39;avenir pour cette initiative novatrice.\r\n\r\nRejoignez-nous pour explorer les coulisses de cette transformation technologique exceptionnelle, découvrir les raisons pour lesquelles OpenStack demeure une solution de choix en 2024, et apprendre comment la convergence de technologies de pointe a permis de propulser les Restos du Cœur vers de nouveaux horizons numériques au service de leur mission humanitaire.",
        "speakerIds": [
            "jbriault"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.644",
        "description": "",
        "topic": "tech",
        "video": null,
        "video2": null,
        "room": "ROOM2",
        "start": "2025-04-30T15:45:00",
        "end": "2025-04-30T16:30:00",
        "photoUrls": [],
        "slug": "comment-nous-avons-transforme-les-restos-du-coeur-en-cloud-provider",
        "level": "Intermediate",
        "id": "787396"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Succès débloqué : Rendre son jeu vidéo accessible",
        "summary": "Avec près de 400 millions de joueurs et de joueuses en situation de handicap, rendre les jeux vidéo accessibles n’est pas seulement une nécessité sociale, mais aussi une opportunité de toucher un public plus large. Cette conférence explore des exemples concrets et des solutions pratiques, comme les contrôleurs adaptés, les filtres visuels et les ajustements cognitifs, tout en montrant comment dépasser les barrières involontaires pour créer des expériences inclusives.\r\n\r\nAu-delà des outils, l’accessibilité est une philosophie de design qui améliore l’expérience pour tous et toutes, qu’il s’agisse de joueurs et joueuses en situation de handicap, novices ou casual. En intégrant ces principes dès la conception, les équipes de développement enrichissent non seulement leurs jeux, mais aussi la diversité et leur communauté.",
        "speakerIds": [
            "noelieroux11",
            "yasmine.messaoudi"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.644",
        "description": "",
        "topic": "ethics",
        "video": null,
        "video2": null,
        "room": "ROOM1",
        "start": "2025-04-30T15:45:00",
        "end": "2025-04-30T16:30:00",
        "photoUrls": [],
        "slug": "succes-debloque-rendre-son-jeu-video-accessible",
        "level": "Beginner",
        "id": "793974"
    },
    {
        "format": "TALK",
        "event": "2025",
        "title": "Triangle cherche carré - 3 activités pour mieux apprécier nos différences",
        "summary": "Prêt·es à booster tes soft skills ? Une petite dose de gymnastique mentale ne fait jamais de mal (et entre nous c&#39;est plus facile qu&#39;une séance de sport... !).\r\n\r\nAujourd&#39;hui, je te propose de travailler ta façon dont tu perçois les autres, en particulier leurs différences. \r\n\r\nAu travers de 3 activités ludiques durant lesquelles tu participes, tu pourras apprendre en faisant. Ça change tes habitudes !? Tant mieux ;) Et peut-être même que ça lèvera quelques biais inconscients en toi.",
        "speakerIds": [
            "anne-laure.gros"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.644",
        "description": "",
        "topic": "ethics",
        "video": null,
        "video2": null,
        "room": "ROOM5",
        "start": "2025-04-30T15:45:00",
        "end": "2025-04-30T16:30:00",
        "photoUrls": [],
        "slug": "triangle-cherche-carre-3-activites-pour-mieux-apprecier-nos-differences",
        "level": "Beginner",
        "id": "825452"
    },
    {
        "format": "KEYNOTE",
        "event": "2025",
        "title": "TBA",
        "summary": "",
        "speakerIds": [
            "1cdd53ea-68d1-4acf-b832-3662da09d116"
        ],
        "language": "FRENCH",
        "addedAt": "2025-02-24T17:35:20.644",
        "description": "",
        "topic": "aliens",
        "video": null,
        "video2": null,
        "room": "AMPHI1",
        "start": "2025-04-30T16:50:00",
        "end": "2025-04-30T17:20:00",
        "photoUrls": [],
        "slug": "tba",
        "level": "Beginner",
        "id": "868821"
    }
]
