[{"idSession":330,"votes":32,"positiveVotes":29,"nbConsults":1312,"lang":"fr","format":"Talk","title":"Le mythe du framework agile","summary":"Un framework peut-il se prétendre agile ? À travers du code et quelques principes, découvrons une proposition d'architecture agile.","description":"«Agile Web Development with Rails !», «Agile Web Development with Grails !», «Agile Development with ». \r\nCes annonces vous semblent peut être familières. Si vous vendez votre âme à un framework, il va envoyer Voyance au 3617 pour prévoir la réussite de votre projet, faire revenir l'être aimé, vous rendre plus agile et soigner le bec de lièvre. \r\nSi on reformule : «Vous n'avez pas besoin de savoir coder, vous n'avez plus qu'à remplir les trous». Si cette approche peut paraître incrémentale, elle est plus discutablement itérative. Lean nous parle de «dernier moment responsable» ; eXtreme Programming de design émergent et de tdd ; autant de pratiques qui nous encouragent à retarder le plus possible les décisions d'architecture. Dans cette session très technique, nous allons étudier cette opposition, et finalement parler de ce que peut être une architecture agile.","ideaForNow":"Faire des tests\r\nNe plus utiliser de frameworks full stack\r\n","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":207,"firstname":"Jean-baptiste","lastname":"DUSSEAUT","hash":"ad7345d5cec43a1244d58aadd53d2159","links":[]}],"interests":["TDD","clean architecture","architecture"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/330"},{"rel":"speaker","href":"http://localhost:8081/api/member/207"}]},{"idSession":331,"votes":32,"positiveVotes":28,"nbConsults":1093,"lang":"fr","format":"Talk","title":"L'ABC du BDD","summary":"Introduction au BDD: de l'incompréhension, des duels, de la connaissance, de la communication, des exemples, de l'automatisation et du code!","description":"Une introduction au Behavior Driven Development, avec plein d'idées pour tout de suite! et applicable à tout projet.\r\nIl sera question:\r\n\r\n* de passer de l'incompréhension à savoir qu'on ne sait pas\r\n* des westerns spaghetti aux Three Amigos, \r\n* de reléguer le Comment au second plan pour laisser sa place au Pourquoi!\r\n* de rendre des spécifications exécutables \r\n* de découvrir qu'un concombre n'est pas qu'un Cucurbitacée aux feuilles tri-lobées\r\n* d'automatisation comme outil de non-regression\r\n\r\nAu cours de cette session, nous expliquerons ce qu'est le BDD. Nous verrons **qu'il n'est pas question d'outils ou de tests, mais de collaboration et de discussion** entre les différentes parties prenantes: **du métier aux développeurs en passant par les testeurs. Cette presentation s'adresse à l'ensemble de ces populations** en expliquant l'importance qu'il y a à se comprendre, et qu'il n'est pas nécessaire d'avoir des outils sophistiqués pour avoir des **bénéfices immédiats**.\r\n\r\nNous verrons quelques pratiques de discussion qui permettent d'arriver à une meilleure compréhension et à une description du besoin. Nous verrons aussi comment des exemples concrets permettent de s'assurer d'une compréhension commune et comment ils permettent de construire un langage unique et non ambigu. Nous verrons comment rendre ces **spécifications executables** en réutilisant les exemples construits précédemment et en les automatisant. Ceux-ci viendront renforcer les tests d'acceptance et devenir des tests de non regressions.\r\nEnfin, nous verrons que cette démarche nous permettra d'avoir une **documentation vivante et toujours à jour de notre système**.\r\n\r\n\r\n\r\n","ideaForNow":"Communication, Clarification par des Exemples concrets, Spécifications exécutables","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":937,"firstname":"Arnauld","lastname":"LOYER","hash":"9a0cce93a2b494c84a012d188187ea6c","links":[]}],"interests":["BDD","specifications with example","three amigos"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/331"},{"rel":"speaker","href":"http://localhost:8081/api/member/937"}]},{"idSession":340,"votes":37,"positiveVotes":33,"nbConsults":1241,"lang":"fr","format":"Talk","title":"La confiance dans un monde sous surveillance","summary":"Découvrez OpenPGP et le \"web of trust\", des outils pour vérifier l'origine et assurer la confidentialité des échanges sur Internet.","description":"Le modèle de sécurité sur Internet repose sur des autorités de certification centralisées et corruptibles (erreur récente de l'ANSSI sur des certificats Google, interceptions par la NSA...). Même lorsqu'il fonctionne, il ne garantit que l'intégrité des tuyaux, pas l'état des données transmises avant leur transfert (compromission de Rubygems.org, backdoors dans OpenX Source, phpMyAdmin, vsftpd, ProFTPD...).\r\n\r\nLe \"web of trust\" OpenPGP, largement utilisé dans le développement de logiciels libres tels que la distribution Debian et le noyau Linux, offre une alternative décentralisée à ce modèle de sécurité.\r\n\r\nDans cette session, découvrez :\r\n\r\n* l'intérêt de vérifier les fichiers téléchargés\r\n* l'intérêt des autorités de certification\r\n* les faiblesses d'un système centralisé\r\n* OpenPGP : chiffrement, vérification\r\n* le web of trust\r\n* deux exemples d'utilisation: Debian et le noyau Linux\r\n\r\nVous apprendrez aussi comment créer une clé OpenPGP et l'intégrer au web of trust.\r\n\r\nVous pourrez mettre tout ça en pratique à la _key-signing party_ Mix-IT pendant la soirée du 29 à la Plateforme ; pensez à apporter votre empreinte de clé (en plusieurs exemplaires) et une pièce d'identité !\r\n\r\nLe support de présentation se trouve sur [http://confiance.sk2.org](http://confiance.sk2.org) et [https://github.com/skitt/lcd1mss](https://github.com/skitt/lcd1mss) ; les instructions pour créer une clé et le nécessaire pour la _key-signing party_ sont à partir de [http://confiance.sk2.org/#/etape1](http://confiance.sk2.org/#/etape1).","ideaForNow":"\"Vérifions nos échanges !\"\r\n\"Quel suivi de sécurité sur nos applications ?\" (c'est annexe mais j'en toucherais deux mots)\r\n\"Participons au web of trust !\" (idée tellement pour tout de suite qu'elle peut être mise en oeuvre pendant la conférence)","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":415,"firstname":"Stephen","lastname":"KITT","hash":"a935dafe246dd0e2c216542f50073cbe","links":[]}],"interests":["Sécurité informatique","chiffrement","authentification","intégrité"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/340"},{"rel":"speaker","href":"http://localhost:8081/api/member/415"}]},{"idSession":343,"votes":12,"positiveVotes":10,"nbConsults":688,"lang":"en","format":"Workshop","title":"TEST DRIVEN BUSINESS For  Lean Startup Products","summary":"A Lean Startup workshop in the trenches to experiment TEST DRIVEN BUSINESS approach : What about starting the Learning Loop with \"Measure\"? ","description":"The Minimum Viable Product (MVP) stays at the foundation of a lean start-up. In the loop of “Ideation–Design–Build–Measure–Improve”, the MVP is the reason and the purpose of a lean star-tup. For everyone who is confronted in their day-to-day work with choices of the best options to create products that customers will fall in love with, I propose an original approach called Test-Driven Business (TDB), where the measures and tests that will be done after the product release are defined before the design of the future product.\r\n\r\nThis session, presented in a workshop format, will show the difference of focus in defining an MVP in an classic design-first approach, and the Test-Driven Business (defining metrics/test first). During the session, the participants will build an MVP lean canvas in a design-first approach for a chosen product, then a version of the lean canvas using the Test-Driven Business metrics-first approach.\r\n\r\nThe session shows that using the Test-Driven Business, where we define first what the tests/metrics to validate the product will be, and that it allows a more specific definition of key features, a more focused customer segment and that it helps answer the question, “How will I have really auditable and actionable measures?”\r\n\r\nAgenda of the workshop:\r\n\r\nintroduction: Test-Driven Business\r\nchoose a product\r\nFirst round:\r\n\r\nstate the product vision\r\ncreate a lean canvas (using elevator pitch)\r\nSecond round:\r\n\r\ndefine the meaningful measures: use the solution-focused technique/set of questions to explore what impacts are expected and the measures of that impact\r\ndefine the new lean canvas by filling the key metrics first with measures found in the former step\r\nconclusion and possible further exploration\r\n","ideaForNow":"Create a product tuned on what really matters for the entrepreneur or product manager  now and here.\r\nTest Driven can apply to know more about your customers or the key features.\r\nTurn the wheel of the \"Lean Startup\" learning loop to ensure that - if you fail- you fail in the right direction, sailor ! ","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":180,"firstname":"Oana","lastname":"JUNCU","hash":"344317ae86414143365fffe909ca2d24","links":[]}],"interests":["Lean","Test","MVP"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/343"},{"rel":"speaker","href":"http://localhost:8081/api/member/180"}]},{"idSession":351,"votes":45,"positiveVotes":41,"nbConsults":1577,"lang":"fr","format":"Talk","title":"Jeu vidéo: le cousin un peu étrange de l'IT.","summary":"Fantasmé par beaucoup, détesté par d'autres, peu savent vraiment ce qu'est le monde du développement de jeux vidéo.","description":"Pendant ce temps…\r\n\r\nJV : Tu sais combien de gamins ont dit un jour « Quand je serai grand je ferai des jeux vidéo » ??!\r\n\r\nIT : Oh oui je sais, aujourd’hui ils sont tous chez moi.\r\n\r\nJV : Mais beaucoup regrettent, je me trompe ?\r\n\r\nIT : Au moins je les paie, moi !\r\n\r\nJV : Ok, ok, mais beaucoup peuvent se targuer développer des logiciels qui donnent du plaisir aux gens tu penses ?\r\n\r\nIT : Redescend un peu sur terre… il y a peut-être moins de plaisir chez moi mais plus d’évolution de carrière.\r\n\r\nJV : A quel prix ? Devoir arrêter d’être un programmeur de génie pour devenir manager ?\r\n\r\nIT : Tu as vu avec quelle technologie et quelle puissance mes gars travaillent tous les jours ?\r\n\r\nJV :… oh oui, la plupart des évolutions techniques dont ils jouissent ont été créés en mon nom.\r\n\r\nIT : …\r\n       \r\nIT : … JV, tu ne penses pas qu’un jour nous pourrions nous reparler comme avant ?\r\n\r\nJV : … Peut-être…\r\n\r\nIT : … Tu te souviens quand nous étions jeunes ? Nous étions si unis…\r\n\r\nJV : Tu veux parler de l’époque ou tu disais « Quand je serai grand je ferai des jeux vidéo » ?\r\n\r\n\r\n\r\nL’IT et le Jeu Vidéo sont des cousins qui ne se connaissent que trop peu. Cependant ces deux mondes ont beaucoup à apprendre l’un de l’autre, que ce soit en technique, en méthode, ou en culture. Alors que beaucoup des acteurs de l’IT fantasment le monde du jeu vidéo, ce tour d’horizon, fait par un développeur de jeu connaissant bien l’IT, tentera de faire un constat honnête de l’état de cette industrie aujourd’hui en France.\r\n","ideaForNow":"* La gamification l'enjeu de l'IT\r\n* Le jeu partout\r\n* Les deux univers sont complémentaires\r\n* Il n'est pas nécessaire de porter une cravate pour faire un travail complexe et serieux","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":955,"firstname":"Laurent","lastname":"VICTORINO","hash":"cb47e78c90aa301686e54e61d7a792f4","links":[]}],"interests":["IT","Chatons","Jeux"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/351"},{"rel":"speaker","href":"http://localhost:8081/api/member/955"}]},{"idSession":357,"votes":45,"positiveVotes":44,"nbConsults":1378,"lang":"en","format":"Talk","title":"Natural Course of Refactoring – a refactoring work","summary":"Five step process that guides you and your team through pragmatic everyday refactoring towards emergent design.","description":"Doing refactoring seems to be obvious practice in a software development. In many teams times it is not being done at all. \"We have no time to do it!\". \"We are not allowed\". \"We don't know where to start and how to do it pragmatically\". Many programmers are familiar with classic refactorings or even more complex refactorings to patterns, clean code rules and naming rules. But it is not enough. Pragmatic refactoring is a difficult practice that requires many years of experience. And what if you or folks from your team don't have that experience? Then refactoring may be more harmful than useful.\r\nThe Natural Course of Refactoring is a process, workflow that expresses something what may seem obvious for experienced refactoring practitioner but very difficult to figure out for beginners or even more advanced practitioners. It is like red-green-refactor for TDD. NCR is a way of thinking which shifts your focus from single refactorings to a more holistic approach. It is also decision framework helping you to specify what is next pragmatic step (if there is any).It helps you to recognize what stage the particular fragment of source code is, what you can do about it and decide if to do something or leave it as it is. It guides you what exact refactorings you should take into consideration in the particular stage and also which refactorings are way too big steps.\r\nWho can benefit from this? \r\n• Every programmer beginning refactoring practice or having need for clear guidance about refactoring process.\r\n• Every leader who wants refactoring to become an everyday practice even in inexperience team.\r\n• Every coach who wants to have a simple yet powerful framework to teach refactoring as a whole process (not only weakly connected pieces).","ideaForNow":"Attendees will:\r\nLearn your source code is in one of five stages.\r\nLearn how to recognize which state it is.\r\nLearn what is the simplest possible step of refactoring within the context.\r\nLearn how to decide whether it is worth or not to refactor the code at all.\r\nLearn what kind of transitions can you do to move from one stage to another.\r\nLearn how to implement the NCR process in your team.\r\nLearn how to make everyday refactoring a live practice.\r\n","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":963,"firstname":"Sieraczkiewicz","lastname":"MARIUSZ","hash":"f778246f34766635d303e5956dc5a998","links":[]}],"interests":["Clean Code","Refactoring","Emergent Design"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/357"},{"rel":"speaker","href":"http://localhost:8081/api/member/963"}]},{"idSession":358,"votes":48,"positiveVotes":42,"nbConsults":1469,"lang":"fr","format":"Workshop","title":"Comment développer un PaaS Java en 1H","summary":"Comment développer un PaaS Java en 1H avec docker. ","description":"Les plateformes **Cloud** de type **PaaS** se démocratisent chaque jour au sein des DSI et des équipes de développeurs. En parallèle la gamme des solutions s’étoffe régulièrement OpenShift, CloudFoundry, CloudUnit et évolue techniquement très vite.\r\n\r\nEn 2013, [**docker**](http://docker.io) a révolutionné la mise en place des **PaaS** comme la virtualisation à ses débuts a révolutionné la création de IaaS. \r\n\r\nCette session vous permettra de comprendre l’intérêt d’une plateforme **PaaS** à travers l’outil [**docker**](http://docker.io). Un exemple concret de développement Java/REST permettra de fournir un catalogue de services tels que Tomcat, JBoss, Jenkins, Apache RollerBlog.\r\n\r\nLe **PaaS** change la façon dont on va développer, tester et déployer nos applications. C’est un outil qui permet de gagner beaucoup de temps sur un projet et d’améliorer le “Go To Market”.   \r\n\r\nNous proposons une session de intenses et dynamiques où chaque intervenant alternera entre live-coding et présentation orale. \r\n\r\nAu menu :\r\n\r\n* Présentation de **docker**\r\n* Manipulation de l’API REST **docker** au travers d’une API Java \r\n* Création d’un mini **PaaS** fournissant un catalogue de service","ideaForNow":"Vous pourrez tout de suite créer un PAAS en Java et pour fournir un catalogue de services aux développeurs ","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":962,"firstname":"Herve","lastname":"FONTBONNE","hash":"a3896692e3d599660b2a7619d3b1a418","links":[]},{"idMember":961,"firstname":"Fabien","lastname":"AMICO","hash":"17e06068b1f35421c5553e85cfb21a8a","links":[]}],"interests":["Java","Dock","Cloud","rest","Spring"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/358"},{"rel":"speaker","href":"http://localhost:8081/api/member/962"},{"rel":"speaker","href":"http://localhost:8081/api/member/961"}]},{"idSession":361,"votes":74,"positiveVotes":71,"nbConsults":2119,"lang":"fr","format":"Talk","title":"Tour d’horizon de Node.js","summary":"Découvrir et comprendre ce qu'est Node.js et pourquoi ça envoie du bois, de façon ludique et interactive, philosophiquement + concrètement.","description":"Node.js est l’une des technologies **les plus en vue** de ces dernières années, des services web à la robotique ; désormais **bien industrialisé** et doté d’un écosystème et d’une communauté très vifs, Node a remis sur le devant de la scène un modèle de programmation non bloquant / asynchrone et, surtout, des techniques de code élégantes pour réaliser celui-ci.\r\n\r\n2013 a d'ailleurs été l'année de son décollage chez les très gros acteurs, avec pléthore de *success stories* de conversions enchantées chez eBay, PayPal, LinkedIn, IBM, Walmart et bien d'autres…\r\n\r\nDans cette présentation—qui s'adresse tant à ceux qui n'ont jamais regardé Node qu'à ceux qui jouent déjà avec—Christophe Porteneuve brosse un tableau de Node.js aussi concret que possible. Il posera rapidement quelques notions fondamentales (Node, modules, npm, asynchrone…) puis explorera le développement d’une application web ludique et interactive, qui mettra conjointement en œuvre quelques-uns des usages les plus célèbres, d’Express à Docco en passant par de l’OAuth 2, du Redis, des Web Sockets, Brunch, Mocha et Uglify.\r\n\r\nAvec même un petit bonus qui sortira du strict domaine dématérialisé du web pour se manifester physiquement.","ideaForNow":"* Des choses à tester vite !\r\n* Des envies d'expérimentation !\r\n* Une perception de Node.js enfin sortie des clichés JS et ancrée dans le réel","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":63,"firstname":"Christophe","lastname":"PORTENEUVE","hash":"bacb1158b77a142d2cb8ae1f866c75f1","links":[]}],"interests":["Scalabilité","JavaScript","MongoDB","OAuth","NodeJS","Tests"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/361"},{"rel":"speaker","href":"http://localhost:8081/api/member/63"}]},{"idSession":362,"votes":19,"positiveVotes":18,"nbConsults":1128,"lang":"fr","format":"Workshop","title":"Crafting Workshop","summary":"Expérimenter les valeurs du software crafsmanship. Réaliser le site mobile de Mix-IT en déploiement continu.","description":"Envie de promouvoir les valeurs du software crafsmanship, mais votre patron ne vous laisse pas faire ? Alors venez développer le site mobile de Mix-IT. **Un atelier sera ouvert pendant 2 jours** où vous pourrez venir contribuer en pair programming le temps que vous le souhaitez. Grâce au déploiement continu, vous pourrez avoir un feedback en temps réel avec les participants du mix-IT.\r\n\r\nLe site sera sous la forme d’une Single Page Application avec un serveur node.js.\r\n\r\nVous êtes développeur mais vous ne connaissez pas bien JavaScript, alors c’est l’occasion de découvrir avec du Pair Programming.\r\n\r\nVous n’êtes pas développeur, vous pourrez également participer en donnant un feedback, des idées ou pourquoi pas un design.","ideaForNow":"Ca marche aussi en vrai: le TDD, le pair programming, le clean code, l’agilité, le déploiement continu","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":631,"firstname":"Florent","lastname":"PELLET","hash":"8f97f935f987a3d1252929bf6b32da1d","links":[]},{"idMember":701,"firstname":"Clément","lastname":"BOUILLIER","hash":"e187f8ea0d791446c5055882f0c597ee","links":[]},{"idMember":704,"firstname":"Emilien","lastname":"PECOUL","hash":"569a344428936ce3b601ee3c12d8a100","links":[]}],"interests":["Clean Code","TDD","pair programming","software  craftsmanship","déploiement continu","JavaScript","Agilité","MongoDB","Node.js"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/362"},{"rel":"speaker","href":"http://localhost:8081/api/member/631"},{"rel":"speaker","href":"http://localhost:8081/api/member/701"},{"rel":"speaker","href":"http://localhost:8081/api/member/704"}]},{"idSession":363,"votes":26,"positiveVotes":20,"nbConsults":1046,"lang":"en","format":"Workshop","title":"Basic Coaching Skills to Magnify Teamwork","summary":"You can't ORDER a team to self-organise - it breaks the self-organisation paradigm! Coaching skills really help - even as a guerilla tactic","description":"In the past, thinkers planned and do-ers executed and all was.. well, orderly, at least. \r\n\r\nBut our work has changed, basic tasks are now automated, and success depends on the real-time interaction of many creative people. This shift from traditional management to a more collaborative style can be challenging, though: how do we move from \"telling\" to new forms of leadership that get our teams fully engaged? How do we \"make\" self-organisation happen? (And: isn't that a contradiction in itself?) \r\n\r\nThe good news is that leadership is back in focus: rather than \"managing\" teamwork, leaders (at all levels) can help restore meaning to teamwork, and can model and encourage new ways of working. \r\n\r\nThe tools for doing this are somewhat counterintuitive, though: for example, when we replace \"telling\" with \"listening and asking\" the process may slow down at first, and the results become less predictable... but by taking this risk ourselves we send a clear invitation, that is more than just words. When we begin to show that we don't have all the answers, and really invite our colleagues to help us find the way forward, we build new bridges of respect and trust, and kindle new passion within our teams as each one is appreciated for bringing his or her best to the work. \r\n\r\nMy journey to learn coaching skills has drastically changed how I interact with individuals and groups - my work is now less stressful and yet more demanding! I manage my own energy more intentionally, and I more actively engaging my students and colleagues - to create outcomes full of energy and life. \r\n\r\nJoin me to explore simple (but not easy!) coaching skills like Listening, Powerful Questions, and \"Not Fixing\" (in a coaching dojo). Sometimes I'll talk, but mostly you will discuss and practice in small groups, and we will reflect together on what we learn. I can't wait! \r\n\r\nThe session will be run in English, and groupwork may be done in the language of participants. Je parles aussi français. (Ahem... au moins, Québécois!)\r\n","ideaForNow":"You will leave a new awareness of how a leader (even a peer-leader) impacts a group's culture and process, sometimes with just a few words! You will begin to notice your own patterns, and can step outside your comfort zone to experiment with a \"no fixing\" coaching stance in everyday tasks. The exercises we do can all be reproduced in your workplace or user group to help spread these ideas to your colleagues.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":950,"firstname":"Deborah","lastname":"PREUSS","hash":"e70c6edce18cdd8d8887384707119201","links":[]}],"interests":["communication skills","Management","Coaching","teamwork skills","self-organisation"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/363"},{"rel":"speaker","href":"http://localhost:8081/api/member/950"}]},{"idSession":364,"votes":32,"positiveVotes":30,"nbConsults":2188,"lang":"en","format":"Talk","title":"Toyota Kata – habits for continuous improvements","summary":"Building on the power of habits, Toyota Kata will help you build a culture of continuous learning and improvement, a kaizen culture. ","description":">“We are what we repeatedly do. Excellence, then, is not an act, but a habit.” - Aristotle\r\n\r\nWhat are the habits, routines, behavior patterns, needed to strive for excellence every day? How do we create a culture of continuous learning and improvement?\r\n\r\nBuilding on the power of habits, Toyota Kata will help you build a culture of continuous learning and improvement, a kaizen culture. \r\n\r\nIn this session, you will be introduced to the two main Kata* of the Toyota Kata, the Improvement Kata and Coaching Kata. You will learn how the Improvement Kata and Coaching Kata can become your “muscle memory” for continuous learning and improvements in your organization. These daily habits or routines will help you to strive towards your vision, your state of awesomeness, in small experiments focused on learning. The Improvement Kata will form the habits of doing small daily experiments focused on learning and improving. The Coaching Kata will form the habits of the leaders of the organization to help the learners learn and improve.\r\n\r\nIn this session, we will take Toyota Kata out of the manufacturing context and put it into the knowledge work context. You will learn how you can start applying the Improvement Kata and Coaching Kata in a software development context tomorrow.\r\n\r\n*Time to stop collecting problems and start forming new habits of learning and improving!*\r\n\r\n(*) Kata means pattern, routine, habits or way of doing things. Kata is about creating a fast “muscle memory” of how to take action instantaneously in a situation without having to go through a slower logical procedure. A Kata is something that you practice over and over striving for perfection. If the Kata itself is relative static, the content of the Kata, as we execute it is modified based on the situation and context in real-time as it happens. A Kata as different from a routine in that it contains a continuous self-renewal process.\r\n\r\n","ideaForNow":"* How Toyota Kata can become the catalyst for creating a culture of continuous learning and improvement, a kaizen culture. \r\n* How Improvement Kata and Coaching Kata can become your “muscle memory” for continuous learning and improvements in your organization. \r\n* How the Coaching Kata will form the habits of the leaders of the organization to help the learners learn and improve. \r\n* How small daily experiments lower the resistance to change and builds a kaizen culture. \r\n* How to use the great power of habits to build a new culture. \r\n* How to apply the Improvement Kata and Coaching Kata in a software development context \r\n","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":970,"firstname":"Hakan","lastname":"FORSS","hash":"73fe105631c7011f2af2916a4de639ff","links":[]}],"interests":["habits","continuous improvement","Toyota Kata","Behaivours"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/364"},{"rel":"speaker","href":"http://localhost:8081/api/member/970"}]},{"idSession":365,"votes":46,"positiveVotes":43,"nbConsults":1181,"lang":"fr","format":"Workshop","title":"Prenez le contrôle d'un aéroport avec Akka","summary":"Venez découvrir le modèle acteur avec Akka. En Java ou Scala, développer de façon ludique un algorithme de gestion de trafic aéroportuaire.","description":"Nous vous proposons de travailler sur la programmation dans le modèle acteur, totalement dynamique et asynchrone. Nous verrons ce qu’est un acteur, comment lui envoyer des messages, gérer des machines à états, tout cela dans une approche d'Event Sourcing. \r\nNous verrons ensuite comment les modules akka-remote et akka-persistence permettent d'appréhender la distribution et la résilience de l'application. \r\n\r\nVous aurez le choix de programmer en Java ou en Scala. Cet atelier est aussi un retour condensé du cours \"Reactive Programming\" sur Coursera donné fin 2013.","ideaForNow":"Dans quel contexte utliser le modèle acteur?\r\nCe qu'est une application \"Reactive\", le fameux buzz word.\r\nCe qu'est l'Event Sourcing et quels en sont les avantages.\r\n\r\nDécouvrir le framework Akka, en Java ou Scala.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":389,"firstname":"Jean","lastname":"HELOU","hash":"75da740d43c5780539214f24ce1148a6","links":[]},{"idMember":944,"firstname":"Xavier","lastname":"BUCCHIOTTY","hash":"d7630f6a5bab51801f426c574098f443","links":[]}],"interests":["reactive programming","event sourcing","Java","akka","Scala"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/365"},{"rel":"speaker","href":"http://localhost:8081/api/member/389"},{"rel":"speaker","href":"http://localhost:8081/api/member/944"}]},{"idSession":369,"votes":37,"positiveVotes":32,"nbConsults":1381,"lang":"en","format":"Talk","title":"Visualization – what’s my brain got to do with it?","summary":"Visualization is key. But are you done? Learn why you won't always get the behavior response intended, and how to improve the odds.","description":"Visualization is a key lean technique and a necessity, when you, as a part of a complex system are tackling a fast moving environment. But why is it such a necessity? Let’s walk through some of the limitation imposed on us by our brain, how visualization helps us cope and why we don't always act according to obvious facts.\r\n\r\nI will share what to think of, to improve the odds of getting the response intended including examples where visualization actually changed the world.\r\n","ideaForNow":"Understanding of how our brain interprets visual information (and the limitations that comes with it)\r\nWhat to think of, to get the intended behavior response when visualizing.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":952,"firstname":"Mattias","lastname":"SKARIN","hash":"2e41913333211225c75506520d7496e5","links":[]}],"interests":["Leadership","Visualization"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/369"},{"rel":"speaker","href":"http://localhost:8081/api/member/952"}]},{"idSession":372,"votes":22,"positiveVotes":18,"nbConsults":909,"lang":"fr","format":"Talk","title":"Créer un projet autour de ses valeurs","summary":"Un cas pratique sur deux entrepreneurs, des valeurs fortes, et la volonté de créer un projet d'entreprise pérenne.","description":"On parle beaucoup de comment démarrer un projet, comment le financer, comment le faire grandir au maximum et comment le vendre au mieux.\r\nMais on ne parle que rarement de taille optimale d'un projet, de volonté de pérennité dans le temps, de financement mesuré pour garder le contrôle ou d'aveuglement par l'ego.\r\n\r\nCette session est donc là pour ça !\r\nL'idée ? Partager avec vous sur la Cordée, le projet que j'ai cofondé, qui vise à développer l'entraide entre indépendants, entrepreneurs et télétravailleurs, en créant des espaces de coworking où la communauté est plus importante que les mètres carrés.\r\n\r\nCe projet, nous sommes deux à l'avoir créé, avec des valeurs fortes (partage, gouvernance participative, croissance mesurée, écologie, confiance...) sur lesquelles on ne voulait pas transiger. Comment alors créer un projet qui a de l'impact, se finance, grandit et trouve son équilibre, tout en gardant ses valeurs ?\r\n\r\nLa réponse, ce sera à Mix-It !","ideaForNow":"Savoir se dire les choses avec de potentiels associés pour éviter les mauvaises surprises\r\nPrévoir les éléments qui viendront mettre la pression sur les valeurs des fondateurs\r\nPrévoir son financement en fonction de ses finalités","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":959,"firstname":"Michael","lastname":"SCHWARTZ","hash":"fee8583a738d828456973cb265734f51","links":[]}],"interests":["Business Model","Agilité","Entrepreneuriat","valeurs"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/372"},{"rel":"speaker","href":"http://localhost:8081/api/member/959"}]},{"idSession":378,"votes":27,"positiveVotes":25,"nbConsults":855,"lang":"en","format":"Talk","title":"Looking at the future of User Interfaces in Sci-Fi","summary":"Science fiction movies always have crazy softwares and crazy UI. Except when they’re not. Sometimes they’re visionary.","description":"If you watch old science fiction movies, you’ll probably find them ridiculous, with a lot of ugly hardware and funny computers. But when you take a closer look, you can see that people already invented the iPad and Google Glass 50 years ago. They were not real, of course, but they existed.\r\n\r\nIf tomorrow you create a simulation to enslave the human race, you probably won’t use green code falling down your screen. But who knows? \r\n\r\nOur industry is inspired by the work of science fiction authors, and these people love to learn about technology to help them imagine new worlds. I’d like to talk about some of the major breakthrough in User Interfaces as seen in Science Fiction, talk about what didn’t work out, and try to imagine what our computers will look like in 50 years, based on those observations.\r\n\r\nThe next time you’ll see a movie featuring crazy computers, you’ll probably think twice. Science-_Fiction_, but for how long?","ideaForNow":"","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":795,"firstname":"Vincent","lastname":"TOURRAINE","hash":"74079210c61f36dff0a74f24da5727e7","links":[]}],"interests":["innovation","UI","Sci-Fi","Culture"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/378"},{"rel":"speaker","href":"http://localhost:8081/api/member/795"}]},{"idSession":381,"votes":66,"positiveVotes":59,"nbConsults":1721,"lang":"fr","format":"Talk","title":"Des petits pas vers le Continuous Delivery","summary":"Un codeur raconte son vécu et l'évolution de son outillage pour le passage d'une livraison tous les 30j à tous les jours ! ","description":"LesFurets.com est passé en 18 mois d'une organisation solide de type \"éditeur logiciel\" avec une release par mois à une organisation non moins solide en \"Continuous Delivery\" avec une mise en production par jour de  \"ce qui est prêt\" (sans être bloqué par les développements en cours). \r\n\r\nC'est un développeur qui vous présentera l'histoire vécue de l'intérieur :\r\n<< Ce changement nous pousse à devenir de meilleurs développeurs, car avant de livrer tous les jours, il y a des étapes intermédiaires nécessaires pour faire naître le besoin et développer la capacité de l’équipe à changer. >>\r\n\r\nUn bon produit ne sort pas du chapeau, il se construit par itération, en essayant, en se trompant et en corrigeant. Raccourcir la boucle de retour entre les concepteurs et les utilisateurs apporte une très grande valeur compétitive. Adoptez le continuous delivery pour devenir l’équipe IT dont le business rêve.\r\n\r\nLe vouloir n’est pas tout, il reste à savoir comment s’y prendre. Le modèle itératif de SCRUM atteint ses limites lorsque l’on vise à mettre en prod plus souvent (Time to Market aggressif). Les coûts de recette explosent et la synchronisation des tâches se complique. \r\n\r\nChez LesFurets.com nous avons entièrement changé notre gestion de projet et nos méthodes de développement. Le fonctionnement adhère fortement à une philosophie où le planning de release et deadlines n’existent plus, les développements sont livrés simplement quand ils sont prêts (Flux).\r\n\r\nLa présentation passera en revue tous les moyens techniques et organisationnels que nous employons pour garantir le même niveau de qualité qu’auparavant : mise en production, livraison de code, validation, intégration continue, travail en feature branches, itération avec le business, spécifications fonctionnelles. \r\n\r\nTechniquement nous présenterons notre Usine Logicielle, le poste et les actions du développeur, et l'organisation de la QA.","ideaForNow":"Ne pas avoir peur de s'améliorer chaque jour vers des livraisons un peu plus fréquentes","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":131,"firstname":"Dimitri","lastname":"BAELI","hash":"7f73df517fdea1028d28f39980edf441","links":[]},{"idMember":997,"firstname":"Arnaud","lastname":"PFLIEGER","hash":"2ee2498f908b8228157a52847882e38b","links":[]}],"interests":["Git","Kanban","Jenkins","Continuous Integration","Continuous Deployment","Amélioration continue"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/381"},{"rel":"speaker","href":"http://localhost:8081/api/member/131"},{"rel":"speaker","href":"http://localhost:8081/api/member/997"}]},{"idSession":382,"votes":18,"positiveVotes":17,"nbConsults":1539,"lang":"fr","format":"Keynote","title":"Et si nous n'étions qu'au début ?","summary":"Bitcoin, buzz de 2013. Et si, plus qu'un buzz, Bitcoin n'était que le prémice d'un changement majeur, fondamental dans notre société ?","description":"Internet transforme notre mode de vie et notre société. Depuis la musique à la presse, nous connaissons tous des exemples de profonds bouleversements dans notre économie.\r\n\r\nL'Internet of Things n'est pas prêt de ralentir cette tendance sur laquelle les technophiles surfent. Tous ces changements, ces boulversements viennent avec leurs lots de questions, d'interrogations, de problèmes éthiques.\r\n\r\nEn 2013, la technologie Bitcoin a beaucoup fait parler d'elle. Certains ont investi de l'argent, quelques rares sont devenus riches. Mais cela n'a pas révolutionné le monde. Pas encore.\r\n\r\nEt si nous n'étions qu'au tout début ? Et si le potentiel de disruption d'un Bitcoin allait au delà de tout ce que nous pouvons imaginer ? \r\n\r\nPour les technophiles, pour les business owners, il est important de prévoir, de se projeter en avant. Le changement devient tellement rapide que nos observations sont déjà périmées.","ideaForNow":"Il est important de réfléchir à ce que Bitcoin implique dans votre business, dans votre vie, dans votre univers. Et de mettre en place, aujourd'hui, les briques du monde dans lequel nous voulons vivre demain.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":983,"firstname":"Lionel","lastname":"DRICOT","hash":"78e34b27e44134c64576edc9d73cac3f","links":[]}],"interests":["futurologie","futur","bitcoin"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/382"},{"rel":"speaker","href":"http://localhost:8081/api/member/983"}]},{"idSession":387,"votes":48,"positiveVotes":42,"nbConsults":1150,"lang":"en","format":"Talk","title":"I want to be an efficient developer","summary":"This talk is a set of good practice to become a more efficient developer who can focus on what is own added value.","description":"Ce talk a été donné lors des API days :\r\nAPI days : [slides](http://fr.slideshare.net/quentinadam/i-want-to-be-more-efficient-apidays) and [video](https://www.youtube.com/watch?v=mNM5S2JvMyY)\r\n\r\nCe que je veux transmettre à travers ce talk est un ensemble de bonne pratiques qui permettent de se sentir mieux dans son travail et de se focaliser sur ce qui est important.\r\n\r\nJe compte le remixer pour intégrer un concept dit de \"Fast developer\" qui est le développeur agile et efficace que nous cherchons tous à être.\r\n\r\nJe peut aller sur un format 20 ou 50 min, en FR ou EN.\r\n\r\n\r\n\r\nQuelques uns de mes talk en référence :\r\nDotScale : [slides](http://fr.slideshare.net/quentinadam/dotscale2013-how-to-scale) and [video](https://www.youtube.com/watch?v=UjR0Kg491bI)\r\n\r\nTakeoff :  [slides](http://fr.slideshare.net/quentinadam/use-promises-futures-and-some-functional-programing-stuff-without-being-a-math-nerd)  et [video](https://www.youtube.com/watch?v=2OjHNe9Akaw)\r\n\r\nScala.io : organizer and speaker [slides](http://fr.slideshare.net/quentinadam/some-advice-from-the-guy-who-handle-your-applications-uptime-scalaio-2013)\r\n\r\n","ideaForNow":"-> spliter le dev et l'ops\r\n-> automatiser les tâches automatisable\r\n-> faire du code modulaire\r\n-> employer AMQP\r\n-> le cloud de façon simple","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":987,"firstname":"Quentin","lastname":"ADAM","hash":"1a616a1b0ab4fe6ea72cc8d00c8ba4ec","links":[]}],"interests":[],"links":[{"rel":"self","href":"http://localhost:8081/api/session/387"},{"rel":"speaker","href":"http://localhost:8081/api/member/987"}]},{"idSession":388,"votes":71,"positiveVotes":66,"nbConsults":1605,"lang":"fr","format":"Workshop","title":"Application Web Moderne en Java. The CodeStory Way","summary":"Atelier : Application Web Moderne en Java - The CodeStory Way avec @dgageot et @morlhon. #java #test #mongo #angular #lambda #fun #hotkeys","description":"Venez participer à cet atelier de 2 heures 30. L'objectif est simple : apprendre à développer une application web moderne en Java. Rapidement, de manière pragmatique et en toute confiance.\r\n\r\nAvec l'assistance et les démos live de David Gageot et Jean-Laurent de Morlhon.\r\n\r\nAu menu : du Java 8, un poil d'Angular, un soupçon de CoffeeScript, du MongoDB, du pair-programming, des tests IHM, des hotkeys de malade, des plugins de fou et un cycle de développement ultra rapide. Oui vous ne rêvez pas on parle bien de Java.\r\n\r\nLundi, au boulot, vous ne verrez plus votre projet java de la même manière.","ideaForNow":"Vous saurez **tout de suite** développer en java en associant vitesse et qualité, tout en vous amusant et en utilisant des outils modernes. La classe quoi :)","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":991,"firstname":"David","lastname":"GAGEOT","hash":"f0887bf6175ba40dca795eb37883a8cf","links":[]},{"idMember":597,"firstname":"Jean-laurent","lastname":"DE MORLHON","hash":"649d3668d3ba68e75a3441dec9eac26e","links":[]}],"interests":["Java","Web","CoffeeScript","Code Story","Test","mongo","atelier"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/388"},{"rel":"speaker","href":"http://localhost:8081/api/member/991"},{"rel":"speaker","href":"http://localhost:8081/api/member/597"}]},{"idSession":389,"votes":45,"positiveVotes":38,"nbConsults":1346,"lang":"fr","format":"Talk","title":"La culture du programmeur","summary":"Explorons comment bâtir des équipes techniques solides & vivre une carrière technique captivante en explorant la culture des programmeurs.","description":"Vous avez l'idée qui va vous rendre riche et le budget, maintenant il vous faut les programmeurs. Pas juste les 2 gugus qui parlent de warcraft à la cafet et qui livrent jour après jour une application de plus en plus buggé, mais des PROGRAMMEURS, des vrais. Ceux qui murmurent à l'oreilles des programmes pour faire des applications extraordinaires.\r\n\r\nMais je les trouves où ces types là ?\r\n\r\nCette session présente des réponses concretes en explorant la culture de ces programmeurs. \r\n\r\nComprendre cette culture est un facteur determinant pour bâtir une équipe produit extraordinaire.","ideaForNow":"**Tout de suite** vous saurez comment bâtir une équipe technique performante sur le long terme.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":597,"firstname":"Jean-laurent","lastname":"DE MORLHON","hash":"649d3668d3ba68e75a3441dec9eac26e","links":[]}],"interests":["Programmeur","Culture"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/389"},{"rel":"speaker","href":"http://localhost:8081/api/member/597"}]},{"idSession":390,"votes":40,"positiveVotes":35,"nbConsults":909,"lang":"fr","format":"Talk","title":"Android Bashing : apprendre des erreurs des grands","summary":"Cette conférence vise à étudier les erreurs de géants de l'informatique sur leurs applications Android, afin d'éviter de les reproduire.","description":"Microsoft, Facebook, Yahoo, ... Ces géants du soft sont tous de grands éditeurs d'applications et leur réputation n'est plus à faire. Il leur arrive malgré tout de ne pas rencontrer le succès sur le PlayStore Android.\r\n\r\nDurant cette conférence je vous raconterai l'histoire de ces applications qui avaient tout pour réussir et qui ont échoué à satisfaire les utilisateurs. On identifiera ensemble les erreurs commises afin de pouvoir prendre soin de ne jamais les reproduire.","ideaForNow":"Cette présentation est une suite d'idées a prendre \"pour tout de suite\" sur plusieurs plans : l'UI et l'UX, les erreurs des développeurs, les choix de positionnement technique et commerciaux.\r\n\r\nMais il y a souvent une idée principale dans chacun des exemple : **\"il est important de constamment prendre du recul sur son travail\"**. Pour l'analyser et voir s'il est adapté à la plateforme, au public et à l'environnement de son produit.\r\n\r\nCette notion qui parait évidente est pourtant très souvent oubliée, cette présentation en est la preuve.\r\n\r\nVoici un lien vers les slides : [http://bit.ly/andbigfails][1]\r\n\r\nIl est possible que j'enlève une ou deux parties pour rester dans les temps.\r\n\r\n[1]: http://bit.ly/andbigfails","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":654,"firstname":"Eyal","lastname":"LEZMY","hash":"84803fc83d5a1e1dbebe301f985b2b4c","links":[]}],"interests":["UX","UI","security"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/390"},{"rel":"speaker","href":"http://localhost:8081/api/member/654"}]},{"idSession":397,"votes":60,"positiveVotes":56,"nbConsults":1881,"lang":"fr","format":"Talk","title":"Le Web est la plateforme (mobile)","summary":"Pourquoi est-il important que le Web devienne la plateforme universelle, y compris sur mobile ? Comment Mozilla y travaille.","description":"(note : je peux faire la présentation en anglais ou en français, au choix. Dans tous les cas les slides seront en anglais). \r\n\r\nLe Web est un accident heureux. Après des décennies pendant lesquelles les développeurs devaient écrire des versions Windows, Mac et Linux de leurs applications, le Web est arrivé, et avec lui les Web Apps. Aujourd'hui, il serait risible d'imaginer une version de Facebook ou de Gmail pour Windows et une autre pour le Mac. \r\n\r\nPourtant, le monde de l'ordinateur personnel est en voie d'obsolescence. Dans les prochaines années, plusieurs milliards de personnes vont découvrir l'informatique et Internet, mais ça ne sera pas avec des PC mais en utilisant des téléphones mobiles. \r\n\r\nVeut-on confier les clés de notre futur numérique à Apple et Google ou veut-un un monde technologique où chacun peut apprendre et créer sans avoir à demander la permission ? Comment garder le contrôle sur nos smartphones ?","ideaForNow":"* Je vais choisir HTML5 pour faire des applications mobiles qui tournent sur toutes les plateformes.\r\n* Je sais quels outils choisir pour construire des applications \"future-proof\".\r\n","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":994,"firstname":"Tristan","lastname":"NITOT","hash":"3ac6bd8f5222fed869d6fd03314e25af","links":[]}],"interests":["Web","HTML5","Firefox OS","Mobile"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/397"},{"rel":"speaker","href":"http://localhost:8081/api/member/994"}]},{"idSession":401,"votes":25,"positiveVotes":24,"nbConsults":749,"lang":"fr","format":"Talk","title":"Let's Invoke Dynamite in JavaEE with InvokeDynamic","summary":"Découvrez comment Invoke Dynamic introduit dans Java SE 7 pourrait révolutionner le monde de Java EE à travers une mise en oeuvre dans CDI. ","description":"Si l'arrivée d'InvokeDynamic dans Java 7 a marqué un tournant pour la création de langages basés sur la JVM, cette fonctionnalité est restée confidentielle dans l'univers des développeurs de frameworks Java et de Java EE.\r\nDans cette présentation nous reviendrons sur les particularités d'InvokeDynamic et sur sa mise en œuvre en Java. Ensuite nous verrons comment remplacer le mécanisme de Proxy utilisé dans CDI par des appels InvokeDynamic. Enfin nous expliquerons comment la généralisation d'invokeDynamic pourrait marquer la mort des conteneurs et la fin de Java EE tel que nous le connaissons.","ideaForNow":"","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":999,"firstname":"Antoine","lastname":"SABOT-DURAND","hash":"98d0697142b0d75568acf12b2767b01c","links":[]}],"interests":["Java EE","CDI","Invoke Dynamic","Weld"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/401"},{"rel":"speaker","href":"http://localhost:8081/api/member/999"}]},{"idSession":405,"votes":66,"positiveVotes":60,"nbConsults":1386,"lang":"en","format":"Talk","title":"How To Do Kick-Ass Software Development","summary":"You actually want to get stuff done? Less managers managing, less testers testing and less IT-operators operating. Kick-Ass again!","description":"With Kick-Ass Software Development you actually get stuff done. Feedback cycles are short, code quality is awesome and customers get the features they lust after. Less mangers managing, less testers testing and less IT-operators operating. The developers take the power back, making them much happier. Sound like paradise? It is!\r\nThis session will show you how we do Kick-Ass Software Development at Atlassian. I will talk about how we: use pull requests for better code quality; collaborate fast to develop ideas; avoid meetings to get more stuff done; tighten our feedback loops to fail faster; shorten our release cycles; and work together happily on different continents. It's a great way to develop software and we think it can work in your company, too. ","ideaForNow":"","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1002,"firstname":"Sven","lastname":"PETERS","hash":"a6a2030fcc3df286d6cf264edfa212fd","links":[]}],"interests":["Feedback","quality advocacy","continuous improvement","kickass","atlassian"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/405"},{"rel":"speaker","href":"http://localhost:8081/api/member/1002"}]},{"idSession":417,"votes":66,"positiveVotes":60,"nbConsults":1493,"lang":"fr","format":"Talk","title":"Applications réactives avec Spring4 et AngularDart","summary":"Retour d'expérience portant sur le développement d'OpenSnap, un clone HTML5 de SnapChat utilisant Spring 4, AngularDart, STOMP et Websocket.","description":"Cette conférence aborde le développement d'applications réactives via un retour d'expérience portant sur le projet [OpenSnap](https://github.com/sdeleuze/opensnap), un clone HTML5 de SnapChat utilisant Java 8, Spring Boot, Spring Framework 4 et AngularDart.\r\n\r\nAu programme :\r\n\r\n- Pourquoi Spring Boot est une révolution !\r\n- Les nouveautés de Spring Framework 4 telles que le support de Websocket, SockJS et STOMP\r\n- L'efficacité de développement unique qu'apportent Dart et AngularDart côté client\r\n- Quelles différences entre le développement RIA avec des webservices REST et Websocket\r\n- Quelles fonctionnalités bénéficient de ces nouvelles possibilités de push du serveur vers le client\r\n- Pourquoi le support de SockJS permet de faire du \"websocket\" dans la vraie vie, y compris derrière les proxy d'entreprise\r\n- Pourquoi Websocket seul est trop bas niveau et comment STOMP comble ce manque\r\n- La scalabilité et les performances\r\n- Build mixte Java et Dart grâce à Gradle\r\n\r\nLes participants pourront tester la demo afin de s'envoyer des photos en live avec leur ordinateur portable, tablette ou smartphone. L'écran de la salle diffusera les photos envoyées au compte Mix-IT qui s'afficheront sur l'écran.","ideaForNow":"Tester Dart et AngularDart, commencer son prochain projet avec Spring Boot, concevoir une application client serveur utilisant le support STOMP over Websocket de Spring ...","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":666,"firstname":"Sébastien","lastname":"DELEUZE","hash":"04bf197ddd198f4ff3a50e93ebd37272","links":[]}],"interests":["reactive programming","sockjs","Java8","websocket","RIA","stomp","Spring","Dart"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/417"},{"rel":"speaker","href":"http://localhost:8081/api/member/666"}]},{"idSession":419,"votes":21,"positiveVotes":18,"nbConsults":971,"lang":"en","format":"Talk","title":"Product Owner Super Powers","summary":"Building the right thing is hard, moving an organisation towards building the right thing is even harder. ","description":"It is incredibly hard to excite customers by creating valuable products and services. You only know if there is value on your roadmap when you experiment and test with people beyond your organisation but it's too easy just to get overwhelmed by the complexity when going outside of the building. And those who dare trying to find out the truth of their value proposition often face strong resistance from inside their organisation that wants to stay in the comfy zone. \r\nIn my session I will discuss common problems Product Owners face and what they and their teams need to achieve the goal to create value.","ideaForNow":"How to find out if work on your plan is valuable and how this is linked to your business model\r\nWhat to expect from an organisation that focuses on customer delight\r\nHow the role of a Product Owner can help to create value\r\n","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1014,"firstname":"Stefan","lastname":"HAAS","hash":"c8b372c110a5a2d40c72a78e6f228fc3","links":[]}],"interests":["Product Owner"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/419"},{"rel":"speaker","href":"http://localhost:8081/api/member/1014"}]},{"idSession":423,"votes":26,"positiveVotes":22,"nbConsults":993,"lang":"fr","format":"Talk","title":"REX Le kanban va-t-il fluidifier notre chaine ? ","summary":"Pourquoi nous sommes passés au kanban : l'expérience n'aura peut être pas encore porté ses fruits mais nous vous parlerons des bourgeons.","description":"Les rétrospectives garantissent l'amélioration continue des équipes. Bien, mais par rapport à quel problème ? Dans une réunion avec 90% de développeurs, à quel moment les enjeux de l'entreprise sont-elles adressées ? Comment délivrer plus vite par exemple ? En changeant d'équipe, en mettant plus de pression, en recrutant ?\r\n\r\nPlus vite... que quoi d'ailleurs ? Qu'aujourd'hui, que le concurrent, qu'une autre équipe ? Quel est la vitesse visée qui ne nuit ni à la qualité (donc au client), ni à l'équipe ?\r\n\r\nAujourd'hui, il s'écoule en moyenne 11 jours entre la priorisation et la mise en production d'une user story. Je nous donne 3 mois pour diviser ce lead time par deux. Le moyen : le kanban, ajusté par des rétros régulières.\r\n\r\nNous vous raconterons ce que l'équipe si habituée a scrum aura pensé de la transition et comment l'objectif aura été atteint (ou pas).","ideaForNow":"- l'envie de changer de process\r\n- l'envie de mesurer le \"niveau\" de l'équipe à un instant T, \r\n- se demander quel est le premier objectif de notre entreprise","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1016,"firstname":"Florence","lastname":"CHABANOIS","hash":"2168f37bb0b5cd95a32f9e6094bc053c","links":[]}],"interests":["Lean","Kanban"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/423"},{"rel":"speaker","href":"http://localhost:8081/api/member/1016"}]},{"idSession":424,"votes":71,"positiveVotes":63,"nbConsults":2217,"lang":"fr","format":"Workshop","title":"AngularJS from scratch","summary":"Nous vous proposons de réécrire AngularJS de zero avec nous. Rien de tel pour démystifier le framework et ses principales fonctionnalités!","description":"On a tous vu une présentation d’AngularJS montrant la magie des bindings et des directives. Oui, mais comment ça marche ? Rien de mieux pour le comprendre que de le construire étape par étape. C’est finalement avec assez peu de code et un code très intéressant à détailler que les principaux mécanismes d’AngularJS apparaissent. Avant la fin de la séance, binding, directives, templates, tout fonctionne.\r\n\r\nDepuis plus d’un an, dans la communauté AngularJS en France, les présentations sur le framework ont toutes été données.\r\n\r\nMais comment démystifier le côté magique d’AngularJS. Comment aborder avec des auditeurs qui ne sont pas forcément spécialistes du JavaScript, les mécanismes interne du framework ? Nous avons mis au point une base de code qui permet, en partant de zero, de reproduire les mécanismes principales des scopes d’Angular, du Dirty Checking, du binding et enfin de la compilation du DOM afin d’interpréter les directives présentes dans le code HTML.\r\n\r\nA travers un atelier animé à deux, nous proposerons aux participants une nouvelle approche d’Angular. Une approche par le code, commenté, itératif, qui permet de bien comprendre comment marche le framework et ce qui fait sa cohérence et sa robustesse.\r\n\r\nNécessaire pour l'atelier :\r\n\r\n- Un éditeur ou un IDE et Chrome et c'est tout !\r\n\r\n- Vous pouvez prendre de l'avance et cloner le repo : https://github.com/Zenika/angular-from-scratch","ideaForNow":"Utiliser AngularJS mais plus de magie ! L'utiliser en connaissance de cause, savoir profiter de ses atouts et en éviter les pièges.\r\n\r\nAborder l'écritures de directives autrement en comprenant comment elles sont interprétées.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1026,"firstname":"Olivier","lastname":"HUBER","hash":"f3297524e6d2f113a5874d43514015b1","links":[]},{"idMember":105,"firstname":"Matthieu","lastname":"LUX","hash":"27bd774790e70807a5489b31f668a71e","links":[]}],"interests":["Directives","Angular.js","Scope","JavaScript","Dirty Cheking"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/424"},{"rel":"speaker","href":"http://localhost:8081/api/member/1026"},{"rel":"speaker","href":"http://localhost:8081/api/member/105"}]},{"idSession":428,"votes":63,"positiveVotes":56,"nbConsults":2042,"lang":"fr","format":"Talk","title":"Le lean startup concret autour d'une petite mousse","summary":"Lancez-vous ! Fini la théorie du lean startup et suivez les \"petits cailloux\" laissés sur notre chemin pour développer Une Petite Mousse","description":"Votre prochain projet, qu'il soit de créer votre startup ou de développer un produit en interne, sera en lean startup car voici le graal des méthodes pour ne développer que ce qui est utile ... en tous cas c'est ainsi que vous le voyez en première lecture mais vous hésitez à faire le premier pas au risque de vous retrouver perdu avec quelques chose bien loin des Dropbox et autres AirBnB.\r\n\r\nIl y a un an, avec Une Petite Mousse, nous avions l'idée de faire découvrir les meilleures bières avec une dégustation dont la sélection change chaque mois. Nous étions (très) contraints en temps et en fonds, nous étions dans cette situation où le lean startup est le graal et ... nous avons fait le premier pas en lançant dans la journée une page statique avec notre pitch et un bouton acheter sans savoir comment envoyer les bières (car cela n'est pas un problème avant la première commande ;)\r\n\r\nDe 500€ de chiffres d'affaire le premier mois, nous sommes passé à 50 000€ de chiffres d'affaire dix mois plus tard. Alors, sans dire qu'il n'y a qu'un chemin ni qu'il existe une \"secret sauce\" pour réussir, nous pouvons en tous cas vous donner les indications sur les \"petits cailloux\" que nous avons laissés sur notre parcours afin de savoir où vous mettrez les pieds ... [une petite mousse](https://unepetitemousse.fr/ \"Abonnement au coffret des meilleures bières - Une Petite Mousse\") à la main ;)","ideaForNow":"Un lot de \"petits cailloux\" qu'on a laissé sur notre chemin et qu'il \"suffit\" de suivre :\r\n\r\n- une méthode pour se lancer au plus vite et valider/invalider ses premières hypothèses\r\n- un lot de métriques de pirate à mesurer sur son produit (Acquisition, Activation, Retention, Referral, Revenue)\r\n- une approche orientée utilisateur pour ne développer que les fonctionnalités utiles parce qu'elles solutionnent un problème","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":449,"firstname":"Jonathan","lastname":"BONZY","hash":"2105b41f007b396295d9e6fd1d5c5c04","links":[]},{"idMember":472,"firstname":"Manuel","lastname":"DUCRUET","hash":"3019a4c940e2b23b05ba4bfeb8044247","links":[]}],"interests":["Business Model","Growth Hacking","Customer Validation","Scrum","Lean Startup"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/428"},{"rel":"speaker","href":"http://localhost:8081/api/member/449"},{"rel":"speaker","href":"http://localhost:8081/api/member/472"}]},{"idSession":432,"votes":11,"positiveVotes":11,"nbConsults":774,"lang":"fr","format":"Keynote","title":"Marché de niche et de convictions, Les Sommelières","summary":"En 2013 naissaient Les Sommelières, site de vin dédié aux femmes. Au-delà du marketing de niche, internet permet de porter une cause.","description":"Aujourd'hui, tout le monde peut créer une entreprise et un site e-commerce. C'est extrêmement facile : une liasse de paperasse au greffe, un CMS gratuit, quelques produits et c'est parti. Ensuite, le faire connaître et acquérir de la clientèle est une autre affaire. J'ai beaucoup d'admiration pour les gens qui réussissent à créer un site e-commerce rentable, à le faire prospérer et à créer des emplois.\r\n\r\nPourtant, je pense que ne faire que ça, c'est gâcher le potentiel d'internet. L'infini marché qui s'offre à tout e-commerçant nous permet d'aller plus loin. Nous pouvons imaginer des entreprises à succès s'adressant à de petites communautés, en les aidant à couvrir des besoins inassouvis. Nous pouvons aussi imaginer des services online qui participent à des causes plus larges, à leur échelle. \r\n\r\nVoici mon histoire pour illustrer cette idée. \r\n\r\n\r\n\r\nAlors que j'étais cadre salariée dans une entreprise de publicité online, avec le confort et la sécurité de ce type de postes, j'ai cherché à donner du sens à ma vie. J'étais passionnée de vin, compétente en web, et habilitée à créer un Nième site de vente de vin en ligne. Mais vendre du vin ne m'intéresse pas et ne m'a jamais intéressé. Non. Ce que je voulais c'était partager ma passion pour le vin. Mais justement, quelque chose me dérangeait dans ce milieu du vin : son élitisme. J'ai donc décidé de m'adresser aux néophytes, à cette majorité de gens qui n'y connaissent rien en vin. Or un groupe de personnes semblait être à l'écart du monde du vin, ne choisissait jamais la bouteille pour accompagner le repas, n'allait pas dans les salons des vins, ne lisait pas la presse spécialisée... Ce groupe ce sont les femmes. J'ai donc décidé d'enquêter, de découvrir pourquoi les femmes ne s'intéressaient pas au vin. \r\n\r\nEn créant le site Les Sommelières, j'essaie d'apporter un peu d'égalité homme-femme dans ce milieu encore très masculin. Les Sommelières, c'est un blog où je partage mes découvertes, mes dégustations et mes connaissances, du contenu original avec des recettes faciles et rapides à cuisiner pour réaliser des accords mets et vins. C'est aussi un petit algorithme, le VinoQuiz, qui permet de trouver le vin qui correspond à ses goûts. Enfin, c'est un site e-commerce où les femmes peuvent commander les bouteilles à l'unité pour goûter à une grande variété de vins. \r\n\r\nEduquer les femmes au vin est une cause qui peut sembler bien dérisoire à côté d'autres causes bien plus graves. Mais, mises bout à bout, les petites causes ne font-elles pas un monde meilleur ? Depuis que j'y travaille, je me sens plus fière de ce que je fais tous les jours, plus heureuse, même si c'est difficile et peu lucratif pour l'instant. Chaque nouvelle lectrice du blog, chaque nouvelle cliente est une petite victoire et une femme de plus qui s'intéresse au vin. Cela lui permet d'intégrer des conversations jusqu'alors très masculines, et donc de l'aider à devenir l'égale de l'homme. \r\n\r\n","ideaForNow":"Je pose une question : Homme ou femme, vous êtes-vous déjà demandé ce que vous aimez comme vin ? Si vous trouvez ce que je vous aimez, vous arrêterez de subir les choix des autres, vous pouvez devenir maîtres de vos choix. Ceci est vrai dans le vin mais c'est vrai aussi partout ailleurs. Qu'est-ce que j'aime ? Qu'est-ce que j'ai envie de faire ? \r\n\r\nJe crois que de nombreuses petites causes valent la peine d'être défendues et peuvent faire l'objet d'une entreprise lucrative. Des communautés avec un besoin réel peuvent être clairement identifiées et ciblées. Mais d'autres communautés peuvent être aussi incitées, encouragées à s'approprier des produits ou des services qu'elles s'interdisaient jusqu'alors.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1021,"firstname":"Magali","lastname":"REME","hash":"88c95bab6d25a96ee6205f8321d24498","links":[]}],"interests":["internet social","Entrepreneuriat","femme","vin","niche","e-commerce"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/432"},{"rel":"speaker","href":"http://localhost:8081/api/member/1021"}]},{"idSession":434,"votes":41,"positiveVotes":37,"nbConsults":971,"lang":"fr","format":"Talk","title":"Introduction aux Google Glass","summary":"Introduction aux Google Glass: utilisation, développement et retour d'experience après 1 an d'utilisation.","description":"Cette conférence est une introduction sur les Google Glass et couvrira ce que sont les Glass, comment elles fonctionnent et ce qu'on peut déjà faire avec. \r\nOn parlera ensuite de développement via la Mirror API et le GDK Sneak Peek, pour finir par un retour d'expérience en tant que Glass Explorer et développeur depuis un an. \r\n","ideaForNow":"","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1022,"firstname":"Alain","lastname":"REGNIER","hash":"0e0d500e4333290a36e691c9d797ec69","links":[]}],"interests":["Google Glass"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/434"},{"rel":"speaker","href":"http://localhost:8081/api/member/1022"}]},{"idSession":438,"votes":44,"positiveVotes":41,"nbConsults":1111,"lang":"fr","format":"Talk","title":"Bien choisir son serveur de message","summary":"L'ubiquité de l'information n'a jamais été aussi prégnante. De quels outils je dispose en tant que développeur et comment choisir le bon ?","description":"Déporter l’envoi d’un mail, notifier des applications tierces, synchroniser des caches distribués, transférer des logs, communiquer entre des portables… On ne compte pas les cas d’utilisation d’un serveur de message. Pourtant c’est souvent un outil mal appréhendé.\r\n\r\nEntre les différents protocoles et API (JMS, AMQP, STOMP, MQTT...) et les différents outils existants (ActiveMQ, RabbitMQ, Kafka, 0MQ …), quels sont les critères pour faire le meilleur choix ? Nous verrons comment se poser les bonnes questions sur la consistance, la performance ou encore la scalabilité.\r\n\r\nNous profiterons également de cette occasion pour replacer dans le contexte du SI ce middleware trop souvent négligé.","ideaForNow":"* vous pourrez poser les bonnes questions pour choisir un serveur de message\r\n* vous aurez envie de rendre tous vos services asynchrones","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1012,"firstname":"Guillaume","lastname":"ARNAUD","hash":"1470dd5d2be736168fb9d4dbecab95b7","links":[]}],"interests":["Broker","ZeroMQ","RabbitMQ","kafka","MoM","Asynchronisme","Messaging"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/438"},{"rel":"speaker","href":"http://localhost:8081/api/member/1012"}]},{"idSession":440,"votes":22,"positiveVotes":21,"nbConsults":1050,"lang":"fr","format":"Talk","title":"Après les NUI","summary":"Les interfaces naturelles (NUI) sont une réalité: Touch, Kinect, LeapMotion, 3D Camera... Que peut-on en faire et quel sera l'après NUI ?","description":"Les interfaces naturelles (NUI) sont une réalité : interfaces tactiles, Kinect, LeapMotion, Gesture Camera… \r\nLes constructeurs PC intègrent déjà les NUI directement dans leur gamme de produits 2014. \r\n\r\nCette session vous montrera comment utiliser ses technologies innovantes de manière pertinente pour améliorer vos interactions utilisateurs et créer de nouveaux services (Relation client, Marketing\r\nProductivité, Hygiène et sécurité, Data-visualization...)\r\n\r\nLes NUI, c'est maintenant ! Mais quel futur se profile pour nous et nos utilisateurs. Nous aborderons les évolutions et nouvelles tendances avec notamment les nouveaux capteurs embarqués permettant de créer des smart-objects et les interfaces individuelles.\r\n\r\n\r\nPour le staff:\r\nSession semi-technique (état de l'art, principes et concepts NUI)\r\nJe ferai quelques démos Kinect sur scène.\r\nCette session est une évolution de ma session SoftShake13 : http://www.youtube.com/watch?v=vpBjBi1QaIY \r\n\r\n\r\n","ideaForNow":"Tester de nouvelles interactions avec Kinect/LeapMotion/GoogleGlass...","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1028,"firstname":"Vincent","lastname":"GUIGUI","hash":"1daeada4984e4b648571dbb1e9429a91","links":[]}],"interests":["NUI","Kinect","LeapMotion","Interfaces Naturelles"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/440"},{"rel":"speaker","href":"http://localhost:8081/api/member/1028"}]},{"idSession":442,"votes":17,"positiveVotes":17,"nbConsults":1101,"lang":"fr","format":"Workshop","title":"Des bits aux atomes: re-matérialisons!","summary":"Comment utiliser toutes ses compétences acquises en tant que développeur pour créer et partager des objets tangibles paramétriques?","description":"Le numérique accueille depuis peu un petit nouveau: la fabrication numérique. L'essor de l'impression 3D signe l'ère de la re-matérialisation; on peut désormais fabriquer des objets assez facilement depuis un fichier informatique. Bonne nouvelle: vous avez toutes les compétences pour le faire!\r\n\r\nLors de cet atelier vous apprendrez à \"programmer\" des objets en 3D directement imprimables, et vous aurez tous les outils en main pour créer des objets paramétriques. En intégrant directement les contraintes d'impression 3D, vous pourrez créer des objets qui s'impriment bien sur l'imprimante 3D qui vous attendra sur une table (!).\r\n\r\nAu passage, ce sera pour vous l'occasion de découvrir l'*open hardware*, pendant tangible de l'open source. Imaginez des objets créés collectivement de manière agile, versionnés, partagés librement et reproductibles dans n'importe quel fablab...\r\n\r\nVous avez l'opportunité d'apporter tout votre savoir-faire numérique au mouvement maker! Je vous montrerai comment.","ideaForNow":"Je peux créer des objets imprimables en 3D très facilement. Je connais les principales plateformes pour partager mes objets *en respectant mes habitudes de travail*. Je peux apporter un réel plus au mouvement maker.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":981,"firstname":"Stéphane","lastname":"MOR","hash":"c44b1dad1d53befa06b6cdd89f80fa0c","links":[]}],"interests":["3D","OpenSource","Open hardware","imprimante 3D"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/442"},{"rel":"speaker","href":"http://localhost:8081/api/member/981"}]},{"idSession":462,"votes":41,"positiveVotes":39,"nbConsults":1195,"lang":"fr","format":"Workshop","title":"Devops, en parler c'est bien, en faire c'est mieux","summary":"Venez jouer aux marionnettes grâce à Puppet avec l'aide d'un vagabond (Vagrant) \r\npour vous faire une idée concrète sur une pratique Devops","description":"Venez jouer aux marionnettes grâce à Puppet avec l'aide d'un vagabond (Vagrant) \r\npour vous faire une idée concrète sur une pratique Devops.\r\n\r\n**Atelier Devops :**\r\n\r\n - utilisation de Vagrant pour lancer des Machines Virtuelles (VM)\r\n - explications Vagrant, création box, début provisionning\r\n - Puppet : démo avec un Puppet master (sur le poste du participant)\r\n - Puppet : explication de la structures de répertoire de /etc/puppet (organisation, exemple de code)\r\n - Coder du puppet\r\n - Déployer : httpd + contenu static\r\n - Externaliser le paramétrage avec hiera\r\n - Déployer : httpd + contenu 'paramétré'\r\n\r\n**Prérequis :**\r\n \r\nVoici la liste des composants à installer.\r\n\r\nLa première étape de l'atelier sera de valider l'installation de votre poste.\r\n\r\n<table>\r\n<tr><td>soft </td><td>  lien </td></tr>\r\n<tr><td> Virtualbox </td><td>  <a href=\"https://www.virtualbox.org/wiki/Downloads\">Download Virtualbox</a>  4.3.10 </td></tr>\r\n<tr><td> Virtualbox extensions </td><td> <a href=\"http://download.virtualbox.org/virtualbox/4.3.10/Oracle_VM_VirtualBox_Extension_Pack-4.3.10-93012.vbox-extpack\">Download Virtualbox Extensions</a> </td></tr>\r\n<tr><td> Vagrant </td><td> <a href=\"http://www.vagrantup.com/downloads.html\">Download Vagrant</a> </td></tr>\r\n<tr><td> A Vagrant box </td><td> <a href=\"http://packages.vstone.eu/vagrant-boxes/boxes/centos-6.x-64bit-puppet.3.x-vbox.4.3.10-1.box\">centos-6.x-64bit-puppet.3.x-vbox.4.3.10-1.box</a> </td></tr>\r\n<tr><td> Gepetto (IDE) </td><td> <a href=\"http://puppetlabs.github.io/geppetto/download.html\">Download Gepetto</a> </td></tr>\r\n</table>\r\n\r\n> **Attention**\r\n> En raison des contraintes de paramétrage des VM il est important de garder la cohérence entre la version de la box Vagrant et la version de Virtualbox.\r\n> - centos-6.x-64bit-puppet.3.x-vbox.**4.3.10**-1.box nécessite Virtualbox **4.3.10**\r\n\r\n**Les sources sont sur Github**\r\n[devops_puppet_workshop](https://github.com/smougenot/devops_puppet_workshop)\r\n\r\n**Les slides sont sur Slideshare**\r\n[puppet-workshop](http://www.slideshare.net/SMougenot/puppet-workshop)","ideaForNow":"- Créer une VM en une ligne de commande\r\n- Automatiser la construction d'une forge\r\n- Spécifier son infrastructure dans du code","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":93,"firstname":"Sylvain","lastname":"MOUGENOT","hash":"7caa5aff154807cad6671d49bd890353","links":[]}],"interests":["DevOps","Puppet","Vagrant"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/462"},{"rel":"speaker","href":"http://localhost:8081/api/member/93"}]},{"idSession":482,"votes":29,"positiveVotes":27,"nbConsults":1138,"lang":"en","format":"Workshop","title":"Can You Do IT Better? Uncover the Way using LEGO®","summary":"Discover and play with your unique insights into IT development. Experience strategic model building and discovery using LEGO Serious Play.","description":"*Please Note Session Limit: 24 Participants*\r\n\r\nLet’s *really* uncover better ways of developing software. **Forget about dogma, rules, manifestos, frameworks** and **processes** and **unleash your imagination** to construct a better way of doing software. In this workshop, you will **experience the power of accelerated learning and discovery using LEGO® SERIOUS PLAY® to create strategies for innovation and change.**\r\n\r\nLEGO® Serious Play® is a powerful facilitated approach for using LEGO® to **free your imagination by constructing 3-D metaphorical models**. Using the LEGO® bricks you will be fully-engaged with hands-on, **accelerated learning techniques** that allow you to see deeply and gain a meaningful understanding of your imaginative strategies for building better software.\r\n\r\nThe LEGO® Serious Play® methods are **based on the learning theories of Piaget and Papert** and were developed by Johann Roos and Bart Victor at the respected International Institute for Management Development (IMD) in Lausanne, Switzerland. \r\n\r\nIf you are curious about using the facilitated LEGO® Serious Play® process to discover strategy, create change, or charter stronger teams **this is your chance to try it out with a trained and experienced facilitator**.\r\n\r\n**NOTE:** In this workshop you'll receive a quick introduction to the theory behind LEGO® Serious Play®, and you will use the process to explore the real strategic application of uncovering better ways of developing software. This is not a full workshop which can last four hours, a full day or even longer. At the end of our 2:30 hour introduction session you will have your first valuable result, and you'll hear about the ways a full workshop would continue.\r\n\r\nIf this sounds dry to you, then think of it like this: **we’re simply going to play with a lot of cool LEGO®**, and while we're having an awesome time doing that through LEGO® Serious Play® we’re going to discover and actually play with new insights into software development. ","ideaForNow":"* I have discovered rich ways of developing software better\r\n* I know the first concrete action to take to improve my organisation's way of developing software\r\n* I understand concrete thinking from experience, and I can uncover new ideas and visions by building dialogue around 3-D metaphorical LEGO models\r\n* Workshops using LEGO® Serious Play® are amazing fun and seriously solution focused","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1036,"firstname":"Steve","lastname":"HOLYER","hash":"cb596be2a4846d6e37f9703d27412df9","links":[]}],"interests":["culture hacking","accelerated learning","story telling","Lego","constructivism","change","dialogue","challenge","discovery","strategy","fun","imagination"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/482"},{"rel":"speaker","href":"http://localhost:8081/api/member/1036"}]},{"idSession":485,"votes":41,"positiveVotes":39,"nbConsults":1777,"lang":"en","format":"Talk","title":"Open-Sourcing http://spring.io","summary":"How does the Spring team develop and operate the new spring.io, entirely with Pivotal technologies? We're here to share our experience.","description":"With the unveiling of the Spring IO platform and important changes in the Pivotal Spring technology stack, the Spring team is happy to introduce a brand new spring.io website.\r\n\r\nWait, why talk about this at mix-it? Well, spring.io is written entirely in Spring, runs on Cloud Foundry and is now an open source project. \r\n\r\nFrom Spring Boot, Cloud Foundry, Bower and Gulp to open source challenges, we're here to give you a complete picture of one of the central pieces of our infrastructure - and hopefully some ideas to take home...","ideaForNow":"* Starting a new project using Spring Boot.\r\n* Hosting your app on Cloud Foundry and pushing to production with [green/blue deployments](http://martinfowler.com/bliki/BlueGreenDeployment.html)\r\n* Getting a feel of what an up-to-date Spring 4 app looks like\r\n* Creating a JavaScript client app with [cujoJS's curl](https://github.com/cujojs/curl), [Bower](http://bower.io) and [Gulp](http://gulpjs.com)\r\n* Building documentation live, from github, using asciidoctor (and index it in ElasticSearch!)\r\n* ... and doing all this with a [100% remote team](http://spring.io/team)!\r\n\r\nSlides of the presentation are [available on speakerdeck](https://speakerdeck.com/bclozel/spring-dot-io).\r\n","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":62,"firstname":"Brian","lastname":"CLOZEL","hash":"7f6b3d65ae30e6fec52287f34e22dcb0","links":[]}],"interests":["JavaScript","Spring Boot","Spring","cloudfoundry"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/485"},{"rel":"speaker","href":"http://localhost:8081/api/member/62"}]},{"idSession":487,"votes":55,"positiveVotes":52,"nbConsults":1624,"lang":"en","format":"Talk","title":"boot2docker: zero to docker in 20s","summary":"boot2docker is a 24mb Linux distribution based on made specifically to run Docker containers. It runs completely from RAM.","description":"What started as a hack has turned into a real operating system, used by tens of thousands of developers worldwide. And it all started because we found that having a full featured host operating system isn't needed to run Docker images.\r\n\r\nboot2docker is essentially trying to change the way people develop, run and deploy software through Docker, across all OSes and hardware. It is opinionated, is distributed as an ISO image, and is read-only.\r\n\r\nMost importantly, an ecosystem is starting to develop around it:\r\n\r\n- [boot2docker-cli](https://github.com/boot2docker/boot2docker-cli) is a tool to run and manage a boot2docker virtual machine\r\n- [Mac OS X Installer](https://github.com/boot2docker/osx-installer) is a full featured installer that will allow anyone to run Docker on OS X.\r\n- [DVM](https://github.com/fnichol/dvm) is an on demand Docker virtual machine, thanks to Vagrant and boot2docker\r\n\r\nIn this talk, I will not only present you what boot2docker is, but what we stand for, and why we think our choices change the way we deal with OS and how Docker is paving the way to the next generation of software.","ideaForNow":"Get started real fast with Docker (yes, on OS X)","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":969,"firstname":"Steeve","lastname":"MORIN","hash":"f518b5de9d6bca3aea55172f6a73ba14","links":[]}],"interests":["minimalism","Linux","tiny core linux","Docker"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/487"},{"rel":"speaker","href":"http://localhost:8081/api/member/969"}]},{"idSession":492,"votes":19,"positiveVotes":17,"nbConsults":696,"lang":"en","format":"Talk","title":"Coach like a wizard: Agile wisdom of Gandalf","summary":"In case you thought Gandalf's wisdom was applicable only to Hobbits, this talk uses his philosophy to help you learn to help your teammates.","description":"Most people know the character Gandalf as a wizard with a knack for helping Hobbits save Middle Earth. But his timeless wisdom applies to agile teams, too! Whether you coach teams or simply like to help your teammates improve, you will learn in this talk how to empower people, enable them to fail safely, empathize with them and help them see and share in the bigger vision. We'll do this by reviewing a few quotes from JRR Tolkien's Middle Earth novels (Hobbit, Lord of the Rings) -- as well as a couple of video clips from the movies -- and applying the principles to knowledge work on 21st century Real Earth.","ideaForNow":"How to empower people\r\nHow to enable them to fail safely\r\nHow to empathize with them\r\nHow to help them see and share in the bigger vision","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":916,"firstname":"Matthew","lastname":"PHILIP","hash":"20a5b0d9ca34a1cce6d4552423cfebc1","links":[]}],"interests":["empowerment","team","Coaching","whole-team approach"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/492"},{"rel":"speaker","href":"http://localhost:8081/api/member/916"}]},{"idSession":494,"votes":30,"positiveVotes":25,"nbConsults":923,"lang":"en","format":"Talk","title":"Party Like It’s 1999","summary":"We've taken 2 steps forward but 1 step back to bring interactivity to to the web. Let's change the way we think about writing web apps.","description":"The past 15 years of the web have been a hot mess. Somehow we survived the metric ton of pain that we’ve all lived through making websites work. We have a different set of problems (and browsers) that we need to work with, but at its core, web sites aren’t that different.\r\n\r\nWe have a pile of markup coming from the server which the browser knows how to parse and turn into a pretty picture. We still have HTML, CSS, JS. We’ve ironed out a lot of the kinks (and introduced new ones). We have better tools (and better designers), but the technologies haven’t changed much. What has changed is how we use these technologies. Web 2.0 happened. We all made tag clouds that loaded XML from our server and generated markup in JS and then stuck it into the DOM with innerHTML.\r\n\r\nA lot of us are building applications now, not web pages. The complexity has increased by orders of magnitude. In 1999 we got some data from a database and rendered HTML on the server — that was the only place responsible for markup. Now we’re changing the display based on user interaction. We’re managing state on the client and server. We’re duplicating logic.\r\n\r\nIn this talk, I’ll discuss about how we can build the web like it’s 1999 but still get the goodies that we’ve come to love, without having to resort to complicated spaghetti code. We’ll use [Facebook’s React](http://facebook.github.io/react/) as an example of a tool to help approach this problem.","ideaForNow":"* Adding dynamic content to your page can be as simple as it is on the server.\r\n* Declarative and functional programming is a surprising useful tool on the web, and it fits quite nicely.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":960,"firstname":"Paul","lastname":"O'SHANNESSY","hash":"10e6f9e15d7148c230fce273ee1865ee","links":[]}],"interests":["JavaScript","Declarative Programming","HTML","React"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/494"},{"rel":"speaker","href":"http://localhost:8081/api/member/960"}]},{"idSession":495,"votes":64,"positiveVotes":62,"nbConsults":1184,"lang":"en","format":"Talk","title":"Scaling up Twitter systems","summary":"Scaling up Twitter systems to support millions of users and millions of lines of heterogeneous code. ","description":"Twitter is one of the most heavily trafficked sites on the internet, with over <b>240 million active users</b> and serving over <b>500 million Tweets per day</b>. Twitter, as a company and as a service has seen  remarkable growth in its eight years of existence. Scaling its services to meet high traffic demands and scaling our development tools to support millions of lines of heterogeneous code have both been challenging and rewarding.\r\n\r\nHistorically, nearly all of Twitter's traffic had been served by a monolithic application written in Ruby on Rails. Our growing user base, rapid development cycles and changing business needs all contributed to redesigning our monolithic codebase and move to a services oriented architecture. \r\n\r\nIn this talk, I will attempt to explain how Twitter scaled to support a) millions of users and b) millions of lines of code and how the community can leverage from these experiences and open source tools being developed.\r\n\r\n<b>How to scale to support millions of users? </b>\r\nFor higher performance, scalability and resilience to failure, we worked on the migration of Ruby on Rails based monolithic Twitter services to Services Oriented Architecture (SOA), where the services are JVM processes, mostly written in Scala and communicate with one another asynchronously over a network connection. \r\n\r\n<b>How to scale to support millions of lines of heterogeneous code? </b>\r\nPants Build system at Twitter is a state-of-the-art build tool designed to support polyglot services.  This tool is open sourced and is being actively worked on and rapidly adopted in the community.\r\n\r\n\r\n","ideaForNow":"","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1052,"firstname":"Ity","lastname":"KAUL","hash":"bbc4ddc4d77c9274fb9d03bfc8813608","links":[]}],"interests":["Scala","build","scalability"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/495"},{"rel":"speaker","href":"http://localhost:8081/api/member/1052"}]},{"idSession":496,"votes":29,"positiveVotes":24,"nbConsults":941,"lang":"fr","format":"Workshop","title":" Les Habits Neufs de l'Empereur","summary":"Un jeu pour améliorer sa communication aux autres, en particulier en situation de stress, en s'appuyant sur le concept de congruence.","description":"Le changement, ça commence par soi-même.\r\nParmi les valeurs de l'agilité, il y a la communication (« Les individus et les interactions, plus que les processus et les outils. »). \r\nDans cet atelier, je vous propose d'améliorer votre communication aux autres, en particulier en situation de stress, au travers d'un jeu proposé par Portia Tung et Jenni Jepsen, les Habits Neufs de l'Empereur.\r\nNous aborderons ainsi le concept de congruence, avec l'objectif d'apprendre à l'appliquer à notre comportement. C'est une manière, dans notre vie de tous les jours, d'améliorer notre communication, et de réduire notre stress.","ideaForNow":"","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1053,"firstname":"Dorothée","lastname":"LE SEAC'H","hash":"3783b92685a52c1c3155a5560409ea69","links":[]},{"idMember":985,"firstname":"Pierrick","lastname":"THIBAULT","hash":"7778e35ffaa7d007cbe2d5d03b55de51","links":[]}],"interests":["Communication"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/496"},{"rel":"speaker","href":"http://localhost:8081/api/member/1053"},{"rel":"speaker","href":"http://localhost:8081/api/member/985"}]},{"idSession":497,"votes":28,"positiveVotes":26,"nbConsults":980,"lang":"fr","format":"Talk","title":"Des produits avec des équipes distribuées ?","summary":"Agile et Open Source comme source d'inspiration pour le développement de vos produits avec des équipes distribuées","description":"De nos jours, presque tout le monde sait faire grandir une infrastructure de machines en mode distribué, avec une très bonne communication entre elles, et en évitant les points uniques de défaillance (c'est une traduction de SPOF, single point of failure).\r\n\r\nEn y réfléchissant, des serveurs distribués à travers le monde ne sont pas si différents que des équipes distribuées, elles ont besoin de connection et de synchronisation...\r\n\r\n*Vraiment ?*\r\n\r\nNous sommes des humains... pas des machines…\r\n\r\n\r\nDans cette session, nous allons voir comment eNovance, une société qui conçoit des produits destinés à batir des infrastructures informatiques, d'ou le pitch initial... Nous allons donc voir comment eNovance a fait grandir son équipe de développement produits en mode distribué en suivant les valeurs et principes agile.\r\n\r\nCette session expliquera comment nous nous appuyons sur nos Product Owner pour guider nos contributions à des logiciels libres constitutifs de nos produits. Nous verrons par exemple comment nous planifions nos itérations en suivant le rythme donné par le projet Openstack. Nous verrons également comment nous organisons nos scrums, sprint planning, sprint review et retrospectives en nous adaptant à des équipiers positionnés sur différents fuseaux horaires.\r\n\r\nLa session présentera le mode de fonctionnement d'un projet open source emblématique : Openstack. Ainsi que la façon de contribuer de l'équipe eNovance.\r\n\r\n","ideaForNow":"* identification des éléments à prendre en compte pour pouvoir faire grandir des équipes distribuées\r\n* organisation d'un projet open source, source d'inspiration pour l'organisation des projets informatiques d'une DSI\r\n* innovation ouverte et gestion de produits","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":17,"firstname":"Alexis","lastname":"MONVILLE","hash":"1de6a276595f75143c50c2d08b795ddf","links":[]}],"interests":["Scalabilité","OpenSource","Openstack","Agile"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/497"},{"rel":"speaker","href":"http://localhost:8081/api/member/17"}]},{"idSession":498,"votes":53,"positiveVotes":47,"nbConsults":1296,"lang":"fr","format":"Talk","title":"L’amélioration continue au sein d’une équipe agile","summary":"Retour d'expérience d'une jeune et vaillante équipe technique adaptant ses méthodes de travail agiles aux réalités business.","description":"En deux ans d’existence, l’équipe technique de la société TEA est passée de 0 à 6 développeurs et continue de croître. Une forte croissance implique de fréquents changements de contexte qui risquent de perturber l’équipe. Elle doit les gérer en restant alerte et proactive.  \r\n\r\nCette conférence est le **retour d’expérience** d’une équipe de jeunes et vaillants développeurs s’adaptant aux réalités business tout en essayant d’améliorer la qualité de ses livrables. À force de belles avancées, de grands aller-retours et de petites boulettes, notre équipe recherche constamment une méthodologie agile qui lui convient. Notre évolution passe par : \r\n\r\n * Scrum vs Kanban : du mode **flux** à **l’itératif**, et inversement ;\r\n * les **réunions** : minimiser leur durée, maximiser leur apport ;\r\n * la **revue de code** : à posteriori, en binômage, outillée ou pas ;\r\n * l’intégration d’un **nouveau développeur** ;\r\n * la boîte à outils de la vie d’équipe : planning-poker, daily scrum, burn down…\r\n\r\nCette présentation ne vise pas à donner l’organisation parfaite d’une équipe (on sait tous qu’elle n’existe pas), mais à présenter nos **outils et pratiques** nous permettant de tendre vers celle-ci.\r\n","ideaForNow":" * Cadrer les réunions\r\n * Mettre en place de la revue systématique de code\r\n * ...","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":490,"firstname":"Anne-sophie","lastname":"TRANCHET","hash":"636aad17557106adcc64fc179556ed3f","links":[]},{"idMember":1034,"firstname":"Olivier","lastname":"SERVIERES","hash":"5943d5131ed8c47193d33930c5e135a6","links":[]}],"interests":["Kanban","code-review","Amélioration continue","Scrum","équipe auto-organisée","Agile"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/498"},{"rel":"speaker","href":"http://localhost:8081/api/member/490"},{"rel":"speaker","href":"http://localhost:8081/api/member/1034"}]},{"idSession":500,"votes":51,"positiveVotes":49,"nbConsults":1582,"lang":"fr","format":"Talk","title":"Machine learning et régulation numérique","summary":"L’objectif est de donner aux auditeurs les bases nécessaires pour comprendre le machine learning.","description":"Le machine learning est la science qui permet à un algorithme d’apprendre sans avoir été explicitement programmé pour cela. Elle est utilisée par les acteurs de la nouvelle économie pour le traitement de gros volumes de données, dans la traduction automatique, la reconnaissance de la parole, la classification de consommateur, la construction de réputation, ou la prévision des trafics. C’est la “régulation numérique”.\r\n\r\nNous parlerons des champs d’application du machine learning par les gros acteurs du numérique, de ses fondements mathématiques, des grands familles d’algorithmes et des outils disponibles pour mettre en pratique.\r\n\r\nDécouvrez les bases pour comprendre cette science et mesurer le potentiel des possibilités de son utilisation.","ideaForNow":"J'ai compris les bases du machine learning. Je sais si je veux devenir Data Scientist.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":27,"firstname":"Guillaume","lastname":"LAFORGE","hash":"137d3908243acfc30e126615d59d4e6d","links":[]},{"idMember":698,"firstname":"Didier","lastname":"GIRARD","hash":"ece9780c444d2306259572b997aca0ef","links":[]}],"interests":["data scientist","Big Data","Machine Learning"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/500"},{"rel":"speaker","href":"http://localhost:8081/api/member/27"},{"rel":"speaker","href":"http://localhost:8081/api/member/698"}]},{"idSession":509,"votes":24,"positiveVotes":24,"nbConsults":1232,"lang":"en","format":"Keynote","title":"Programming Diversity ","summary":"How does the lack of diversity in tech hurt us and what can we do as individuals, businesses, and communities to correct it?","description":"It's been scientifically proven that more diverse communities and workplaces create better products and the solutions to difficult problems are more complete and diverse themselves. Companies are struggling to find adequate talent. So why do we see so few women, people of color, and LGBTQ people at our events and on the about pages of our websites? Even more curiously, why do 60% of women leave the tech industry within 10 years? Why are fewer women choosing to pursue computer science and related degrees than ever before? Why have stories of active discouragement, dismissal, harassment, or worse become regular news? \r\n\r\nIn this talk we’ll examine the causes behind the lack of diversity in our communities, events, and workplaces. We’ll discuss what we can do as community members, event organizers, and co-workers to not only combat this problem, but to encourage positive change by contributing to an atmosphere of inclusivity.\r\n","ideaForNow":"","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":996,"firstname":"Ashe","lastname":"DRYDEN","hash":"29ff20a2ac375ff989f3bff70b71b23d","links":[]}],"interests":["diversity","community"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/509"},{"rel":"speaker","href":"http://localhost:8081/api/member/996"}]},{"idSession":514,"votes":30,"positiveVotes":24,"nbConsults":1007,"lang":"en","format":"Talk","title":"How to make better decisions","summary":"While HOW to make decisions is important, the WHEN to make decisions is critical to your chances of success. ","description":"While HOW to make decisions is important, the WHEN to make decisions is critical to your chances of success. \r\n\r\nTiming is everything, however deferring commitments causes stress to many people. Real options helps you manage that stress by creating bounded uncertainty in an context of total uncertainty. This is not a simple process that you copy and learn to adopt through practice. This is a new way at looking at the world around you that starts by learning to differentiate between options and commitments. Olav helps do this through an interactive exercise.\r\n\r\nIt turns out that the way you manage your options is to focus on commitments and attempt to avoid or defer them. After identifying commitments, Olav discuss creating options to turn the commitments into reversible commitments.\r\n\r\nChris Matts and Olav Maassen have recently created “Commitment”, the first graphic business novel about managing project risk. Because they eat their own dog food Real Options plays a big part in the creation part of the book as well. Olav presents the creation process as a case study about applying Real Options and how that leads to different behavior.\r\n\r\nFinally Olav presents a number of mini case studies where other people have applied Real Option thinking in “out of the box” situations. Once you get it, it will change your life.","ideaForNow":"Make better decisions\r\nKnow when to commit and when to leave options open","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1056,"firstname":"Olav","lastname":"MAASSEN","hash":"373b19eedf56cf13eb8bcc6a610a6215","links":[]}],"interests":["Real Options","risk management","decision making"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/514"},{"rel":"speaker","href":"http://localhost:8081/api/member/1056"}]},{"idSession":515,"votes":20,"positiveVotes":18,"nbConsults":1184,"lang":"en","format":"Talk","title":"Prioritising ideas using Cost of Delay","summary":"This session examines how a Fortune 500 company used an economic framework across a $100m portfolio to improve prioritisation.","description":"Improving prioritisation has become a tired concept in most IT departments, and yet it has the potential to change the conversation from one of cutting cost, to delivering valuable solutions as quick as the business needs it.\r\n\r\nMost organisations don't suffer from a lack of innovative ideas, they suffer from not being able to pick the best of what turns out to be a bad bunch. Thanks to the consumerisation of IT and software eating the world this is getting worse. Innovation and software development is already synonymous in most organizations. As Jack Welch says: If you are not moving at the speed of the marketplace you're already dead – you just haven't stopped breathing yet.\r\n\r\nSo how do we improve the way we prioritise to ensure that we're delivering value quickly and not wasting our precious capacity to innovate? Since economics is all about scarcity, we can turn to economics to help us quickly discover, nurture and speed up the delivery of value. This session examines how a Fortune 500 company used an economic framework across a $100m portfolio to:\r\n\r\n1. Improve Prioritisation – by using CD3 (Cost of Delay Divided by Duration) \r\n2. Improve Decision-making – by making the economic trade-offs visible\r\n3. Change the Focus – from efficiency and cost to speed and value","ideaForNow":"How to survive in a world where stakeholders want it all? And they want it yesterday? Are you tired of conflicting priorities and mechanisms that do not give your clear priorities? Then this session is for you!  At the end of this session, you will leave with an economic framework to prioritise ideas. I will show examples of how cost of delay is calculated and a step by step approach for you to adopt to your own work. ","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1071,"firstname":"Özlem","lastname":"YÜCE","hash":"ebc4b8017bc7a37ce7bcb2f0cbbffae6","links":[]}],"interests":["Product Owner","cost of delay","economic framework","prioritisation","Product Backlog"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/515"},{"rel":"speaker","href":"http://localhost:8081/api/member/1071"}]},{"idSession":518,"votes":30,"positiveVotes":28,"nbConsults":796,"lang":"en","format":"Talk","title":"Consulting Secrets for Effective Communication","summary":"We all communicate, but some people seem more effective. Attend \"Consulting Secrets\" to learn how you can give your message more impact!","description":"Sometimes it's not just about code. It's about understanding, sharing, communication, and leverage. \r\n\r\nUnfortunately, the skills to work well with others--from stakeholders, to users, to team mates--isn't taught in school. It's not taught most anyplace. \r\n\r\nThis interactive talk will give participants the chance to practice stances and communication techniques that will immediately impact their effectiveness. \r\n\r\nTake advantage of this opportunity to learn how consultants use the skills of business analysts and scrum masters to influence the opinions and actions of people around them. Come and learn practical \"soft skill\" tips for making an impact on your project, team members, stakeholders, and executives. \r\n","ideaForNow":"* How your body language influences you and others. \r\n* How to use language so others will listen and care your message. ","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1060,"firstname":"Jeffrey","lastname":"DAVIDSON","hash":"4cfa02b640803caa995097c0e12a769d","links":[]}],"interests":["Communication"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/518"},{"rel":"speaker","href":"http://localhost:8081/api/member/1060"}]},{"idSession":520,"votes":49,"positiveVotes":43,"nbConsults":1246,"lang":"fr","format":"Talk","title":"Rapport coût/performance de différentes stacks Web","summary":"On a mis à l'épreuve différents patterns d'architectures et différentes stack Web concernant leurs coûts d'exécution sur un Cloud","description":"Les choix d’architecture logicielles ont un impact important sur la capacité des systèmes à supporter la charge qui leur est imposée, sur la fiabilité du système sur sa latence et sur d’autres paramètres encore.\r\n\r\nDepuis l’arrivée des infrastructures Cloud et de leur mode de fonctionnement pay-as-you-go, le coût devient aussi un élément à prendre en compte.\r\n\r\nCette session se penchera en détail sur le rapport coût performance de différentes solutions techniques, JEE, Scala, NodeJS et de quelques autres. Nous feront aussi varier certains paramètres de l’infrastructure Cloud (AWS) elle-même (impact des EBS PIOPS, des nouveaux types d’instances, …). La combinatoire étant très élevée, un sous-ensemble sera sélectionné.\r\n\r\nPour chaque test, une synthèse des paramètres significatifs de performances (nombre de transactions réalisées, latence, …) et de coûts (Compute, Storage, Network, IO, …) sera présentée, l’idée étant de détecter les patterns d’architecture et les technologies qui semblent être les plus efficaces dans le cadre d’un déploiement Cloud.\r\n\r\nLa tâche de comparaison étant immense, nous nous appuierons sur des \"templates de benchmarks\" déjà créés et nous nous focaliseront sur l'impact au niveau de la consommation de resources Cloud.","ideaForNow":"En tant qu'architecte logiciel, l'efficacité coût est quelque chose que je vais devoir de plus en plus prendre en compte car le Cloud a rendu les différences visibles et significatives.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1074,"firstname":"Nicolas","lastname":"FONROSE","hash":"eee7f014649a6a59501dfd44d052411e","links":[]}],"interests":["Efficiency","Cloud","Cost"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/520"},{"rel":"speaker","href":"http://localhost:8081/api/member/1074"}]},{"idSession":521,"votes":20,"positiveVotes":17,"nbConsults":969,"lang":"en","format":"Talk","title":"Developing Great ScrumMasters","summary":"Who makes a great ScrumMaster? How to hire them? How to train them? How to develop great ScrumMasters? Some answers and lots of FUN! :P","description":"The Scrum Master, as defined by Agile literature, is responsible of maintaining the Scrum process, which calls for a deep understanding of the Scrum mechanics. But, according to many, he is also responsible of team development, continuous improvement, Agile adoption, team facilitation, change management or even one-on-one coaching. This talk will present two frameworks that include an evolution path for the Scrum Master and how to select and develop great ScrumMasters. These frameworks are based  on several fields, including psychology, coaching, motivational science, communication skills, corporate culture or change management. Over all, it will give you some clues on how to identify, hire and develop great Scrum Masters.\r\n","ideaForNow":"","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1076,"firstname":"Angel","lastname":"MEDINILLA","hash":"bfe39d10318bb80b9efe49c72065c548","links":[]}],"interests":["Leadership","Facilitation","ScrumMaster","Agile Facilitator","Team Dynamics","Collaboration","Agile Coach","Teamwork","Coaching"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/521"},{"rel":"speaker","href":"http://localhost:8081/api/member/1076"}]},{"idSession":522,"votes":19,"positiveVotes":18,"nbConsults":800,"lang":"en","format":"Workshop","title":"Drawing 101: Mastering the Stickman!","summary":"'I can't draw' is wrong! Anyone can draw and can enhance their visual facilitation skills. This is no theory - come and DRAW FROM SCRATCH!","description":"Over the last years there is a growing interest in fields and practices like visual facilitation, visual communication, skecthnoting, story telling... Still, most people get thwarted on the beginning steps - drawing! \r\n\r\nAs Jurgen Appelo uses to say, it's not that people 'can't draw', only they might not be able to draw as professional artists, but even the most rudimentary skills on drawing can provide amazing results when it comes to enhance your facilitation and coaching work. \r\n\r\nThis workshop will start from scratch, with no previous skills required other than holding a pen, and will provide you with enough background to start your visual facilitation and sketching path with one of the most powerful tools for story telling - the stick man! \r\n\r\nOverall, lots of fun guaranteed... :P","ideaForNow":"","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1076,"firstname":"Angel","lastname":"MEDINILLA","hash":"bfe39d10318bb80b9efe49c72065c548","links":[]}],"interests":["Visual","sketching","story telling","visual communication","Visual facilitation","drawing"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/522"},{"rel":"speaker","href":"http://localhost:8081/api/member/1076"}]},{"idSession":523,"votes":26,"positiveVotes":23,"nbConsults":1017,"lang":"en","format":"Talk","title":"Design meets Agile","summary":"What is Service Design Thinking? And how does it relate to the agile world?","description":"There is a lot buzz about service design and design thinking as means to innovate. But how do they relate to the methods and mind set of agile? What is the role of a designer in an agile organization? And how could she/he contribute to generate and increase customer value? In his talk, Jens Otto Lange will give a short overview about the history of design in business, explain the ideas of design thinking and service design and suggest how these disciplines could help your team to create products and services that create superior customer value. ","ideaForNow":"// I've an idea how service design thinking could contribute to create customer value.\r\n// I'm more familiar about what design actually is, and could be in an agile world.\r\n","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1075,"firstname":"Jens otto","lastname":"LANGE","hash":"c0f1039fa142ecf01a5b2860e203f8e8","links":[]}],"interests":["innovation","design","UX design","design thinking","creative collaboration","service design"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/523"},{"rel":"speaker","href":"http://localhost:8081/api/member/1075"}]},{"idSession":525,"votes":41,"positiveVotes":40,"nbConsults":1142,"lang":"en","format":"Talk","title":"How to rewrite your JavaScript app ten times","summary":"Rewriting code that seemed like it would work is never any fun. How do you avoid it? The short answer: lots of thoughtful planning.","description":"It would be nice if developers could download a JavaScript framework, plug in the custom logic required for their particular problem, and have a functional, scalable, and reliable application. As any who's tried can probably tell you, however, it doesn't work like that. It doesn't matter if your application has 5000 \"pages\" or less than 50 - it will eventually become a large application in terms of code, because size of code is not just a measure of the complexity of the app itself, but of its maturity. If you've tried taking an app from a minimal set of functionality to something complex enough to cover all the edge cases, you've probably done some rewriting. \r\nIf you haven't, it's your lucky day! We'll talk about several of the ways you can almost guarantee a rewrite in your app's future. If, on the other hand, rewrites don't sound like that much fun to you, we'll also talk about how to avoid them or at least minimise the risk they present.","ideaForNow":"Common pitfalls in planning JavaScript applications. Recommendations about the order in which to plan pieces of an application.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1069,"firstname":"Garann","lastname":"MEANS","hash":"76f795cabbf80024b1024517c67f0bcf","links":[]}],"interests":["JavaScript"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/525"},{"rel":"speaker","href":"http://localhost:8081/api/member/1069"}]},{"idSession":526,"votes":10,"positiveVotes":9,"nbConsults":649,"lang":"fr","format":"Keynote","title":"Les communautés et le monde IT sous d'autres cieux","summary":"Les communautés et le monde IT en Afrique : similitudes et divergences avec le modèle occidental (monde francophone et anglophone)","description":"Nous allons parler des communautés en Afrique, comment elles s'organisent, se financent etc...\r\nQue fait un développeur de sa journée de travail dans le contexte africain.\r\n\r\nNous allons montrer que l'Afrique est plurielle et on a les mêmes divergences entre le monde anglophone et francophone. Les réflexes dans le monde anglophone sont différents du monde francophone.\r\n\r\nNous allons aussi parler de quelques problèmes de la société africaine qui empêchent d'avoir au sein des DSI des équipes de développement performantes (les lacunes de la formation, le culte des grand diplômes, externalisation des projets etc...)\r\n\r\nEnsuite nous citerons quelques belles histoires de développeur qui ont réussi en Afrique.\r\n\r\nEnfin différentes stratégies dans grands groupes comme Google, IBM, Oracle et Microsoft en Afrique.","ideaForNow":"","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":107,"firstname":"Horacio","lastname":"LASSEY-ASSIAKOLEY","hash":"e59ffca2a2dfe733562ccc207ddd1af1","links":[]}],"interests":["comm","IT"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/526"},{"rel":"speaker","href":"http://localhost:8081/api/member/107"}]},{"idSession":529,"votes":40,"positiveVotes":35,"nbConsults":1691,"lang":"fr","format":"Talk","title":"Petit design pour grande humanité","summary":"Petit design pour grande humanité - Comment le design se rend-il utile à nos vies ?","description":"**Comment le design se rend-il utile à nos vies ?** L'imaginaire social autour de la création relève souvent du mythe (le design ça n'est pas rendre beau!) cependant, il suffit parfois de petites choses intelligentes pour innover et faire grandir l'humain de façon individuelle et collective ou collaborative. Au travers d'exemples et d'éléments clefs, je vous invite à découvrir, autour du monde, comment la création de services, de produits, d'objets, d'expériences peuvent changer nos vies. \r\n\r\n[ # **Retrouvez toute la conférence en ligne** # ](https://speakerdeck.com/geoffreydorne/petit-design-pour-grande-humanite-geoffrey-dorne-2014 \"Petit design pour grande humanité\")\r\n\r\nSujets abordés :\r\n\r\n* ce que n'est plus le design\r\n* le design comme une expérience\r\n* le designer comme un observateur des usages\r\n* le mouvement Jugaad\r\n* des exemples autour du monde\r\n* le paradoxe du design aujourd'hui \r\n* cinq clefs pour un design humain\r\n* les bonnes questions à se poser sur les projets\r\n\r\nRepartez avec plusieurs grands principes qui vous permettront de regarder le monde sous l'angle du design, de l'utile et de l'humain.","ideaForNow":"Méthodologie design de l'action. La vision que les petites choses peuvent parfois être suffisantes pour réaliser de grands changements.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1073,"firstname":"Geoffrey","lastname":"DORNE","hash":"e1e5be595b41fe3cf014cab6b2ef2a85","links":[]}],"interests":["Human","design"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/529"},{"rel":"speaker","href":"http://localhost:8081/api/member/1073"}]},{"idSession":530,"votes":14,"positiveVotes":14,"nbConsults":818,"lang":"en","format":"Keynote","title":"Serendipitous Disruption?","summary":"GitHub's Streaming Eagle will describe how they've brought serendipity back to the office.","description":"As many have heard, in the early days, GitHub chose not to have an office for almost 2 years. One of the major drivers for getting an office was to promote what is called  \"serendipitous interactions.\" The idea is that by coming into the office, one will encounter a broader set of people than the ones you are working closely with, and have interactions that cross-pollinate and produce unforeseeable innovation. It sounds great, but's completely false in practice.\r\n\r\nWhat really happens? You come in, and say \"Hi\" to the same people you see every day on the way there. You sit at your desk, near the same group of individuals, and then go to lunch with the same 3 people you always eat sandwiches with. \r\n\r\nIn \"Serendipitous Disruption?\", Patrick and Drew, counterparts in Streaming Eagle, will take the audience through their efforts to bring true serendipity back, describing their surprising methods and even more surprising outcomes. ","ideaForNow":"Attendees will leave armed and inspired to approach their office in a whole new way, fostering greater interactivity with the local community and breaking down walls.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1148,"firstname":"Patrick","lastname":"DUNNAM","hash":"e90b9d197aba32907c5fffcbff76c511","links":[]},{"idMember":1133,"firstname":"Streaming","lastname":"EAGLES","hash":"76cae11119860b7f898926c882949911","links":[]},{"idMember":1166,"firstname":"Drew","lastname":"WOODS","hash":"87ec3fc103b3c58a25de92fd65519387","links":[]}],"interests":["innovation","coworking","Music","office","Culture","Startup","serendipity"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/530"},{"rel":"speaker","href":"http://localhost:8081/api/member/1148"},{"rel":"speaker","href":"http://localhost:8081/api/member/1133"},{"rel":"speaker","href":"http://localhost:8081/api/member/1166"}]},{"idSession":540,"votes":9,"positiveVotes":9,"nbConsults":985,"lang":"en","format":"Keynote","title":"Biotech breaks free... and so does tech!","summary":"Trends in biotech are bringing new ways of interacting with living matters, and so do other techs. Let's talk about hacking... biohacking!","description":"Rieul Techer is a member of the non-profit organization \"La Paillasse\" in Paris one of the world's largest community laboratories, commonly called hackerspaces, that foster open access and open source biotechnologies. He is also the co-founder of \"La Paillasse Saône\" in Lyon, a non-profit organization strongly connected to the emerging network of \"Paillasses\" over the world and dedicated to open source cleantechnologies and bio-inspired technologies with a strong integration to the Rhône-Alpes innovation ecosystem. \r\nWorking closely with Thomas Landrain, co-founder and president of \"La Paillasse\" in Paris who is an active member of the Do-it-yourself Biology (DIYbio) community, organizing the launch of DIYbio Europe, and working regularly as one of its spokespersons, Rieul is an active member of the \"Tiers-Lieux\" community and highly committed to innovation (technology and social), open-concepts and the common goods production. \r\nConvinced that the 21st century will be the century of the citizen appropriation of the way to innovate from a DIY perspective, particularly in the field of bio-inspired technologies and cleantechnologies, he is focusing on making research and experimentation more accessible for citizens and amateurs. At \"la Paillasse\" people are developing cheap genetic diagnostic and creative use of biomaterials, but it won't stop at your door step... Rieul is working on democratizing the access to research and innovation in various fields, making more accessible to use technologies and for anyone to build useful low-tech at a limited cost.\r\nWith a highly interdisciplinary background in engineering, research, innovation, finance and management in the fields of energy and environment (strong interaction between bio and clean), Rieul is currently starting to work on innovation management process and financing; in the meantime he is co-building \"La Paillasse Saône\": the first eco-hacklab bridging bio and clean.","ideaForNow":"- If there is one idea you could apply right now it's: if I have a project or if I am just curious to learn and participate to projects, there is a space where I can do things that my lab, my company or others won't enable me to do, without entry barriers except ethics, transparency, respect and sharing. \r\n- What biotech is today.\r\n- What biohacking means and what it brings.\r\n- How to replicate biohacking at a broader scale with eco-hacking.\r\n- What I can prototype today.","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1216,"firstname":"Rieul","lastname":"TECHER","hash":"bb258c6598a2b601b91cee99843a799f","links":[]}],"interests":["crowdsourcing","open source","openinnovation","environment","openscience","cleantech","biotech","bioart","biodesign","sustainable development","research"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/540"},{"rel":"speaker","href":"http://localhost:8081/api/member/1216"}]},{"idSession":542,"votes":20,"positiveVotes":18,"nbConsults":1097,"lang":"fr","format":"Workshop","title":"Unity3D from zero to hero (Basic session)","summary":"Comprendre et maitriser les bases de Unity3D, le moteur de jeu qui a changé la donne en matière de développement de jeux.\r\n","description":"**Unity3D**, le moteur de jeu qui grimpe dont tout le monde parle mais que très peu montrent.\r\n\r\nCe Workshop a pour but de vous présenter **Unity3D**, le moteur de jeu qui a changé la donne en matière de développement. \r\nCe petit tour d’horizon, ainsi que quelques conseils pour **bien débuter**, vous permettront d’avoir une meilleure compréhension du moteur ainsi que du fonctionnement d’un jeu.\r\n\r\nVous apprendrez ce qu’est Unity, a quoi il sert, et surtout comment **maitriser les bases** de la bête afin de concevoir et développer très rapidement des jeux sur des plateformes aussi diverses que **smartphone, PC, MacOS, Linux, et même consoles**.\r\n\r\nCe Workshop est principalement destiné aux programmeurs, cependant peu de choses très complexes seront abordées, donc tous les corps de métiers pourront s’y retrouver.\r\n\r\nVenez, **si possible**, avec une machine équipée de [Unity 4.3](https://unity3d.com/unity/download) ainsi que l'[IDE](http://fr.wikipedia.org/wiki/Environnement_de_développement) de votre choix pour développer.\r\n","ideaForNow":"- Comment fonctionne un jeu\r\n- Maitriser un nouveau moteur \r\n- Une nouvelle logique de conception","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":955,"firstname":"Laurent","lastname":"VICTORINO","hash":"cb47e78c90aa301686e54e61d7a792f4","links":[]}],"interests":["Unity3D","Jeu video","games"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/542"},{"rel":"speaker","href":"http://localhost:8081/api/member/955"}]},{"idSession":559,"votes":6,"positiveVotes":6,"nbConsults":1302,"lang":"en","format":"Workshop","title":"Culture Hacking: How may we create more fun @work?","summary":"In this session we will co-design culture hacks to improve happiness at the workplace - and we will ask you to test the hacks!","description":"In this session we will co-design culture hacks to improve happiness at the workplace - and we will ask you to test the hacks we are going to prototype the next day when back at work!  \r\n\r\nWe need you to do some empathy work before the workshop, so please come prepared: \r\nAs input for the culture hack design challenge we need as many stories as possible about what makes your buddies happy or un-happy at work, what is fun and what’s wrong with work. So please grab a pen and some Post-its, get in touch with people and do a little interview to find out what makes them happy/unhappy. \r\n\r\nFor those of you unfamiliar with interviewing you may want to check this out: [Toolkit to support your design\r\nthinking practice](http://dschool.stanford.edu/wp-content/uploads/2011/03/BootcampBootleg2010v2SLIM.pdf) and if possible work in pairs. \r\n\r\nFor a quick intro to the concepts we are using have a look here: \r\n\r\n[Culture hacking: how may we increase happiness at our workplaces](http://www.slideshare.net/stefan-haas/culture-hacking-how-may-we-increase-happiness-at-our-workplaces), \r\n\r\n[Business Culture Hackers - Sharing stories about hacking biz culture](http://bizculturehackers.com)\r\n\r\n\r\n\r\n","ideaForNow":"Culture hacks to try out at work; co-creation method based on design thinking to craft experiments to drive change ","room":null,"year":"2014","start":null,"end":null,"qrCode":null,"link":null,"speakers":[{"idMember":1014,"firstname":"Stefan","lastname":"HAAS","hash":"c8b372c110a5a2d40c72a78e6f228fc3","links":[]},{"idMember":1075,"firstname":"Jens otto","lastname":"LANGE","hash":"c0f1039fa142ecf01a5b2860e203f8e8","links":[]}],"interests":["culture hacking","organisational culture","happiness","pranks","change","design thinking","fun"],"links":[{"rel":"self","href":"http://localhost:8081/api/session/559"},{"rel":"speaker","href":"http://localhost:8081/api/member/1014"},{"rel":"speaker","href":"http://localhost:8081/api/member/1075"}]}]
