[
  {
    "idSession": 2692,
    "votes": 8,
    "positiveVotes": 7,
    "nbConsults": 455,
    "lang": "fr",
    "format": "Workshop",
    "title": "Event Storming : comprendre le métier autrement",
    "summary": "Il n’est jamais simple de modéliser efficacement un système. Nous proposons pour y parvenir de supprimer tout vocabulaire technique et de se mettre d'accord sur un langage commun à l'équipe et spécifique au projet.",
    "description": "Laissez mijoter l'intelligence collective des acteurs d'un projet devant un immense tableau blanc, pour échanger et décrire les évènements pouvant être produit dans le système. Le résultat est un modèle, absorbant des commandes et générant des évènements pour communiquer ses décisions. Vous verrez ainsi avec quelle rapidité, la compréhension globale du métier augmente. \n\nEt si vous voulez mettre les main dans le code, essayez notre workshop CQRS et Event Sourcing (https://github.com/DevLyon/mixter), vous verrez comment implémenter un design orienté évènement le plus simplement possible !",
    "ideaForNow": "Comment reprendre le contrôle de son application en modélisant facilement et efficacement le métier.",
    "room": "Dijkstra",
    "year": "2016",
    "start": "2016-04-21T13:50:00",
    "end": "2016-04-21T15:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 5262,
        "firstname": "Florent",
        "lastname": "PELLET",
        "hash": "33dccded6958d1dd29336c63c1fd0624",
        "links": []
      },
      {
        "idMember": 701,
        "firstname": "Clément",
        "lastname": "BOUILLIER",
        "hash": "e187f8ea0d791446c5055882f0c597ee",
        "links": []
      },
      {
        "idMember": 704,
        "firstname": "Emilien",
        "lastname": "PECOUL",
        "hash": "569a344428936ce3b601ee3c12d8a100",
        "links": []
      },
      {
        "idMember": 389,
        "firstname": "Jean",
        "lastname": "HELOU",
        "hash": "75da740d43c5780539214f24ce1148a6",
        "links": []
      }
    ],
    "interests": [
      "Ubiquitous language",
      "Event Driven Architecture"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2692"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5262"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/701"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/704"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/389"
      }
    ]
  },
  {
    "idSession": 2702,
    "votes": 4,
    "positiveVotes": 4,
    "nbConsults": 374,
    "lang": "fr",
    "format": "Talk",
    "title": "La délicate agilité du mammouth",
    "summary": "Retour d'expérience sur la mise en place de l'agilité. Avec des morceaux d'UX dedans.",
    "description": "Ca y est, nous sommes agiles. A-G-I-L-E-S!\nLes développeurs au pouvoir! \nLes post-its envahissent les murs, tout le monde sprinte, les stand-up meetings sont exécutés religieusement.\nLes équipes sont motivées, tout du moins au début, mais au fur et à mesure les doutes s'installent.\nMes tentatives pour prodiguer des conseils sont reçues avec des levées d'yeux au ciel.\nLes projets prennent du retard, les commerciaux s'affolent, les clients regardent cette agitation avec un oeil d'abord amusé, puis hagard.\nQue se passe-t-il?\nPetit tour d'horizon sur la mise en place de l'agilité, mêlant réalité et fiction, sans que l'on sache laquelle dépasse l'autre. Avec une pincée de philosophie matinée de mauvaise foi manifeste et d'auto-dérision (à partager sans modération).",
    "ideaForNow": "Pas sûr d'avoir compris. J'amènerai une banane sur scène. Ensuite on la met aux enchères, le gagnant reçoit la banane dédicacée par mes soins, et on reverse la somme collectée à une association. Un Bananalotto, quoi.",
    "room": "Eich",
    "year": "2016",
    "start": "2016-04-22T12:00:00",
    "end": "2016-04-22T12:50:00",
    "qrCode": null,
    "link": "http://torlus.github.io/mixit16/",
    "speakers": [
      {
        "idMember": 5442,
        "firstname": "Gregory",
        "lastname": "ESTRADE",
        "hash": "139cef776cb4aaa6d385b7dbeb014fcc",
        "links": []
      }
    ],
    "interests": [
      "fail",
      "Agile User Experience",
      "Agilité",
      "Retour d'expérience"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2702"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5442"
      }
    ]
  },
  {
    "idSession": 2712,
    "votes": 17,
    "positiveVotes": 17,
    "nbConsults": 477,
    "lang": "fr",
    "format": "Talk",
    "title": "Comment un navigateur affiche une page Web.",
    "summary": "On soulève le capot d'un moteur de rendu Web (WebKit) pour comprendre le processus de rendu d'une page Web avec des exemples \"profilés\" avec les Chrome DevTools.",
    "description": "Que se passe-t-il exactement lorsque vous tapez une URL, jusqu'à ce que vous voyez le contenu d'une page Web? Il y a un processus bien défini d'actions que le navigateur fait en interne, comme la construction du DOM, \"render trees\" et l'opération de \"paint\". Le rendu d'une page Web n'est pas qu'une seule action faite par le navigateur, mais un ensemble de petites opérations et réactions à des interactions. Jetez un oeil sous le capot et vous serez surpris par la quantité de choses faites pendant quelques millisecondes. \n\nEn tant que designer ou développeur Web, comprendre comment fonctionne un navigateur nous aide à prendre de meilleures décisions et à comprendre certaines bonnes pratiques de développement front pour un Web plus efficace.",
    "ideaForNow": "Kill the reflows and repaints.",
    "room": "Petit Amphi",
    "year": "2016",
    "start": "2016-04-22T14:20:00",
    "end": "2016-04-22T15:10:00",
    "qrCode": null,
    "link": "https://speakerdeck.com/mehlah/how-the-browser-renders-a-web-page-long-version",
    "speakers": [
      {
        "idMember": 5152,
        "firstname": "Mehdi",
        "lastname": "LAHMAM",
        "hash": "c9709e47baec733197975e8fe5abea82",
        "links": []
      }
    ],
    "interests": [
      "Web Perf",
      "frontend"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2712"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5152"
      }
    ]
  },
  {
    "idSession": 2722,
    "votes": 9,
    "positiveVotes": 8,
    "nbConsults": 320,
    "lang": "en",
    "format": "Talk",
    "title": "Xanpan",
    "summary": "Q: What do you get if you cross Kanban and Extreme Programming? \nA: Xanpan!",
    "description": "The world doesn’t need another software development methodology - there are plenty already!  But each team needs to learn and create their own. Xanpan is Allan Kelly's very own hybrid development approach, a mix of Kanban and Extreme Programming, bit more Lean thrown in, seasoned with economics and refined over many teams. Xanpan demonstrates how elements of XP and Kanban can be combined and used as an effective development approach.\n\nThe resulting focuses on teams not projects, allows for planned and unplanned work within iterations and levels flow.  One team using this approach claims to be able to deliver \"to the day.\"\n\nXanpan started life simply as adding flow thinking to XP and experimenting.  Now it has principles and practices, some of its own but most of which are rooted in Kanban and XP.  This presentation will describe the principles and describe the key practices.  It will look at how and why these practices support the principles. \n\n\"Xanpan - team centric Agile Software Development\" is available fro LeanPub.com and Amazon.",
    "ideaForNow": "Make your own methodology!",
    "room": "Petit Amphi",
    "year": "2016",
    "start": "2016-04-22T07:50:00",
    "end": "2016-04-22T08:40:00",
    "qrCode": null,
    "link": "http://www.allankelly.net/static/presentations/XanpanMixIT2016.pdf",
    "speakers": [
      {
        "idMember": 5462,
        "firstname": "Allan",
        "lastname": "KELLY",
        "hash": "bad01fc49be5270e189eed1a25f37f62",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2722"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5462"
      }
    ]
  },
  {
    "idSession": 2742,
    "votes": 3,
    "positiveVotes": 3,
    "nbConsults": 216,
    "lang": "en",
    "format": "Workshop",
    "title": "The scaling ball game",
    "summary": "During the game you will experience scaling issues that occur when multiple teams work on the same product. Multiple Teams will look for solutions to scaling issues and experiment in an iterative way with their ideas on solving them..",
    "description": "#Abstract\n\n##Description\n\n During the game you will experience scaling issues that occur when multiple teams work on the same product. Multiple Teams will look for solutions to scaling issues and experiment in an iterative way with their ideas on solving them..\n\n\n##Expected benefits of participating\n\nAttendees will face a series of typical scaling challenges like: \n\n+ team synchronisation\n+ efficiency\n+ standardisation\n+ optimisation of expertise\n+ distributed teams\n\n##What did the session creators hope to learn?\n\nThese days we have a few models for scaling teams. \nWith this game we want to help participants experience common scaling issues and observe how they affect them. \nWith the exercises in this book and others, we hope to learn more about scaling dynamics.\n\n##Process and timetable: \n\n+ total time 90 min\n+ Introduction to scaling issues:  5 minutes\n+ Round 1: warm up in local teams 5 minutes\n+ Round 2: multiple rounds solving different scaling issues with a partner team (total 20 minutes)  \n+ Round 3: multiple rounds solving different scaling issues with groups of 4 small teams collaborating (total 10 minutes)  \n+ Round 4: all teams have to collaborate in one large factory 10 minutes\n+ Small retrospective inside the teams 10 minutes\n+ Large joined retrospective (at the end) 30 minutes",
    "ideaForNow": "agile at team level is solved. The current biggest issue is how do we scale this?",
    "room": "Nonaka",
    "year": "2016",
    "start": "2016-04-22T07:50:00",
    "end": "2016-04-22T09:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 5472,
        "firstname": "Yves",
        "lastname": "HANOULLE",
        "hash": "54759dada3c761878875100d13dac670",
        "links": []
      },
      {
        "idMember": 4,
        "firstname": "Franck",
        "lastname": "DEPIERRE",
        "hash": "4d294402a9548a1ffdfc49fa4d777b10",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2742"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5472"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/4"
      }
    ]
  },
  {
    "idSession": 2752,
    "votes": 19,
    "positiveVotes": 6,
    "nbConsults": 619,
    "lang": "fr",
    "format": "Talk",
    "title": "Tester et valider ses déploiements",
    "summary": "De nombreuses équipes décrivent leurs installations dans une application gérant le déploiement (comme Salt, Puppet, Chef, Ansible). Seulement, cette description du déploiement n'est pas toujours fiable.\nAu cours de cette présentation, nous allons voir comment valider le description d'un déploiement.",
    "description": "Les développeurs ont commencé depuis quelque temps à écrire des tests pour valider leur code et éviter les bugs et régressions. Cette pratique est ancrée dans les équipes de développements depuis plusieurs années maintenant, à tel point que certains commencent par écrire leurs tests avant le code (Test Driven Development).\n\nDepuis que le mouvement DevOps est apparu, cette pratique de validation du travail n’a pas forcément été appliquée, à tel point qu’il arrive que la gestion de configuration ne fonctionne pas du tout sur une machine fraîchement installée.\n\nAu cours de cette présentation, je vais donc présenter pourquoi est ce qu'une description de déploiement peut ne pas fonctionner, présenter des solutions rapides de validation. Ensuite, je parlerai du concept de Test Driven Infrastructure et comment insérer cette méthode dans la validation de la gestion de configuration.",
    "ideaForNow": "La présentation va montrer comment utiliser des outils connu des devops, comme le serveur d'intégration continue, la virtualisation/conteneurisation/PAAS, et le monitoring pour valider ses fichiers de description de déploiement.\n\nLa méthode est assez simple et peut être déployé en quelques heures.\n\nMon expérience est centrée sur Saltstack et Shinken, mais les exemples sont relativement neutre et la méthode est applicable avec d'autres applications (Puppet, Chef, Ansible, Sensu, Nagios, etc...).",
    "room": "Gosling",
    "year": "2016",
    "start": "2016-04-21T08:20:00",
    "end": "2016-04-21T09:10:00",
    "qrCode": null,
    "link": "https://static.hashbang.fr/20160421_tester_valider_ses_deploiements/#1",
    "speakers": [
      {
        "idMember": 5112,
        "firstname": "Arthur",
        "lastname": "VUILLARD",
        "hash": "c8c826f53f65be736a49b6dedb7e6197",
        "links": []
      }
    ],
    "interests": [
      "Monitoring",
      "DevOps",
      "tdi",
      "deployment",
      "Tests"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2752"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5112"
      }
    ]
  },
  {
    "idSession": 2762,
    "votes": 27,
    "positiveVotes": 18,
    "nbConsults": 388,
    "lang": "fr",
    "format": "Talk",
    "title": "De CDO au CODE : l’éducation numérique, la seule véritable transformation digitale ?",
    "summary": "A travers mon parcours personnel, de femme Chief Digital Officer issue du marketing, à l’initiation au codage pour accompagner l’éducation numérique de mes 3 enfants, j’aimerais partager avec vous une autre vision de la transformation digitale, et donc de la société numérique de demain.",
    "description": "Combien de Chief Digital Officers savent coder ? Comment enseigner le code aux jeunes ? Et quel rapport entre les deux ?\n\nA travers mon parcours personnel, de femme Chief Digital Officer issue du marketing, à l’initiation au codage pour accompagner l’éducation numérique de mes 3 enfants, j’aimerais partager avec vous une autre vision de la transformation digitale, et donc de la société numérique de demain.\n\nLa vraie transformation digitale est-elle la pénible formation à coup de millions d’euros d’autant d’employés et de cadres réticents à changer leurs habitudes et prérogatives, ou l’éducation d’acteurs responsables dans une société numérique?\nCette éducation peut-elle se faire sans une formation au codage ? Et de quelle philosophie de formation parle-t-on ?  Peut-elle se faire sans la participation active des développeurs de métier ?\n \nCes questions m’ont amenée à un changement complet de trajectoire professionnelle, pour m'investir dans l'enseignement du code aux ados. Mon parcours, et les observations et questionnements qu’il a suscités, ouvrent de nombreuses perspectives pour une approche différente de l'enseignement du code aux jeunes et non-codeurs.",
    "ideaForNow": "Enseigner le code à tous (jeunes, non-codeurs) ne peut pas se faire de la même manière qu'on forme un professionnel. Développer des approches \"user-centric\" plutôt que \"product-centric\". Par exemple sous l'angle du projet à réaliser.",
    "room": null,
    "year": "2016",
    "start": "2016-04-22T15:20:00",
    "end": "2016-04-22T15:45:00",
    "qrCode": null,
    "link": "http://www.butter-cake.com/2016/04/25/leducation-numerique-seule-veritable-transformation-digitale/",
    "speakers": [
      {
        "idMember": 5662,
        "firstname": "Youmna",
        "lastname": "OVAZZA",
        "hash": "fd0cb9e41d9161f17c9d9a32253e32ed",
        "links": []
      }
    ],
    "interests": [
      "enseignement",
      "pédagogie",
      "adolescents",
      "Projet",
      "non-codeurs",
      "Agilité",
      "Enfants",
      "Code",
      "éducation",
      "Startup"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2762"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5662"
      }
    ]
  },
  {
    "idSession": 2772,
    "votes": 12,
    "positiveVotes": 12,
    "nbConsults": 372,
    "lang": "fr",
    "format": "Talk",
    "title": "Recrutement, et si vous laissiez l'équipe faire ?",
    "summary": "Le recrutement calibré RH/CV/Ecoles vous saoule? vous pensez qu'écrire un quicksort au tableau avec une main dans le dos ne donne pas une bonne idée de vos compétences? vous voulez des outils pour recruter mieux maintenant? j'ai peut-être quelque chose pour vous.",
    "description": "La constitution d'une équipe agile est un élément fondamental, engageant et certainement pas Agile pour un sou (CDD, CDI, ...). Hélas, cela conduit bien souvent les décisionnaires, qui décident de la possibilité financière d'une embauche, a gérer une grande partie du processus de recrutement. Il arrive même parfois qu'une nouvelle embauchée débarque un lundi matin sans que personne -ou presque- ne soit au courant.\n\nCette présentation est le retour d'expérience d'Enalean, éditeur de logiciels, et de la stratégie mise en place pour mettre les équipes au centre de la prise de décision et du processus de recrutement. Les valeurs centrales de l'agilité: auto-organisation et responsabilisation de l'équipe sont au centre de cette démarche. Nous aborderons: \n- la définition du besoin: quel est notre objectif, de qui avons nous le plus besoin pour mener à bien notre mission ? \n- la rédaction de l'offre: comment faire comprendre qui nous sommes ? \n- les entretiens: comment découper le temps imparti, quels exercices, avec qui et dans quels buts. \n- pourquoi nous en sommes arrivé là \n\nCette session se veut très concrète dans l'évocation des situations. Je partagerais également avec vous les différents outils mis en place par l'équipe.",
    "ideaForNow": "Pour travailler mieux il faut commencer par recruter bien. C'est à dire que la(e) candidat(e) recrute la bonne entreprise!",
    "room": "Gosling",
    "year": "2016",
    "start": "2016-04-22T07:50:00",
    "end": "2016-04-22T08:40:00",
    "qrCode": null,
    "link": "http://www.slideshare.net/manuelvacelet/recrutement-et-si-vous-laissiez-lquipe-faire",
    "speakers": [
      {
        "idMember": 5632,
        "firstname": "Manuel",
        "lastname": "VACELET",
        "hash": "e7b95a72606d8a2921d044784111375e",
        "links": []
      }
    ],
    "interests": [
      "pratique professionnelle",
      "retours d'expérience",
      "fun"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2772"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5632"
      }
    ]
  },
  {
    "idSession": 2782,
    "votes": 4,
    "positiveVotes": 2,
    "nbConsults": 148,
    "lang": "fr",
    "format": "Talk",
    "title": "Keep calm and send a pull request",
    "summary": "Venez découvrir une stratégie de développement efficace, un environnement productif axé entièrement autour de la Pull Request. Retour d'expérience, sur plus d'un an de développement sans une ligne de code non relue, de prise de décisions consensuelles et d'amélioration progressive.",
    "description": "Innover et conserver un produit de qualité de manière itérative. Développer avec des prestataires a distance ou des collaborateurs en télétravail. Tout en gardant le contrôle sur la qualité, la cohérence et la complexité du code produit. Nombreux sont les obstacles auxquels nous faisons face au quotidien au sein de nos entreprises et Bonitasoft ne fait pas exception.\n\nVenez découvrir,  au travers d'une démonstration, une stratégie de développement efficace et un environnement productif axé entièrement autour de la Pull Request (jenkins/github/slack/docker). Retour d'expérience, sur plus d'un an de développement sans une ligne de code non relue, de collaboration multidisciplinaire et multisite, de prise de décisions consensuelles et d'amélioration progressive.\n\nLa Pull Request a littéralement transformé notre cycle de développement.",
    "ideaForNow": "Repartez avec l'envie de travailler en mode pull request",
    "room": null,
    "year": "2016",
    "start": null,
    "end": null,
    "qrCode": null,
    "link": "http://velcrin.github.io/mixit16/",
    "speakers": [
      {
        "idMember": 765,
        "firstname": "Colin",
        "lastname": "PUY",
        "hash": "f2bacefba1f2de03a4f7f2940a41ad64",
        "links": []
      },
      {
        "idMember": 5672,
        "firstname": "Vincent",
        "lastname": "ELCRIN",
        "hash": "1b13dc25e6ca48e72ae11d7c9634b4ed",
        "links": []
      }
    ],
    "interests": [
      "Git",
      "Jenkins",
      "GitHub",
      "Collaboration",
      "Craftsmanship",
      "Docker",
      "Slack",
      "Agile"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2782"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/765"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5672"
      }
    ]
  },
  {
    "idSession": 2792,
    "votes": 0,
    "positiveVotes": 0,
    "nbConsults": 75,
    "lang": "en",
    "format": "Talk",
    "title": "A game programming environment for beginners",
    "summary": "Code Lauren is a web app that lets beginners program games.  I'll demo the app and talk about how I designed the programming language, compiler and UI to help the user learn to program.",
    "description": "I'll talk about how the design of the environment.  How it helps the user learn syntax, control flow and the API of the language.  How it helps them understand what their program is doing or why it's broken.\n\nI'll talk about the compiler.  I'll talk about how it is able to run the user's program step by step, forwards and backwards.  I'll talk about how it can give very precise syntax and runtime error messages.",
    "ideaForNow": "Programming for beginners.",
    "room": null,
    "year": "2016",
    "start": null,
    "end": null,
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 5782,
        "firstname": "Mary rose",
        "lastname": "COOK",
        "hash": "bfb7553ad3a564727391fa9be2352546",
        "links": []
      }
    ],
    "interests": [
      "Web",
      "programming education",
      "games",
      "user interface",
      "compilers",
      "programming language"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2792"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5782"
      }
    ]
  },
  {
    "idSession": 2802,
    "votes": 5,
    "positiveVotes": 3,
    "nbConsults": 372,
    "lang": "fr",
    "format": "Workshop",
    "title": "Outils simples de visualisation pour le data scientist",
    "summary": "Je présenterai les outils de visualisations pour la caractérisation et de modélisation d'un jeu de données (Python, Tableau), d'aide au nettoyage (Trifacta, Data wrangler) et la communication de résultats sur le web avec storytelling (D3JS, HighChart, NVD3).",
    "description": "Toute données doit être visualisée, et à toute étape de leurs traitements. C'est un outil essentiel du data scientist.\n\nLa visualisation intervient depuis le nettoyage des données pour détecter des données manquantes, anomalies, et identifier leurs caractéristiques (type, domaine). Ensuite, pour la modélisation qui nécessite au préalable de bien comprendre la distribution,  pour informer le choix du modèle, ses différents paramètres et échantillons de données. Enfin par la communication visuelle pour communiquer des résultats à un public à la foi expert mais aussi à une audience qui ne l'est pas forcément mais intéressée par le sujet (exemple: data journaliste)\n\nCet atelier sera très pratique avec l'utilisation d'un unique jeu de données qui passera par toutes ces étapes de traitements et de visualisation. Nous utiliserons des bibliothèques disponibles en ligne (Python, D3JS/HighChart/NVD3) pour former un pipeline de traitement, de l'extraction jusqu'à la présentation. Nous utiliserons aussi quelques outils parfois payant ou en version limitée pour montrer leur potentiel et leur rôle de ce pipeline de traitement de données (à titre informatif pour montrer leur rôle et potentiel). De nombreux exemples (historiques, emblématiques) de visualisations seront introduit (New York Times, d3 blocks, ..).\n\nEnfin la conclusion de l'atelier sera  d'initier les participants aux methodes de design via une session de 'design critique' où les participants seront invités à prototyper sur papier une visualisation liée aux données qui ont été présentées. Ensuite ces prototypes seront discutés afin d'en étudier les points positifs et négatifs. Et dans quelle mesure ces visualisations peut être faite ou customisées maintenant, ou celles qui sont propres à un sujet et nécessiterons un development pointu (e.g. New York Times).",
    "ideaForNow": "Les participants sauront charger leurs données dans les bibliothèques standard de visualisation et modifier le code pour l'adapter aux besoins des données ou du public auquel ils s'adressent.",
    "room": "Turing",
    "year": "2016",
    "start": "2016-04-21T11:50:00",
    "end": "2016-04-21T13:40:00",
    "qrCode": null,
    "link": "https://github.com/romsson/mixit16-simple-dataviz-datascience/blob/master/simple-dataviz-datascience.ipynb",
    "speakers": [
      {
        "idMember": 5272,
        "firstname": "Romain",
        "lastname": "VUILLEMOT",
        "hash": "3a1acea6c19ab622667ad074d523f789",
        "links": []
      }
    ],
    "interests": [
      "Data Science",
      "design",
      "data visualization",
      "visualisation d'information"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2802"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5272"
      }
    ]
  },
  {
    "idSession": 2812,
    "votes": 15,
    "positiveVotes": 14,
    "nbConsults": 410,
    "lang": "fr",
    "format": "Talk",
    "title": "Le Lean Startup depuis les tranchées",
    "summary": "Après avoir travaillé avec plusieurs dizaines de startups, voici une illustration par des exemples concrets des concepts du Lean Startup (MVP, Lean, Get Out Of The Building, Pivot, Customer Development, Lean Canvas).",
    "description": "Le Lean Startup vient avec son vocabulaire pas toujours accessible pour le commun des mortels. Et ce n'est pas si simple de mettre en place une démarche Lean Startup quand on démarre un projet entrepreneurial. On a souvent tendance à rendre les choses complexes là où elles pourraient être simples. Car oui, il est *toujours* possible de simplifier un projet.\n\nAprès avoir suivi plusieurs dizaines d'entrepreneurs, je vous propose dans cette session d'expliquer un certain nombres de concepts du Lean Startup à travers des exemples concrets, de la \"vraie vie\", afin de mieux vous montrer ce qu'est vraiment le Lean Startup.\nJ'illustrerez donc par des exemples des concepts comme le MVP, le Pivot, le Customer Development...",
    "ideaForNow": "Vous verrez qu'il n'est pas nécessaire d'avoir de l'argent ou beaucoup de temps pour valider une idée, et même pour la mettre en oeuvre. \nSi ça fait des mois qu'une idée vous trotte dans la tête, je vous donnerai quelques clés pour vous lancer.",
    "room": "Petit Amphi",
    "year": "2016",
    "start": "2016-04-21T08:20:00",
    "end": "2016-04-21T09:10:00",
    "qrCode": null,
    "link": "http://www.slideshare.net/ndeverge/le-lean-startup-depuis-les-tranches",
    "speakers": [
      {
        "idMember": 933,
        "firstname": "Nicolas",
        "lastname": "DEVERGE",
        "hash": "da81db67118a58d77d85d854d40161ff",
        "links": []
      }
    ],
    "interests": [
      "Entrepreneuriat",
      "Lean Startup",
      "Startup"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2812"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/933"
      }
    ]
  },
  {
    "idSession": 2822,
    "votes": 18,
    "positiveVotes": 18,
    "nbConsults": 818,
    "lang": "fr",
    "format": "Workshop",
    "title": "Workshop : Introduction à ELK",
    "summary": "Pendant ce workshop, nous découvrirons par la pratique comme utiliser 3 produits Elastic, ElasticSearch, LogStash et Kibana (ELK) dans une démarche DevOps, pour centraliser des logs ou d’autres informations, et les exploiter graphiquement.",
    "description": "== Pré-requis\nLe texte du tutoriel est accessible librement sur Internet : http://leneurone.github.io/atelier-duchess-elk/. \nIl est indispensable que les participants aient installé avant l'atelier sur leur ordinateur personnel soit Virtual Box et la machine virtuelle tel que décrit dans la section “Démarrage de la machine virtuelle“, soit les produits séparément comme décrit sur la page \"Installation sans VM\".\n\n== Atelier\nJe commencerai par quelques slides d’introduction pour présenter rapidement les différents produits mis en oeuvre, ainsi que quelques concepts spécifiques à ElasticSearch nécessaires pour la suite.\n\nL’atelier a été conçu pour être déroulé de manière assez autonome. Cela permettra à chacun de dérouler à son rythme, de poser les questions qu’il souhaite sans attendre ou au contraire d’avance plus rapidement.\n\nNous apprendrons à lire un fichier et à l’enrichir avec LogStash, puis à configurer ElasticSearch pour indexer correctement les données. Enfin, nous verrons comment utiliser l’interface Web Kibana pour les visualiser.\n\n== Pour aller plus loin\nLes plus rapides, ou ceux qui souhaiterons continuer le tutoriel une fois revenus chez eux, pourrons ajouter un broker de messages pour obtenir une architecture faiblement couplée, ou apprendre à configurer ElasticSearch pour fonctionner en cluster.\n\n== A propos de moi\nJe suis développeur Java depuis 4 ans, et je travaille depuis 3 ans avec la stack Elastic au sein d’un client grand compte lyonnais. J’ai déployé jusqu’à 24 serveurs en production simultanément sur cette infrastructure, pouvant accueillir jusqu’à plus 1 milliard de documents et plus de 10.000 logs / s via une architecture distribuée, redondante et résistante aux pannes. J’ai été amenée à former plusieurs personnes pour travailler avec moi, ce qui m’a menée à la rédaction d’un tutoriel de prise en main de la stack.",
    "ideaForNow": "* Apprendre à monitorer son application avec des produits gratuits open source\n* Obtenir rapidement des métriques de santé\n* Obtenir de beaux graphiques de métriques pour étayer son reporting",
    "room": "Turing",
    "year": "2016",
    "start": "2016-04-21T08:20:00",
    "end": "2016-04-21T10:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 1150,
        "firstname": "Claire",
        "lastname": "VILLARD",
        "hash": "a96930423a79b68f2820af9d35876b62",
        "links": []
      },
      {
        "idMember": 113,
        "firstname": "Angélique",
        "lastname": "HENRY",
        "hash": "c9306cebd4c6e1b62ccdff8e45b3bd7b",
        "links": []
      }
    ],
    "interests": [
      "logstash",
      "Monitoring",
      "ElasticSearch",
      "Elastic",
      "DevOps",
      "kibana",
      "reporting"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2822"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/1150"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/113"
      }
    ]
  },
  {
    "idSession": 2832,
    "votes": 25,
    "positiveVotes": 24,
    "nbConsults": 464,
    "lang": "fr",
    "format": "Talk",
    "title": "100% Stateless avec JWT (JSON Web Token)",
    "summary": "Dans nos architectures REST modernes, les bons vieux cookies de session ne suffisent plus. Il est temps de s’intéresser aux JSON Web Token : une nouvelle approche plus simple, 100% stateless et facilement scalable.\n\nPlus de stockage et plus de réplication de session côté serveur !",
    "description": "J’ai mis en place des JWT cette année sur un projet client et j’aimerai partager ce que j’ai pu implémenter avec l’équipe.\n\nPour ce talk, j’aimerai que le public reparte avec :\n* Une bonne idée du fonctionnement interne des JWT\n* Comment bien sécuriser les JWT pour un usage browser/serveur (CSRF, XSS)\n* D’autres idées d’utilisation (panier, email de confirmation…)\n* Une connaissance des avantages et inconvénients",
    "ideaForNow": "Idée #1 : Simplifier la scalabilité des mon appli en remplaçant mes sessions et mes identifiants par des JWT.\nIdée #2 : Correctement configuer les JWT sur des sites classiques et des single page applications.\nIdée #3 : Signer mes cookies (panier et autres) avec ce standard.",
    "room": "Grand Amphi",
    "year": "2016",
    "start": "2016-04-22T08:50:00",
    "end": "2016-04-22T09:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 2171,
        "firstname": "Hubert",
        "lastname": "SABLONNIÈRE",
        "hash": "f7b7503324cbfd2a59aeb3540fa17bb1",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2832"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/2171"
      }
    ]
  },
  {
    "idSession": 2842,
    "votes": 10,
    "positiveVotes": 10,
    "nbConsults": 237,
    "lang": "fr",
    "format": "Workshop",
    "title": "A la (re)découverte du Manifeste Agile",
    "summary": "Pour bien comprendre l'Agilité et aider les autres à la vivre, les 4 valeurs et 12 principes du Manifeste Agile donnent un cadre de bon sens qu'il est bon de rappeler que nous soyons débutants ou praticiens plus aguerris. Laissons de côté Scrum, XP ou toutes les méthods pour revenir à la philosophie",
    "description": "L'adoption massive l'Agilité dans les entreprises et les organisations est souvent associée au choix d'une méthode spécifique (Scrum, eXtreme Programming, ou autre). Au-delà d'un cadre qui vous dira qui doit faire quoi, quand et comment, il est aujourd'hui encore nécessaire de revenir à la définition posée en 2001 dans le *Manifeste Agile* pour donner du sens à votre équipe. Alistair Cockburn nous rappelait d'ailleurs dans une conférence en 2014 que l'avenir de l'Agilité était ... l'Agilité elle-même !\n\nPour bien comprendre l'Agilité et aider les autres à la vivre, les 4 valeurs et 12 principes du Manifeste Agile donnent un cadre de bon sens qu'il est bon de rappeler que nous soyons débutants ou praticiens plus aguerris. \n\nJe vous propose un retour aux sources pour donner de nouvelles perspectives sur votre approche quotidienne de l'Agilité. Dans cet atelier : \n\n* Vous (re)découvrez les 4 valeurs et les 12 principes de l'Agilité\n* Vous co-contruisez une représentation concrète du Manifeste Agile pour donner forme à des concepts qui peuvent paraître abstraits\n* Vous échangez avec les autres participants sur la compréhension du Manifeste Agile et partager vos expériences\n* Vous créez votre propre discours pour expliquer ce qu'est l'Agilité dans votre entreprise après la conférence\n* Pour appuyer votre discours, vous repartez avec une (ou plusieurs) photos de la structure en Légos pour partager vos apprentissages\n* Vous découvrez la méthode Légo Serious Play, une approche pédagogique à base de métaphores et de *story telling* pour visualiser des sujets complexes",
    "ideaForNow": "- Un retour aux sources pour se rafraîchir l'Agilité quotidienne\n- Exploration en profondeur des 4 valeurs et 12 principes agiles",
    "room": "Nonaka",
    "year": "2016",
    "start": "2016-04-21T11:50:00",
    "end": "2016-04-21T13:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 5,
        "firstname": "Romain",
        "lastname": "COUTURIER",
        "hash": "918e67363e4361447d7a01c11da8a767",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2842"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5"
      }
    ]
  },
  {
    "idSession": 2852,
    "votes": 1,
    "positiveVotes": 1,
    "nbConsults": 587,
    "lang": "fr",
    "format": "Talk",
    "title": "Vis ma vie de développeuse",
    "summary": "Vous voulez plus de __développeuses__? Vous pensez ne rien pouvoir y faire et préférez attendre qu’elles tombent du ciel?\n\nEtant les premières concernées car développeuse nous même, nous allons vous donner des solutions pour attirer plus de femmes dans vos équipes, et surtout les garder!",
    "description": "= Le contenu\nEn alternant des __slides__, des __sketches__ et __du vécu__, nous détaillerons les situations que nous avons vues, vécues ou entendus et qui nous interpellent. Nous mettrons le doigt sur des usage qui perdurent parce que, comme pour un projet de dév sans tests \"c'est historique\", mais qui ne sont plus en phase avec la société moderne. Des situation dans les équipe de développement, avec le client, avec les manageurs ou les RH. Nous proposerons __des contournements__ et __des solutions concrètes__ à utiliser au quotidien et aider à ce que le lieux de travail soit un environnement agréable pour toutes et tous.\n\nL'idée de cette conférence est venue le jour où nous nous sommes rendu compte que nous avons toutes vécues certaines situations désagréables qui nous ont donné envie de partir. Nous souhaitons en parler pour éviter que les futures générations de développeuses y soient confrontées. De plus, nous nous retrouvons régulièrement a être les rares femmes dans les événements techniques, et on nous pose régulièrement la question \"Mais pourquoi y-a-t-il si peu de femmes ?\" nous avons donc creusé le sujet et vous livrons cette analyse.",
    "ideaForNow": "Tout le monde peut agir pour la mixité",
    "room": null,
    "year": "2016",
    "start": null,
    "end": null,
    "qrCode": null,
    "link": "http://fr.slideshare.net/duchess-lyon/vis-ma-vie-de-dveloppeuse",
    "speakers": [
      {
        "idMember": 1150,
        "firstname": "Claire",
        "lastname": "VILLARD",
        "hash": "a96930423a79b68f2820af9d35876b62",
        "links": []
      },
      {
        "idMember": 5382,
        "firstname": "Marion",
        "lastname": "FELIX",
        "hash": "919767247c8233a7407836d12bb4a9dc",
        "links": []
      },
      {
        "idMember": 113,
        "firstname": "Angélique",
        "lastname": "HENRY",
        "hash": "c9306cebd4c6e1b62ccdff8e45b3bd7b",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2852"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/1150"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5382"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/113"
      }
    ]
  },
  {
    "idSession": 2872,
    "votes": 19,
    "positiveVotes": 17,
    "nbConsults": 389,
    "lang": "fr",
    "format": "Talk",
    "title": "HTTP/2 pour le développeur Web",
    "summary": "Comprendre le protocole HTTP/2, comment les applications web peuvent l'utiliser et comment le mettre en production aujourd'hui sur la JVM.",
    "description": "On parle de HTTP/2 depuis bien longtemps maintenant - et il est temps de sérieusement envisager l’adoption. Mais nous, les développeurs, cherchons encore à comprendre les implications de HTTP/2 dans nos applications et nos infrastructures.\n\nCette session posera rapidement les bases du protocole lui-même et abordera ensuite les questions importantes: comment bien choisir son serveur HTTP/2, comment bien préparer sa migration vers HTTP/2, quels sont les conséquences pour le développement front-end, Server Push ou Stream Prioritization?\n\nNous utiliserons une application Spring Boot + Jetty en exemple.",
    "ideaForNow": "Il existe de nombreuses présentations qui expliquent bien comment HTTP/2 corrige des défauts de la version 1.1 - cette session va plutôt chercher à expliquer les mécanismes du protocole et à discuter sa mise en oeuvre de façon très pragmatique: comment bien l'intégrer dans son application et dans son infrastructure, bien choisir son serveur HTTP, etc.",
    "room": "Grand Amphi",
    "year": "2016",
    "start": "2016-04-22T12:00:00",
    "end": "2016-04-22T12:50:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 62,
        "firstname": "Brian",
        "lastname": "CLOZEL",
        "hash": "7f6b3d65ae30e6fec52287f34e22dcb0",
        "links": []
      }
    ],
    "interests": [
      "JVM",
      "Web",
      "Spring Boot",
      "http/2"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2872"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/62"
      }
    ]
  },
  {
    "idSession": 2892,
    "votes": 2,
    "positiveVotes": 2,
    "nbConsults": 189,
    "lang": "fr",
    "format": "Workshop",
    "title": "Improv(ing) Agile Teams : interactions humaines et adoption du changement",
    "summary": "Sur scène, les acteurs improvisateurs utilisent des règles simples, des principes de collaboration, et des contraintes de jeu pour construire des histoires non prévues et néanmoins fascinantes. Les mêmes règles et principes aident les équipes agiles à collaborer plus efficacement.",
    "description": "L’improvisation est pour certains synonyme de perspectives de chaos et d’incertitude. Pourtant, les êtres humains improvisent chaque minute de leur vie. Cela se fait naturellement, et offre d’autres perspectives remplies de plus de possibilités que l’on ne pourrait l’imaginer.\n\nImprovisateur amateur et Coach Agile professionnel depuis plusieurs années, je vous propose de vivre des exercices simples et inédits favorisant 2 des principales valeurs du manifeste agile : les interactions entre individus, et l'adoption du changement. \n\nJ'utiliserai quelques unes des 50 techniques et jeux d’impros du très bon livre Improving Agile Teams de Paul Goddard. En anglais la racine “Improv” est commune aux mots Improvisation et Amélioration (improvement).\n\nBien entendu, des temps d'échauffement et de débrief sont prévus.\nAucune compétence n'est requise, ni en théâtre, ni en improvisation, ni en agilité : c'est normal, vous allez les développer pendant la session !\n\nNous balayerons 5 principes du théâtre d’improvisation :\nSécurité : comment accepter l’échec est essentiel à la découverte\nSpontanéité : comment augmenter le flot d’idées\nStorytelling : comment la narration aide l’équipe à mieux comprendre les clients et utilisateurs\nStatus: comment ajuster son comportement personnel peut encourager la collaboration\nSensibilité: comment devenir plus pleinement engagé avec ses co-équipiers.",
    "ideaForNow": "- Découvrir le théâtre d'improvisation dans un cadre bienveillant\n- Savoir utiliser des contraintes pour débrider la créativité\n- Réutiliser des petits exercices pour améliorer la collaboration dans vos équipes",
    "room": "Nonaka",
    "year": "2016",
    "start": "2016-04-22T13:20:00",
    "end": "2016-04-22T15:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 160,
        "firstname": "Vincent",
        "lastname": "DAVIET",
        "hash": "5320948275e14a08565d1a23e0f84d3f",
        "links": []
      }
    ],
    "interests": [
      "interactions",
      "Agile"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2892"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/160"
      }
    ]
  },
  {
    "idSession": 2902,
    "votes": 70,
    "positiveVotes": 67,
    "nbConsults": 613,
    "lang": "fr",
    "format": "Keynote",
    "title": "Pédagogie et Agilité",
    "summary": "Keynote : Mise en place des valeurs de l'Agilité dans un contexte d'apprentissage scolaire",
    "description": "Etre capable de communiquer avec 27 personnes en même temps afin de les faire progresser dans leur formation demande souplesse, pragmatisme et adaptation permanente.  Les valeurs Agiles permettent cette rigueur.\nMon intervention, un retour d'expérience sur les 6 dernière années, montre différents aspects pratiques pour créer des supports de communication dans le but d'émouvoir et de sensibiliser chaque élève. \nJ'insiste sur les valeurs humaines, les sensations et les émotions, afin de faire progresser chaque enfant par la coopération, la collaboration et le droit à l'erreur.",
    "ideaForNow": "Frugalité",
    "room": null,
    "year": "2016",
    "start": "2016-04-21T07:10:00",
    "end": "2016-04-21T07:35:00",
    "qrCode": null,
    "link": "https://speakerdeck.com/christiandh/pedagogie-agile-a-mixit16",
    "speakers": [
      {
        "idMember": 6242,
        "firstname": "Christian",
        "lastname": "DEN HARTIGH",
        "hash": "6645b03ed3dd93d4705154ddab41ebe5",
        "links": []
      }
    ],
    "interests": [
      "Frugalité sensations émotions efficacité humour"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2902"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6242"
      }
    ]
  },
  {
    "idSession": 2912,
    "votes": 18,
    "positiveVotes": 6,
    "nbConsults": 472,
    "lang": "fr",
    "format": "Talk",
    "title": "Tête à tête souple et musclé",
    "summary": "Pour aborder un sujet difficile avec une personne, il y a 3 options :\n*Ne rien faire, mais rien de change\n*Y aller bourrin, mais elle se braque et rien ne change\n*Avoir un tête à tête souple et musclé\nComment faire ? C'est difficile ... c'est stressant... et j'ai pas envie de pisser dans un violon.",
    "description": "Vous êtes développeur ou analyste fonctionnel, bref vous appartenez à une équipe. \nVous avez une certaine idée de comment les choses doivent se passer : organisation, principes techniques, comportement. \n\nUn collègue est à côté de la plaque, qu'il en ait conscience ou non.\n* Il/elle n'est pas au niveau d'exigence de l'équipe, du projet. « Il ne respecte pas les règles » « Il ne joue pas le jeu »\n* Il/elle est pris(e) dans un conflit qui pourrit l'ambiance de l'équipe. « Ils peuvent pas se blairer »\n* Il a un comportement inadéquat par rapport aux attentes de l'entreprise ou du client.« Il va se faire sortir »\nOu plus simplement il/elle vous demande votre aide.  Mais... « C’est un boulet »\n\nEt si vous essayiez de l’aider ? \n\n\"\"Quand on doit aborder un sujet difficile avec une personne, il y a 3 options :\n1) Ne rien faire, mais rien de change\n2) Y aller bourrin, mais elle se braque et rien ne change\n3) Avoir un tête à tête souple et musclé\nComment faire ? C'est difficile ... c'est stressant... et j'ai pas envie de pisser dans un violon !\"\"\n\nVous allez apprendre à mieux aider lors des tête à tête : moins de stress pour vous et pour l'autre, et surtout plus d'efficacité : des principes et une mise en pratique des tête à tête, ou comment aider ses co-équipiers en leur parlant (et en les écoutant). \nVous allez découvrir comment mettre en oeuvre la supervision par les pairs : recadrage, coaching, mentoring, feedback.\n\nAprès l'exposé de quelques principes issus de cas concret, nous aborderons vos situations.",
    "ideaForNow": "Vous pourrez mieux aider vos collègues par des actions ponctuelles et efficaces\n* recadrage\n* coaching\n* mentoring\n* feedback\nVous serez quand et comment les mener, alliant souplesse et muscle.\nCe faisant, vous améliorerez votre environnement de travail. Et, surtout, vous faciliterez la réussite des projets auxquels vous coopérez.",
    "room": "Eich",
    "year": "2016",
    "start": "2016-04-21T14:50:00",
    "end": "2016-04-21T15:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 22,
        "firstname": "Pierre",
        "lastname": "FAUVEL",
        "hash": "1f997170569f6150ae82919e4f2e3659",
        "links": []
      }
    ],
    "interests": [
      "thinking environment",
      "Feedback",
      "one to one",
      "recadrage",
      "Coaching",
      "mentoring",
      "Communication"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2912"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/22"
      }
    ]
  },
  {
    "idSession": 2922,
    "votes": 9,
    "positiveVotes": 8,
    "nbConsults": 369,
    "lang": "fr",
    "format": "Workshop",
    "title": "Exploiter les nouveautés de Docker pour déployer un jeu distribué.",
    "summary": "Dans cet atelier de 2h, après une courte présentation de l'écosystème Docker, vous allez construire une application distribuée avec les autres participants à l'aide de dernières nouveautés de Docker. L'application est un dictionnaire dont chacun des participants à un sous-ensemble des données.",
    "description": "Cet atelier vous donnera un réel aperçu de ce que docker peut faire dans vos projets et vous repartirez avec un setup et des exemples que vous pourrez re-executer dans votre environnement. \n\nDocker 1.10, Swarm  et overlay network sans oublier docker-machine bien sûr. \n\nLe code de l'application est écrit en go, vous allez légèrement modifier le code de l'application est la déployer  dans un cluster formée des machines des autres participants. \n\nAucune connaissance en go sont requises pour cet atelier, nous vous assisteront, le focus est sur Docker.",
    "ideaForNow": "Connaître les bases des différents composants de Docker, connaître les nouveautés de la 1.10, savoir les appliquer sur votre projet.",
    "room": "Dijkstra",
    "year": "2016",
    "start": "2016-04-22T07:50:00",
    "end": "2016-04-22T09:40:00",
    "qrCode": null,
    "link": "https://github.com/codestory/lab-docker",
    "speakers": [
      {
        "idMember": 991,
        "firstname": "David",
        "lastname": "GAGEOT",
        "hash": "f0887bf6175ba40dca795eb37883a8cf",
        "links": []
      },
      {
        "idMember": 597,
        "firstname": "Jean-laurent",
        "lastname": "DE MORLHON",
        "hash": "649d3668d3ba68e75a3441dec9eac26e",
        "links": []
      }
    ],
    "interests": [
      "golang",
      "Docker",
      "Swarm"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2922"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/991"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/597"
      }
    ]
  },
  {
    "idSession": 2942,
    "votes": 24,
    "positiveVotes": 15,
    "nbConsults": 419,
    "lang": "fr",
    "format": "Talk",
    "title": "Docker et son ecosysteme pour les developpeurs et les ops.",
    "summary": "Une revue de l’ecosysteme Docker: les standards, l’infrastructure, la plateforme et les services; suivi par une demo: construire une application microservice utilisant le framework Java Spring Boot et la deployer sur un cluster Swarm dans un reseau overlay specifique a l’application.",
    "description": "Une revue de l’ecosysteme Docker: les standards, l’infrastructure, la plateforme et les services; suivi par une demo: construire une application microservice utilisant le framework Java Spring Boot et la deployer sur un cluster Swarm dans un reseau overlay specifique a l’application.\n\nCet expose passera en revue les 4 couches de l’ecosysteme Docker: les standards, l’infrastructure, la plateforme et les services. Les differents acteurs, outils et solutions, pour les developeurs et les ops.\nComment Docker est en train de transformer l'industrie, notions de IaaS, PaaS et CaaS.\nJe terminerai par une demo utilisant les outils Docker les plus recents, docker, docker-compose, docker-machine et Swarm pour construire une application microservice utilisant le framework Java Spring Boot, comment deployer un cluster Swarm multinode avec overlay networking, et y deployer l’application.\n\nA l’issue de la presentation, les auditeurs devraient etre capables de developper et tester une application microservice utilisant plusieurs services, deployer un cluster Swarm multi node avec overlay networking et y deployer l’application.",
    "ideaForNow": "Le code de la demo est disponible sur github https://github.com/chanezon/docker-tips/tree/master/orchestration-networking",
    "room": "Grand Amphi",
    "year": "2016",
    "start": "2016-04-22T07:50:00",
    "end": "2016-04-22T08:40:00",
    "qrCode": null,
    "link": "http://www.slideshare.net/chanezon/docker-container-as-a-service-jax-2016",
    "speakers": [
      {
        "idMember": 6402,
        "firstname": "Patrick",
        "lastname": "CHANEZON",
        "hash": "b662de358d61299eb2ea042752b96760",
        "links": []
      }
    ],
    "interests": [
      "DevOps",
      "Cloud",
      "Docker",
      "Agile"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2942"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6402"
      }
    ]
  },
  {
    "idSession": 2952,
    "votes": 1,
    "positiveVotes": 1,
    "nbConsults": 84,
    "lang": "fr",
    "format": "Talk",
    "title": "Data-Journalism @ RTSinfo - a technical approach",
    "summary": "Tips, tools, platforms & techniques used to built data-journalism products (data-vizualization and extraction, geocoding, mobile...)",
    "description": "Une description du contexte de travail pour un développeur \"full-stack\" dans le domaine du data-journalisme.\n\nQue se cache derrière ce mot ? \n\nQuelles pratiques, organisation, plateformes et techniques de programmation utiliser pour obtenir des enquêtes journalistiques enrichies des données \"smart-data\" ?\n\nCoté technique, qu'est-ce que Clojure/CLJS, postgreSQL/postGIS, D3, leaflet, cartodb peuvent apporter dans ce domaine ?\n\nPrésentation de certains cas d'utilisations et développements.",
    "ideaForNow": "...",
    "room": null,
    "year": "2016",
    "start": null,
    "end": null,
    "qrCode": null,
    "link": "https://github.com/ikarius/mix-it-2016",
    "speakers": [
      {
        "idMember": 6412,
        "firstname": "Frederic",
        "lastname": "VERGEZ",
        "hash": "c0c5e64175d6bf3257a3a7d6366df715",
        "links": []
      }
    ],
    "interests": [
      "PostgreSQL",
      "ClojureScript",
      "Agilité",
      "Clojure",
      "data visualization",
      "data-journalism"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2952"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6412"
      }
    ]
  },
  {
    "idSession": 2962,
    "votes": 0,
    "positiveVotes": 0,
    "nbConsults": 89,
    "lang": "fr",
    "format": "Random",
    "title": "Charles Suire membre et témoin des communautés de travail de Boimondau",
    "summary": "Dans les année 1940 Marcel Barbu crée une communauté de travail où la fabrication des boitiers de montre n'est qu'un prétexte au développement de l'individu dans son entièreté",
    "description": "J'ai eu la chance de rencontrer au cours de mes vacances d'été, par le plus grand des hasards un membre de cette communauté. Charles Suire. Inventeur, passionné, avec des valeurs et un caractère bien trempé, il a eu la gentillesse de me raconter comment la communauté fonctionnait. \nJe voudrai partager cette expérience et ainsi rendre hommage à ce grand homme qu'est Charles (méconnu comme beaucoup de grand hommes).",
    "ideaForNow": "La nécessaire patience, la philosophie de vie, comment changer et emmener les gens, définir un fonctionnement juste, se poser les bonnes questions, ...",
    "room": null,
    "year": "2016",
    "start": null,
    "end": null,
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 5592,
        "firstname": "Mija",
        "lastname": "RABEMANANJARA",
        "hash": "378cf6e11d79f188366ed7072889e84f",
        "links": []
      }
    ],
    "interests": [
      "historique"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2962"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5592"
      }
    ]
  },
  {
    "idSession": 2972,
    "votes": 11,
    "positiveVotes": 11,
    "nbConsults": 291,
    "lang": "fr",
    "format": "Talk",
    "title": "Kanban : un vivier d'options",
    "summary": "3 retours d’expériences dans 3 contextes différents autour de l’utilisation de Kanban.",
    "description": "Kanban propose un cadre d'amélioration continue en douceur dont la 1ère fondation est de commencer là où on en est. Comme chaque contexte est différent, chaque contexte a une adoption unique de Kanban. Mais alors : par où et comment faire ?\n\nEn vous exposant 3 adoptions différentes dans 3 contextes distincts, je vous propose plusieurs alternatives, en attirant votre attention sur les pièges à éviter, et vous donnerais quelques trucs et astuces.",
    "ideaForNow": "Vous verrez par exemple comment hacker votre processus avec un diagramme de flux cumulé.",
    "room": "Petit Amphi",
    "year": "2016",
    "start": "2016-04-21T12:40:00",
    "end": "2016-04-21T13:30:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 13,
        "firstname": "Alfred",
        "lastname": "ALMENDRA",
        "hash": "2be1fd2878821cca9006d3a5181700a7",
        "links": []
      }
    ],
    "interests": [
      "Kanban",
      "retours d'expérience"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2972"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/13"
      }
    ]
  },
  {
    "idSession": 2982,
    "votes": 2,
    "positiveVotes": 0,
    "nbConsults": 378,
    "lang": "fr",
    "format": "Talk",
    "title": "Mark, Marque et Marques",
    "summary": "Mark, Marque et Marques… ou comment créer une Marque et la faire vivre sur une interface.",
    "description": "Que ce soit une startup, un nouveau produit ou un projet client, la Marque se doit d’être au centre de nos pensées, processus et décisions. Tout est lié à la Marque : architecture, design d’interface, animations, features... Chaque détail, élément doit véhiculer le même message. Pour autant, beaucoup ignore ce qu'est réellement une Marque et pourquoi son importance est capitale.\n\nÀ travers l’histoire de «Mark», je démystifierais la Marque et vous partagerais mon expérience sur “comment la faire vivre\" sur vos interfaces. En développant le processus de création et en démontrant comment designers et développeurs peuvent travailler de concert, je vous dévoilerai les clés pour imaginer, créer une Marque et faire vivre une expérience innovante, inspirante et unique à vos utilisateurs, à vos clients.",
    "ideaForNow": "Pensez à Nike. Que ressentez-vous? ce que vous ressentez à cet instant, voila c'est la Marque.",
    "room": "Eich",
    "year": "2016",
    "start": "2016-04-21T09:20:00",
    "end": "2016-04-21T10:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 6522,
        "firstname": "Manon",
        "lastname": "GRUAZ",
        "hash": "c07f32b594de25c446662eaed35ae262",
        "links": []
      }
    ],
    "interests": [
      "design",
      "User Experience"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2982"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6522"
      }
    ]
  },
  {
    "idSession": 2992,
    "votes": 11,
    "positiveVotes": 8,
    "nbConsults": 338,
    "lang": "fr",
    "format": "Talk",
    "title": "Dev2Maker",
    "summary": "Le mouvement des makers est souvent mal compris. On imagine des communautés assez fermées, de technophiles. En réalité, le mouvement des makers est un mouvement très ouvert, très accessible et emprunte énormément aux monde des développeurs.",
    "description": "Le mouvement des makers est souvent mal compris. On imagine des communautés assez fermées, de technophiles. En réalité, le mouvement des makers est un mouvement très ouvert, très accessible et emprunte énormément aux monde des développeurs.",
    "ideaForNow": "Ce talk présente le mouvement des Makers en faisant des parallèles avec la culture Dévelopeur et vous donne les clés pour faire le bond !",
    "room": "Gosling",
    "year": "2016",
    "start": "2016-04-21T14:50:00",
    "end": "2016-04-21T15:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 5072,
        "firstname": "Damien",
        "lastname": "CAVAILLÈS",
        "hash": "455b81857aea0a5c6ca63f4ba67c4cfd",
        "links": []
      }
    ],
    "interests": [
      "3D",
      "3d printing",
      "iot",
      "maker"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/2992"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5072"
      }
    ]
  },
  {
    "idSession": 3002,
    "votes": 0,
    "positiveVotes": 0,
    "nbConsults": 160,
    "lang": "fr",
    "format": "Workshop",
    "title": "Un code plus propre avec C#6",
    "summary": "La nouvelle version de C# est disponible depuis quelques mois et elle apporte un certain nombre de nouveautés permettant l'écriture de code plus simple et propre. Nous verrons ces nouveautés mais surtout nous les mettrons en lumière à travers des exemples de refactoring.",
    "description": "La dernière version de C# qui est disponible avec le framework .Net 4.6 sous windows depuis quelques mois mais aussi avec la future version 1.0 d'Asp.Net core, n'apporte pas de nouvelle fonctionnalité révolutionnaire mais tout un ensemble de simplifications et sucre syntaxique pour nous permettre d'écrire un code plus simple et plus efficace. \nVous avez peut être vu quelques unes de ces nouveautés au cours des mois précédents mais je propose ici de les mettre en relief avec des exemples concrets afin de souligner l'importance et la mise en oeuvre de telle ou telle technique.",
    "ideaForNow": "Tout ce qui est évoqué ici est directement applicable dans son code C# actuel après migration vers le framework 4.6 (qui est compatible avec les versions 4.x). \nPour ceux qui découvrent C# en dehors de windows, les exemples fonctionnent sous mac/linux avec le dernier .net core.",
    "room": "Dijkstra",
    "year": "2016",
    "start": "2016-04-22T13:20:00",
    "end": "2016-04-22T15:10:00",
    "qrCode": null,
    "link": "https://github.com/rhwy/RefactoringToCSharp6Workshop",
    "speakers": [
      {
        "idMember": 5372,
        "firstname": "Maxime",
        "lastname": "SANGLAN-CHARLIER",
        "hash": "543c1a2d201c55419623b85b2151249a",
        "links": []
      },
      {
        "idMember": 5882,
        "firstname": "Rui",
        "lastname": "CARVALHO",
        "hash": "20de1bd6180967b4b35117cdfe22be34",
        "links": []
      }
    ],
    "interests": [
      "Clean Code",
      "TDD",
      "software  craftsmanship",
      ".Net",
      "Agile"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3002"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5372"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5882"
      }
    ]
  },
  {
    "idSession": 3012,
    "votes": 7,
    "positiveVotes": 5,
    "nbConsults": 316,
    "lang": "fr",
    "format": "Talk",
    "title": "Feedback Loops",
    "summary": "Dans cette présentation vous entendrez peut-être certaines critiques sur scrum ou les process mais il s'agit surtout d'un talk sur les valeurs et l'apprentissage.\nBien comprendre ses boucles de feedback est le meilleur moyen de réaliser les bons produits!",
    "description": "Agile. « Agile » ne représente pas un nom que nous pouvons quantifier mais une qualité, une propriété de quelque chose. Pourquoi donc dans ce cas, certaines personnes veulent nous vendre de l’agile ou prétendent faire de l’agile?\nPour éviter ce genre d’écarts, il est peut être important aujourd’hui de revenir sur les valeurs fondamentales de notre métier et sur l’agilité. Parmi ces valeurs importantes, les boucles de feedback sont une charnière centrale. Je vous propose de revenir sur ces valeurs afin de mieux les comprendre et voir ainsi comment réellement produire de meilleurs produits.",
    "ideaForNow": "ce talk a pour but de vous faire prendre du recul dans votre quotidien pour vous aider à vous concentrer sur ce qui est essentiel.",
    "room": "Grand Amphi",
    "year": "2016",
    "start": "2016-04-21T14:50:00",
    "end": "2016-04-21T15:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 5882,
        "firstname": "Rui",
        "lastname": "CARVALHO",
        "hash": "20de1bd6180967b4b35117cdfe22be34",
        "links": []
      }
    ],
    "interests": [
      "software  craftsmanship",
      "pratiques",
      "Agilité",
      "valeurs"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3012"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5882"
      }
    ]
  },
  {
    "idSession": 3022,
    "votes": 16,
    "positiveVotes": 14,
    "nbConsults": 427,
    "lang": "en",
    "format": "Talk",
    "title": "Rust in Production",
    "summary": "A talk about Rust, and how it's used in production",
    "description": "Rust is a systems programming language that focuses on safety, speed, and concurrency. Reaching 1.0 last year, Rust is a relatively new programming language, but is already seeing production use. In this talk, Steve will show you the basics of the language, while using case studies and anecdotes from production Rust users.",
    "ideaForNow": "Rust can give you reliable software at C-like speeds.",
    "room": "Grand Amphi",
    "year": "2016",
    "start": "2016-04-21T09:20:00",
    "end": "2016-04-21T10:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 6582,
        "firstname": "Steve",
        "lastname": "KLABNIK",
        "hash": "233c279c012ebac792aaa805f966cbc7",
        "links": []
      }
    ],
    "interests": [
      "rust",
      "programming language"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3022"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6582"
      }
    ]
  },
  {
    "idSession": 3032,
    "votes": 6,
    "positiveVotes": 6,
    "nbConsults": 172,
    "lang": "fr",
    "format": "Workshop",
    "title": "Les valeurs de Kanban",
    "summary": "On parle souvent des valeurs agiles, parfois des valeurs de Scrum, mais qu’en est-il des valeurs de Kanban ? Je vous propose dans cette session de les découvrir et les explorer afin de prendre un peu de recul sur votre implémentation et vous ouvrir à de nouvelles perspectives.",
    "description": "Voici le déroulé de l'atelier :\n\n1. Présentation des 9 valeurs Kanban\n\n2. Système Kanban\n- Les participants auront à relier les 4 principes fondateurs et 6 pratiques fondamentales avec les 9 valeurs Kanban\nNote : ce n'est pas si évident que ça, et cela génère des discussions intéressantes !\n\n3. Réflexions et discussion\n- Les participants auront à choisir 3 valeurs qui résonnent en eux personnellement, puis 3 valeurs qui leur paraissent importantes ou confrontantes à considérer dans leur contexte actuel.\nNote : la comparaison des 2 listes donne lieu à des discussions entre les groupes. De plus, la seconde liste peut être le début de l'élaboration d'une stratégie d'implémentation contextualisée et réfléchie de Kanban.\n\n4. Représentation visuelle\n- Les participants auront à représenter les 9 valeurs Kanban sous forme de poster. 2 Modèles seront proposés : cercles concentriques / maison Kanban, cependant l'objectif est de laisser libre la créativité des participants.\n- On affiche alors la galerie de représentation et on débriefe tous ensemble\nNote : La variété des représentations permet de donner de la nuance et de nouvelles perspectives à l'implémentation de Kanban aux participants.",
    "ideaForNow": "Prenez du recul sur vos pratiques en retournant à leur origine : quelles sont les idées fondamentales qui se cachent derrière ?",
    "room": "Nonaka",
    "year": "2016",
    "start": "2016-04-21T13:50:00",
    "end": "2016-04-21T15:40:00",
    "qrCode": null,
    "link": "http://oyomy.fr/2016/04/latelier-kanban-values-a-mix-it-2016/",
    "speakers": [
      {
        "idMember": 6312,
        "firstname": "Olivier",
        "lastname": "MY",
        "hash": "9dc20eda13e6738df9e02d28fa6fb16d",
        "links": []
      }
    ],
    "interests": [
      "Kanban",
      "Amélioration continue",
      "valeurs",
      "Coaching",
      "atelier"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3032"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6312"
      }
    ]
  },
  {
    "idSession": 3042,
    "votes": 7,
    "positiveVotes": 3,
    "nbConsults": 349,
    "lang": "fr",
    "format": "Talk",
    "title": "Simplicité par défaut",
    "summary": "Allumer une télévision : 3s, démarrer une voiture : 2s, lancer votre micro-onde : 1s. Utiliser votre application ? Intégrer quelqu'un dans votre équipe ? Permettre à une personne externe de participer à votre projet open-source ?",
    "description": "Si votre `node_modules` et ou votre `virtualenv` fait plus de 100Mo, si votre projet nécessite trois instances Docker pour servir cinq pages, si vous ne savez même plus qui builde qui, qui transpile quoi et quel intégration continue déploie où, alors vous souffrez peut-être de ce syndrome que j'appelle « Complexité par défaut ».\n\nMais tout n'est pas perdu, on va voir ensemble comment démarrer petit et itérer en étant dirigé par le besoin. Et uniquement le besoin.",
    "ideaForNow": "Si vous supprimez votre `package.json`, combien vous faut-il de jours de développement pour revenir à de l'iso-fonctionnel ?\nEst-ce qu'un développeur avec un vieil ordinateur peut installer votre stack et prendre du plaisir à coder avec ?",
    "room": "Petit Amphi",
    "year": "2016",
    "start": "2016-04-22T08:50:00",
    "end": "2016-04-22T09:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 645,
        "firstname": "David",
        "lastname": "LARLET",
        "hash": "daac2028dd52a4cda7c9133b5c22a0db",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3042"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/645"
      }
    ]
  },
  {
    "idSession": 3052,
    "votes": 2,
    "positiveVotes": 2,
    "nbConsults": 342,
    "lang": "fr",
    "format": "Talk",
    "title": "Tout ce que vous voulez savoir sur Redux",
    "summary": "Redux est un nouveau paradigme de programmation pour les interfaces Web. Il propose de centraliser l’intégralité du contexte de l’application en un seul endroit organisant toutes les transformations de façon reproductible.\n\nVenez découvrir et mettre en pratique ces nouveaux concepts !",
    "description": "Initialement un PoC de développeur sur l'architecture Flux, [Redux](http://redux.js.org/) est passé, au cours de l’année 2015, du statut \"encore une nouvelle implémentation Flux\" au statut d'implémentation la plus populaire. Elle parvient aujourd'hui à fédérer les développeurs autour de Flux y compris en dehors de l’écosystème React.\n\nRedux est un nouveau paradigme de programmation pour les interfaces Web. Il propose de centraliser l’intégralité du contexte de l’application en un seul endroit organisant toutes les transformations de façon séquentielles et reproductible.\n\nJe vous propose un tour complet de la technologie par la même approche que préconise son créateur à savoir en allant voir directement le code de la librairie. Pas de panique ! L’essentiel de la librairie peut être écrit en un dizaine de lignes.\n\nUne fois les concepts posés, nous vous proposerons un atelier mettant en oeuvre Redux dans une application existante qui ne sera autre que 2048. Avec plusieurs étapes, nous ferons évoluer l'application en l'orchestrant avec Redux et en utilisant progressivement les différents outils et design patterns couramment utilisés.\n\nVous serez rapidement à la tête d'une application fonctionnelle complètement debuggable avec les dev tools de Redux et un historique des transformations.\n\n**Pour préparer le workshop**\n\n- Installer Git & Node 4+\n- Cloner le repository git du projet : https://github.com/Swiip/2048-redux (`git clone https://github.com/Swiip/2048-redux.git`)\n- Se positionner sur la branche `step-0` (`git checkout step-0`)\n- Installer les dépendances NPM (`npm install`)",
    "ideaForNow": "Quelque soit le framework Web JS que vous utilisez, Redux peut vous proposer de créer un structure et une organisation dans votre application. Il vous apportera structure, cohérence et maintenabilité.\n\nVous ne voulez pas ajouter ça à votre projet ? Venez quand même ! Plus sérieusement, c'est un nouveau concept ou paradigme, et il fera date. On le dit toujours, la meilleur veille ne se fait pas sur une technologie, mais sur les nouvelles approches. C'est exactement ce que je vous propose.",
    "room": "Dijkstra",
    "year": "2016",
    "start": "2016-04-22T11:20:00",
    "end": "2016-04-22T13:10:00",
    "qrCode": null,
    "link": "https://github.com/Swiip/2048-redux",
    "speakers": [
      {
        "idMember": 114,
        "firstname": "Nicolas",
        "lastname": "CUILLERY",
        "hash": "b08fd9671af78445d19048228a8f3d59",
        "links": []
      },
      {
        "idMember": 105,
        "firstname": "Matthieu",
        "lastname": "LUX",
        "hash": "27bd774790e70807a5489b31f668a71e",
        "links": []
      }
    ],
    "interests": [
      "Web",
      "Programmation Réactive",
      "redux",
      "Tools",
      "React",
      "Angular",
      "Programmation Fonctionnelle"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3052"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/114"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/105"
      }
    ]
  },
  {
    "idSession": 3062,
    "votes": 21,
    "positiveVotes": 14,
    "nbConsults": 484,
    "lang": "fr",
    "format": "Talk",
    "title": "Angular 2: un framework pour les gouverner tous",
    "summary": "Après une longue période de développement, Angular 2 s'apprête enfin à faire son entrée dans la cour des grands. Découvrez le framework qui vous fera oublier React et vous donnera envie d'écrire des classes.\nVenez découvrir pourquoi Angular 2 sera le gros challenger de 2016.",
    "description": "Nous ferons un point complet sur Angular 2 et son écosystème afin que tout le monde puisse s'en faire une idée assez complète.\nNous expliquerons d'abord pourquoi Google a décidé de faire une rupture (presque) complète vis à vis d'Angular 1, puis nous parlerons de la philosophie et des ambitions d'Angular 2.\nNous aborderons alors le choix de Typescript et des nouvelles syntaxes puis nous rentrerons dans le vif du sujet avec un exemple simple d'application qui nous permettra de parler de l'approche \"composants\", de l'injection de dépendance, des annotations, de la détection des changements, de la programmation réactive, ...\nNous parlerons aussi de l'intérêt de pouvoir déporter le rendu des applications à des composants externes afin de pouvoir utiliser des web workers, générer les vues côté serveur (Angular Universal) ou encore générer des applications natives (NativeScript).\nEnfin nous verrons rapidement les possibilités pour faire évoluer une application Angular 1 vers Angular 2.",
    "ideaForNow": "En sortant de cette conférence j'espère que vous aurez envie de vous mettre immédiatement à Angular 2 afin d'être prêts à sauter le pas dès la sortie officielle. Je vous donnerai de nombreux liens pour que vous puissiez commencer à coder aussi vite que possible, et pour que vous puissiez préparer une transition en douceur si vous avez des applications en Angular 1.",
    "room": "Petit Amphi",
    "year": "2016",
    "start": "2016-04-21T14:50:00",
    "end": "2016-04-21T15:40:00",
    "qrCode": null,
    "link": "http://slides.com/ocombe/mixit2016#/",
    "speakers": [
      {
        "idMember": 6262,
        "firstname": "Olivier",
        "lastname": "COMBE",
        "hash": "ed5bfe517fe4cf235b9d6f6ee99f80bb",
        "links": []
      }
    ],
    "interests": [
      "Web",
      "JavaScript",
      "Angular"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3062"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6262"
      }
    ]
  },
  {
    "idSession": 3072,
    "votes": 12,
    "positiveVotes": 10,
    "nbConsults": 539,
    "lang": "fr",
    "format": "Talk",
    "title": "Passer de processus agiles \"à la papa\", à des équipes dynamiques et impliquées",
    "summary": "Après avoir appliqué des « processus agiles » pendant de nombreuses années, nous avons atteint les limites de l’organisation en place.\nNous avons revu le fonctionnement des équipes et des rôles qui l'entourent.\nCe nouveau modèle favorise des équipes dynamiques et impliquées, venez le découvrir !",
    "description": "Après avoir découvert et appliqué des « processus agiles » pendant plus de cinq ans, nous avions révolutionné notre façon de gérer les évolutions de nos différents produits. \n \nEt puis, après un rachat et l’apparition de nouveaux objectifs, nous avons commencé à concevoir de tout nouveaux produits.\n \nAprès quelques de mois de travail seulement, nous avons atteint les limites de l’organisation en place… un comble pour une société qui était perçue comme une référence Lyonnaise en matière d’agilité !\n \nLes interactions avec les acteurs extérieurs à l’équipe n’étaient pas assez fluides.\nLes équipes étaient placées en situation trop attentiste, pas assez impliquées dans la vision des besoins et l’élaboration des solutions.\nLe Manager et le Product Owner étaient à la fois trop directifs et pas assez présents.\n \nIl était temps de nous remettre en question !\n \nTout en gardant en tête les préceptes de base de l’agilité, nous avons revu le découpage et le focus de nos équipes, le rôle du Product Owner et du manager, le partage de la vision produit, l’approche des inconnus fonctionnels et techniques…\n \nCeci a eu des effets inattendus dans la vie des équipes mais aussi dans l’organisation managériale de notre R&D.\n \nAprès plus d’un an d’application, nous voulons partager avec vous nos nouvelles pratiques courantes qui répondent à ces problématiques et favorisent des équipes dynamiques et impliquées !",
    "ideaForNow": "Evitez le cumul de rôles\nPartagez la vision produit\nFormez de petites équipes autour de thèmes fonctionnels liés au produit\nFaites en sorte que tous les développeurs développent des fonctions de bout en bout et montent en compétences sur toutes les briques",
    "room": "Eich",
    "year": "2016",
    "start": "2016-04-21T12:40:00",
    "end": "2016-04-21T13:30:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 558,
        "firstname": "Sylvain",
        "lastname": "CHABERT",
        "hash": "409675b674a9ef6952453b2fa58e3d69",
        "links": []
      },
      {
        "idMember": 6952,
        "firstname": "Julien",
        "lastname": "PAFFUMI",
        "hash": "9ea6c1163e9e7475490d45c808ba04f4",
        "links": []
      },
      {
        "idMember": 6692,
        "firstname": "Anne",
        "lastname": "MATRAY",
        "hash": "9c4b427242f379207804632ac6099b89",
        "links": []
      },
      {
        "idMember": 7922,
        "firstname": "Jérôme",
        "lastname": "GUILLOUX",
        "hash": "b04f180f4e903d46b151264d5295d983",
        "links": []
      }
    ],
    "interests": [
      "Product Owner",
      "produit",
      "methods",
      "Agilité",
      "Organisation",
      "Management 3.0",
      "bien-être",
      "Equipe"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3072"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/558"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6952"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6692"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7922"
      }
    ]
  },
  {
    "idSession": 3082,
    "votes": 2,
    "positiveVotes": 2,
    "nbConsults": 119,
    "lang": "fr",
    "format": "Talk",
    "title": "Software Craftsmanship : le chaînon manquant de l’agilité ?",
    "summary": "Vous cherchez des pratiques de développement pour créer des logiciels bien conçus ? \nVous vous méfiez des techniques miracles qui augmentent la productivité, réduisent les bugs et font repousser les cheveux ?\nMauvaise nouvelle on ne peut rien pour vos cheveux...",
    "description": "Vous êtes développeur, ScrumMaster ou même manager et vous avez des problèmes avec votre logiciel ? \nVous avez adopté SCRUM mais vos problèmes n’ont pas disparu.\nBugs, régressions, maintenance difficile, changements coûteux bref vous avez un problème de qualité.\n\nSi les méthodes agiles se concentrent sur l’aspect organisationnel du développement logiciel, elles en disent très peu sur les pratiques de production du code.\nOr pour valoriser des “logiciels opérationnels” et “adaptables aux changements” (comme le préconise le manifeste agile), la manière de produire le code est essentielle.\nLe software craftsmanship est avant tout un état d’esprit, mais il repose sur des pratiques concrètes de développement piochées dans d’autres méthodes comme eXtreme Programming.\nDans ce retour d’expérience, un développeur et un manager vous présenterons quelques unes des pratiques que nous avons adoptées et qui ont changé notre façon de développer.\nNous vous donnerons aussi des pistes pour les transposer (ou pas !) dans votre contexte.",
    "ideaForNow": "Quatre pratiques pour développer un logiciel bien conçu, les pièges a éviter, des arguments concrets pour convaincre et surtout des guides pour choisir vos pratiques en fonction de votre contexte.",
    "room": null,
    "year": "2016",
    "start": null,
    "end": null,
    "qrCode": null,
    "link": "http://fr.slideshare.net/CharlesBouttaz/mix-it-2016-software-craftsmanship-le-chainon-manquant-de-lagilit",
    "speakers": [
      {
        "idMember": 40,
        "firstname": "Nicolas",
        "lastname": "RUFFEL",
        "hash": "1025925472aace679689108086fa64a2",
        "links": []
      },
      {
        "idMember": 530,
        "firstname": "Charles",
        "lastname": "BOUTTAZ",
        "hash": "bd0f602050b2f95901199d3a3789eb56",
        "links": []
      }
    ],
    "interests": [
      "TDD",
      "pair programming",
      "Agilité",
      "Extreme Programming",
      "Continuous Integration",
      "Emergent Design",
      "Craftsmanship"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3082"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/40"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/530"
      }
    ]
  },
  {
    "idSession": 3092,
    "votes": 5,
    "positiveVotes": 4,
    "nbConsults": 343,
    "lang": "fr",
    "format": "Workshop",
    "title": "Evolution du management dans notre monde complexe",
    "summary": "Cette présentation est destinée à des débutants. Elle a pour but d’initier une prise de connaissance, un état d’esprit et découvrir comment notre vision actuelle du management évolue.",
    "description": "Ensemble, nous allons \"jeter un œil\" sur l'évolution du management de la tradition vers l’agile et apprendre comment elle influence une organisation et la gestion de projet moderne.\n\nLa présentation est exposée sous deux volets. \n\nUn premier volet d’une heure avec la présentation de l’évolution du management et ce qui se dessine aujourd’hui + un jeu Penny game ou Marshmallow.\n\nUn deuxième volet d’une heure environ pour présenter le monde VUCA (Volatile Incertain Complexe et Ambiguë) dans lequel nous vivons de plus en plus aujourd'hui + le jeu de Lego Cynefin.",
    "ideaForNow": "Sachez dans quel contexte vous êtes.",
    "room": "Nonaka",
    "year": "2016",
    "start": "2016-04-21T08:20:00",
    "end": "2016-04-21T10:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 6992,
        "firstname": "Frederic",
        "lastname": "RODRIGUEZ",
        "hash": "54186fdee02482093196fc99675d0715",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3092"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6992"
      }
    ]
  },
  {
    "idSession": 3112,
    "votes": 10,
    "positiveVotes": 7,
    "nbConsults": 382,
    "lang": "fr",
    "format": "Talk",
    "title": "Guérir le burnout, c’est possible !",
    "summary": "Le spectre du burnout s'agite dans les médias mais au fait, qui est-il, quelles sont ses raisons ? Nous l’avons testé pour vous et vous présenterons la panoplie pour chasser ce fantôme et comment aller bien au-delà, pour le faire disparaître !",
    "description": "C’est bien beau de jongler avec les post-it pour faire du air kanban jusqu’au bout de la nuit mais parfois la flamme ne brille plus dans votre regard, celui de vos amis ou de vos collègues, vous perdez peu à peu l’envie ou la force de travailler, de sortir, vous tombez malade à répétition…\n\nLe syndrome de l’épuisement professionnel n’est pas un mythe, notre expérience personnelle et celle de notre entourage l’affirme clairement. Heureusement, grâce aux apports de la sociologie et de la psychologie nous pouvons vous proposer des moyens de le dépister et des solutions concrètes pour retrouver l’enthousiasme au travail et en-dehors.\n\nMais nous ne comptons pas nous arrêter là ! Nous vous proposerons également des solutions tout aussi concrètes pour améliorer les rapports humains dans votre entreprise (en plus, c’est très rentable), et la société toute entière (objectif ambitieux) ! Voyage au pays de l'humanisme et du bon sens pour tous ceux qui trouvent que le monde en manque.",
    "ideaForNow": "- Reconnaître les signes avant-coureur d'un burnout et y remédier au plus tôt.\n- Améliorer nos conditions de travail, les entreprises et la société.",
    "room": "Gosling",
    "year": "2016",
    "start": "2016-04-22T08:50:00",
    "end": "2016-04-22T09:40:00",
    "qrCode": null,
    "link": "https://speakerdeck.com/mcpaccard/guerir-le-burnout-cest-possible-mix-it-2016",
    "speakers": [
      {
        "idMember": 5862,
        "firstname": "Goulven",
        "lastname": "CHAMPENOIS",
        "hash": "c10372fa185fe953f9546de18cc3ef0c",
        "links": []
      },
      {
        "idMember": 6922,
        "firstname": "Marie-cécile",
        "lastname": "PACCARD",
        "hash": "50750c4b08fb46fc26fc8547fccee54c",
        "links": []
      }
    ],
    "interests": [
      "Psychologie",
      "Santé",
      "Humanisme",
      "Sociologie",
      "Société",
      "Agile"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3112"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5862"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6922"
      }
    ]
  },
  {
    "idSession": 3122,
    "votes": 18,
    "positiveVotes": 16,
    "nbConsults": 368,
    "lang": "fr",
    "format": "Talk",
    "title": "Comment obtenir des standup qui marchent",
    "summary": "Personne ne parle du standup meeting ! Il est si simple à mettre en œuvre. Source de crispations et de baillements, il relève pourtant plus souvent de la parodie d'agilité que d'auto-organisation. Il est temps d'ajuster votre board pour qu'il soit véritablement à son service. Voici comment.",
    "description": "Le daily standup meeting est populaire chez les managers et silencieusement polémique chez les développeurs. Même quand il est bien accepté, il reste le rituel le plus raté dans sa mise en œuvre. \n\nQui participe ? Vous sentez-vous obligé de prouver que vous avez bien travaillé la veille ? Attendez-vous les retardataires ? Est-ce vraiment chacun son tour de parole ? Mais ce \"respect\" empêche les discussions nécessaires ! Trouvez-vous votre standup trop bazar ou au contraire trop militaire ?  Ecoutez-vous vos pairs ou réfléchissez vous à ce que vous allez dire ? Est-ce un day changing rituel ?\n\nRegardez-moi dans les yeux et dites moi la vérité. Au final, qu'attendez-vous du daily ? \n\nQu'est-ce que cela changerait pour vous, s'il disparaissait ? \n\nUn daily standup sans board est comme une voiture sans GPS. Vous arriverez à destination, un jour, mais vous ne savez pas le chemin restant à parcourir.  Vous ne voyez pas les embouteillages avant d'y être et ne changez pas le trajet initialement prévu. Du bon vieux cycle en V. \n\nJe vous propose d'aménager votre board pour obtenir un standup énergisant que l'équipe attend avec impatience et qui vous permettent réellement d'atteindre votre objectif. Les différentes pistes sont tirées de mon expérience et du livre 99 vizualizations examples. Ce sera à vous de piocher et d'itérer dessus.",
    "ideaForNow": "- L'envie d'évaluer la qualité de votre standup\n- Des idées de management visuel pour servir au standup\n- La perspective de vraiment voir les problèmes",
    "room": "Eich",
    "year": "2016",
    "start": "2016-04-21T13:50:00",
    "end": "2016-04-21T14:40:00",
    "qrCode": null,
    "link": "http://fr.slideshare.net/foucha/comment-obtenir-des-standup-qui-marchent",
    "speakers": [
      {
        "idMember": 1016,
        "firstname": "Florence",
        "lastname": "CHABANOIS",
        "hash": "2168f37bb0b5cd95a32f9e6094bc053c",
        "links": []
      }
    ],
    "interests": [
      "standup",
      "management visuel"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3122"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/1016"
      }
    ]
  },
  {
    "idSession": 3132,
    "votes": 10,
    "positiveVotes": 6,
    "nbConsults": 430,
    "lang": "fr",
    "format": "Talk",
    "title": "\"Mais tu vas m'écouter, oui ?\"",
    "summary": "La dégradation de notre relation conversationnelle avec les machines qui nous entourent a tendance à s'accentuer avec des supports toujours plus connectés et mobiles. Il existe pourtant des techniques assez simples pour garantir efficience, fluidité et simplicité à la portée de tous.",
    "description": "Sans nous en rendre compte, les règles induites lors de l'interaction orale d'humain à humain sont transférées au travers de modèles mentaux vers les objets interactifs que nous manipulons quotidiennement. ll arrive alors que l'échange soit réduit voire impossible, générant de la frustration et de la répulsion chez nos utilisateurs. \n\nCette conférence détaillera avec humour les mécaniques de l'interaction mediée grâce notamment à l'analyse conversationnelle, discipline issue de l'éthnométhodologie (ah oui ça calme hein ;)) et de nombreux exemples comparant la vie quotidienne et celle numérique que nous créons.",
    "ideaForNow": "Faciliter la conception de produits et services faciles à utiliser et adaptés aux besoins des humains derrière la machine, de part et d'autre ! \nVous ressortirez avec des clés pratiques pour effacer la rupture du dialogue avec les utilisateurs et pour optimiser le développement et la conception de dispositifs mobiles ou autres, que vous soyez frond-end, back-end dév,...",
    "room": "Grand Amphi",
    "year": "2016",
    "start": "2016-04-22T13:20:00",
    "end": "2016-04-22T14:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 6852,
        "firstname": "Bertrand",
        "lastname": "COCHET",
        "hash": "0dc6d7d5557815f3652a5887aad90f0c",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3132"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6852"
      }
    ]
  },
  {
    "idSession": 3142,
    "votes": 13,
    "positiveVotes": 13,
    "nbConsults": 240,
    "lang": "fr",
    "format": "Talk",
    "title": "The construKction of Sound",
    "summary": "Du \"software bending\" aux petits trucs des compositeurs de musique électroacoustique, découvrez tout ce qui est nécessaire pour créer des assemblages sonores intéressants.",
    "description": "Cette causerie fait le tour d’une dizaine d’années de « recherches et développements » personnels, à la recherche du\n« son », cet objet que l’on construit, que l’on écoute, qui se développe dans le temps et l’espace, que l’on apprivoise\nparfois pour assembler en une composition électroacoustique. Quelle culture, quelles connaissances, mais aussi quels\nlogiciels, quels matériels sont-ils nécessaires pour mener à bien une telle entreprise, où l’informatique et la programmation\njouent aujourd’hui un rôle fondamental ? Extraits d’oeuvres, présentation de quelques outils, y compris des créations\nde l’auteur, logiciels existants ou à programmer soi-même, un panorama des techniques et pratiques du domaine est proposé\nà toute personne souhaitant s’initier ou se lancer dans cette quête sans fin...",
    "ideaForNow": "",
    "room": "Gosling",
    "year": "2016",
    "start": "2016-04-22T12:00:00",
    "end": "2016-04-22T12:50:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 6902,
        "firstname": "Jean-jacques",
        "lastname": "GIRARDOT",
        "hash": "495ea9aa2914c9f174365204b0555565",
        "links": []
      }
    ],
    "interests": [
      "Git",
      "Plugins",
      "DSP",
      "Algorithmes",
      "OpenSource",
      "DAW",
      "Bytecode",
      "Design sonore"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3142"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6902"
      }
    ]
  },
  {
    "idSession": 3152,
    "votes": 3,
    "positiveVotes": 3,
    "nbConsults": 56,
    "lang": "fr",
    "format": "Random",
    "title": "Agents autonomes éthiques",
    "summary": "Présentation de travaux de recherche sur le développement d'agents autonomes éthiques BDI. Présentation d'une implémentation en Jason",
    "description": "Cette présentation résumera dans un premier temps l'état actuel de la réflexion menée par le projet EthicAa financé par l'Agence Nationale pour la Recherche sur la problématique de l'éthique et des agents autonomes. Nous présenterons ensuite une proposition de l'École des Mines de Saint Étienne visant à répondre au besoin d'une faculté de jugement moral et éthique pour des agents BDI (Belief Desire Intention) et conclurons  par l'implémentation de ces agents en Jason.",
    "ideaForNow": "Présentation du langage Jason pour la programmation de systèmes multi-agent BDI d'une part, et présentation d'une réponse à la problématique de la représentation de l'éthique dans l'Intelligence Artificielle.",
    "room": null,
    "year": "2016",
    "start": null,
    "end": null,
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 6772,
        "firstname": "Nicolas",
        "lastname": "COINTE",
        "hash": "879ccefe04934d817d0fb1e750d1b246",
        "links": []
      }
    ],
    "interests": [
      "Éthique",
      "Jason",
      "Systèmes multi-agent"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3152"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6772"
      }
    ]
  },
  {
    "idSession": 3162,
    "votes": 8,
    "positiveVotes": 6,
    "nbConsults": 308,
    "lang": "fr",
    "format": "Talk",
    "title": "Écritures du monde & typographie latine",
    "summary": "Du grec au chinois, en passant par l'arabe, le cyrillique ou même l'inuit, il existe dans le monde de nombreuses façons d'écrire le language. L’esthétique, la structure et les particularités de chaque système d'écriture devient source d'inspiration concrète pour designers et typographes.",
    "description": "Tour d’horizon des systèmes d’écriture dans le monde avec 2 objectifs : \n\n1. Comprendre la variété des systèmes d'écriture  \n\nIl faut parler de la classifications des différentes systèmes d’écriture afin de comprendre la variété des structures existantes (écritures alphabétiques, syllabiques, logographique…). Du latin (une lettre = un son) au chinois (un caractère = un mot), il existe beaucoup d’autres façon d’écrire le language (un caractère = une syllabe / une voyelle ou consonne / une indication phonétique…)\n\n2. Donner aux participants des exemples concerts d’inspirations qu’ils pourront adapter à leur typographie latine.\n\nPour chaque grand type de système d’écriture, je m’appuierai sur une ou deux langues connue - ou moins connue - afin de montrer concrètement les possibilités que ces structures ouvrent : abjad (arabe, hébreu), abujida (langues en inde et asie du sud-est), logogramme (chinois), syllabaire (japonais), alphabets (cyrillique).",
    "ideaForNow": "Renouveler leurs idées créatives en matière de typographie et fournir des pistes de recherche qu'il est possible d'explorer à l'infini.",
    "room": "Gosling",
    "year": "2016",
    "start": "2016-04-21T13:50:00",
    "end": "2016-04-21T14:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 6632,
        "firstname": "Jessica",
        "lastname": "BORDEAU",
        "hash": "2f38a64d06efd5433027cc5b04265fb0",
        "links": []
      }
    ],
    "interests": [
      "design",
      "écriture",
      "typographie",
      "calligraphie",
      "inspiration"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3162"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6632"
      }
    ]
  },
  {
    "idSession": 3172,
    "votes": 15,
    "positiveVotes": 9,
    "nbConsults": 389,
    "lang": "fr",
    "format": "Talk",
    "title": "L'ergonomie web",
    "summary": "Découvrez à partir de quelques notions et règles simples comment améliorer l'ergonomie de votre site / application web, afin d'offrir à vos utilisateurs une meilleure expérience.",
    "description": "#Plan de la conférence\n* Définition ergonomie\n* Quelques concepts de base\n** Les principales lois de la Gestalt (forme) : loi de la bonne forme, loi de la proximité, loi de similitude, loi de destin commun, loi de familiarité, loi de clôture.\n** La ligne de flottaison\n** F pattern\n** Affordance\n** Loi de Fitts\n** Loi de Hick ou Hick-Hyman\n** Standart ou convention\n* Quelques bonnes pratiques :\n** Facilité la compréhension : Cohérence externe et interne\n** Bien architecturer son site :\n** Le site doit être lisible\n** Une bonne organisation visuelle\n** Le site est réactif/interactif\n** L’utilisateur a le contrôle\n** Faire attention à l’accessibilité\n* Exemples et mises en application\n** Glop / Pas glob : mise en parallèle de bons et de mauvais exemples\n** Avant / Après : exemples de mises en application des principes de la conférence\nLe tout agrémenté de petits dessins.",
    "ideaForNow": "Des pistes d’amélioration simples et rapide à mettre œuvre pour booster l'ergonomie de votre site ou application web",
    "room": "Gosling",
    "year": "2016",
    "start": "2016-04-22T13:20:00",
    "end": "2016-04-22T14:10:00",
    "qrCode": null,
    "link": "https://docs.google.com/presentation/d/1QInb5AXLsRNwXuInokzZJd7muFegKVlh8sjTjpIWLEs/pub?start=false&loop=false&delayms=10000&slide=id.p",
    "speakers": [
      {
        "idMember": 4631,
        "firstname": "Florie",
        "lastname": "SÉCHAUD",
        "hash": "39745bfcf5728631c60120ad80d06150",
        "links": []
      }
    ],
    "interests": [
      "UX",
      "UI",
      "design",
      "Ergonomie"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3172"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/4631"
      }
    ]
  },
  {
    "idSession": 3182,
    "votes": 6,
    "positiveVotes": 6,
    "nbConsults": 238,
    "lang": "fr",
    "format": "Workshop",
    "title": "Sans motivation pas d'action !",
    "summary": "Atelier ludique et participatif, pour appréhender les fondamentaux de la motivation et découvrir ses propres facteurs de motivation",
    "description": "La motivation, c'est notre carburant personnel, ce qui nous fait nous lever le matin, ce qui peut nous faire accomplir de grandes choses !\n\nAu cours de ma carrière dans l'industrie du logiciel, j'ai croisé à plusieurs reprises des managers à qui on n'avait pas expliqué (ou qui avaient mal compris) quels sont les rouages motivationnels et comment il influent sur notre travail au quotidien. Avec malheureusement des conséquences fâcheuses pour les équipes de développement.\n\nA travers un atelier ludique et participatif, venez découvrir vos facteurs de motivation personnels.\nVous repartirez avec une meilleure connaissance de vous-même, ainsi que des techniques pour mieux comprendre les facteurs de motivation de vos collègues (ou collaborateurs si vous avez des responsabilités de management).",
    "ideaForNow": "",
    "room": "Nonaka",
    "year": "2016",
    "start": "2016-04-22T11:20:00",
    "end": "2016-04-22T13:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7132,
        "firstname": "Romain",
        "lastname": "VIGNES",
        "hash": "165eaacc30b22244f3727577e1b9ecc5",
        "links": []
      }
    ],
    "interests": [
      "Leadership",
      "Collaboration",
      "Motivation",
      "Management",
      "équipe auto-organisée"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3182"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7132"
      }
    ]
  },
  {
    "idSession": 3192,
    "votes": 6,
    "positiveVotes": 3,
    "nbConsults": 264,
    "lang": "fr",
    "format": "Talk",
    "title": "Qu'est-ce qu'un scientifique pourrait apporter au Product Ownership ?",
    "summary": "Les scientifiques vivent dans leur bulle loin de l’entreprise, c’est bien connu. Mais avec l’avènement de la data et surtout de la mesure et de la démarche scientifique par le biais du lean start-up, leur façon d’appréhender les problèmes et les données pourrait bien s’avérer précieuse..",
    "description": "C'est l’histoire d’une petite physicienne tout droit sortie de l’univers de “the big bang theory” qui découvre avec surprise le monde de l’entreprise totalement inconnu jusque alors : sa façon déconcertante de prendre pour certaines toutes ses hypothèses et d’utiliser les chiffres  comme si le simple fait d’utiliser le signe “%” était un gage de vérité absolue.\nCette présentation sera ponctuée d’exemples concrets dont la façon dont les chiffres peuvent être présentés en entreprise, et de ce que cela signifie d’avoir un regard scientifique et critique sur ces derniers, et à quelle point cela peut challenger les mentalités.",
    "ideaForNow": "Comment être plus critique vis à vis de conclusions basées sur des données produit (résultats d'A/B tests etc...) et mieux évaluer, de façon générale, leur pertinence.",
    "room": "Petit Amphi",
    "year": "2016",
    "start": "2016-04-22T12:00:00",
    "end": "2016-04-22T12:50:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7112,
        "firstname": "Claire",
        "lastname": "MORIN",
        "hash": "fbcbd68cdc17c9e5f86d627b093322e2",
        "links": []
      }
    ],
    "interests": [
      "Product Owner",
      "Web analyse",
      "Lean Startup"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3192"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7112"
      }
    ]
  },
  {
    "idSession": 3202,
    "votes": 5,
    "positiveVotes": 4,
    "nbConsults": 255,
    "lang": "fr",
    "format": "Workshop",
    "title": "Atelier: utiliser Kotlin dans une architecture standard",
    "summary": "Kotlin est enfin sorti en version 1.0. Nous verrons dans cet atelier comment développer en kotlin dans une architecture «standard»: spring, jpa ou jdbc.",
    "description": "Nous partirons de zéro pour développer une application web standard en kotlin. Nous utiliserons spring boot pour accélérer l'exercice. \n\n  - paramétrer maven pour la compilation croisée kotlin - java\n  - démarrer spring boot depuis kotlin,\n  - injection de dépendance,\n  - utilisation des data class pour la sérialisation json\n  - tests\n  - jpa et jdbc\n\nPour cet atelier, vous aurez besoin: \n\n  - d'un JDK 6 +,\n  - de maven, \n  - de git, \n  - d'un intellij idea avec une version récente du plugin kotlin.\n\nNous nous familiariserons avec la syntaxe et l'outillage de kotlin en développant une petite application web from scratch. Cet exercice nous permettra de voir les nombreux apports du langage et de comprendre les quelques contraintes.\n\nNous verrons que kotlin peut remplacer java de manière quasi transparente dans toutes les couches d'un application. L'application réalisée vous fournira une base sur laquelle vous appuyer pour vos propres projets.",
    "ideaForNow": "- utiliser kotlin dans des projets existants\n  - connaître les avantages de ce langage\n  - comprendre comment l'utiliser dans ses développements de tous les jours",
    "room": "Dijkstra",
    "year": "2016",
    "start": "2016-04-21T11:50:00",
    "end": "2016-04-21T13:40:00",
    "qrCode": null,
    "link": "https://github.com/gzoritchak/kotlin-mix",
    "speakers": [
      {
        "idMember": 21,
        "firstname": "Gaetan",
        "lastname": "ZORITCHAK",
        "hash": "2799805396016e89df69d26d22c4445c",
        "links": []
      }
    ],
    "interests": [
      "Kotlin"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3202"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/21"
      }
    ]
  },
  {
    "idSession": 3212,
    "votes": 5,
    "positiveVotes": 5,
    "nbConsults": 217,
    "lang": "fr",
    "format": "Workshop",
    "title": "Hand's on Web Components with Polymer",
    "summary": "Deux heures pour découvrir les composants web et Polymer, pour passer des concepts à la création d'une première application web complète avec Polymer.",
    "description": "The W3C has been working on a Web Components standard for almost three years, but it is still a work in progress. But polyfills like allows current developers to use Web Components today, and incorporate to their apps widgets from any library  of web components. \n\nThe best known of these libraries is Google's Polymer. In Google IO 2015 conference, Google has at last released the long awaited version 1.0 of Polymer, making it even faster, more stable and at least suitable for \"serious\" applications. In this lab you will use Polymer 1.0 with Material Design Polymer Elements to design and develop a web application using web components.\n\nYou will learn to use the following technologies:\n\n- Polymer and Web Components (for mobile and desktop)\n- The Paper Elements for Polymer (material design)\n- The integration of Polymer components in Angular (1 and 2) applications.\n\nMandatory Installs prior to lab:\n+ npm \n+ bower\n+ your favorite HTML/CSS/JS IDE (I suggest Sublime Text)",
    "ideaForNow": "Beaucoup de monde a entendu parler des web components et Polymer, mais peu d'entre eux se sont donné la peine de les essayer. Et pourtant aujourd'hui Polymer es une technologie mure et de très facile accès. Avec ce *hands-on* nous voulons guider l'assistance dans leurs premier pas avec Polymer, des concepts de base à la construction de la première application complète.",
    "room": "Turing",
    "year": "2016",
    "start": "2016-04-22T13:20:00",
    "end": "2016-04-22T15:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7142,
        "firstname": "Horacio",
        "lastname": "GONZALEZ",
        "hash": "6f8d092fec403f766c734ce36e1eef93",
        "links": []
      }
    ],
    "interests": [
      "polymer",
      "web components"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3212"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7142"
      }
    ]
  },
  {
    "idSession": 3222,
    "votes": 19,
    "positiveVotes": 15,
    "nbConsults": 457,
    "lang": "fr",
    "format": "Talk",
    "title": "Sécuriser votre produit, from scratch",
    "summary": "La sécurité logicielle n'est pas un évènement ponctuel, c'est un process pour lequel on prépare et entraine son équipe. Commencez cette préparation dès maintenant et évitez les surprises le moment venu: comment réagir à un DoS? Qu'est-ce qu'un test de pénétration? Comment répondre aux incidents?",
    "description": "Vous vous posez des questions sur la sécurité de votre produit, mais vous ne\nsavez pas par où commencer. Un audit de code? Un test de pénétration?\nQu'est-ce qu'une analyse de risques?\n\nApprenez les différences entre ces pratiques, comment organiser votre\nprocessus sécurité, et comment appliquer tout de suite quelques idées à vos \napplications.",
    "ideaForNow": "Vous apprendrez notamment lors de cette conférence comment effectuer une analyse des risques de votre infrastructure, afin d'évaluer les points d'entrée et le type d'attaquant qui s\"'yn intéressera, et vous préparer à son approche.",
    "room": "Gosling",
    "year": "2016",
    "start": "2016-04-21T12:40:00",
    "end": "2016-04-21T13:30:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7092,
        "firstname": "Geoffroy",
        "lastname": "COUPRIE",
        "hash": "ed9901b9b80743c05aedf58b4f4926dd",
        "links": []
      }
    ],
    "interests": [
      "Sécurité informatique",
      "gestion des risques",
      "réponse aux incidents",
      "denial of service"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3222"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7092"
      }
    ]
  },
  {
    "idSession": 3232,
    "votes": 3,
    "positiveVotes": 2,
    "nbConsults": 304,
    "lang": "fr",
    "format": "Workshop",
    "title": "Stratégie UX : Formuler mes hypothèses (Slitch versus YeePeeChat)",
    "summary": "Un des grands changements lorsqu’on travaille en Lean Startup est le fait de mettre au grand jour les hypothèses de travail. Apprenez à les formuler pour être efficace dans vos interviews utilisateurs et l’analyse de vos données, et gagner la course entre Slitch et YeePeeChat.",
    "description": "Lors de cet atelier, nous vous proposons de d’apprendre à reconnaître les hypothèses sur lesquelles une proposition de valeur d'un produit se base. Souvent elles paraissent tellement évidentes qu’on oublie qu’elles sont là ! Chaque équipe aura sa proposition de valeur concurrente, elles devront trouver quelles sont les hypothèses sur lesquelles leur proposition se base, et comment elle peut les valider (ou les invalider) au plus vite. Avant que le marché de la rattrape...",
    "ideaForNow": "Les participants auront expérimenté : apprendre à reconnaître les hypothèses sur lesquelles se base une idée de produit, et la façon dont celles-ci permettent de rendre efficace l’analyse de données et la mise en place de pratiques de recherche utilisateur. Il s’agit de mettre en place votre stratégie UX ! Workshop inspiré par “UX Strategy” de Jaime Levy et ses méthodes d’enseignement.",
    "room": "Dijkstra",
    "year": "2016",
    "start": "2016-04-21T08:20:00",
    "end": "2016-04-21T10:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7112,
        "firstname": "Claire",
        "lastname": "MORIN",
        "hash": "fbcbd68cdc17c9e5f86d627b093322e2",
        "links": []
      },
      {
        "idMember": 6942,
        "firstname": "Nicolas",
        "lastname": "VÉRITÉ",
        "hash": "96002804bafaa163bd21b0a2fb155a8c",
        "links": []
      }
    ],
    "interests": [
      "Lean UX",
      "Lean Startup",
      "user research"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3232"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7112"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6942"
      }
    ]
  },
  {
    "idSession": 3242,
    "votes": 12,
    "positiveVotes": 10,
    "nbConsults": 328,
    "lang": "en",
    "format": "Talk",
    "title": "Succession: A Refactoring Story",
    "summary": "Refactoring sometimes devolves into an appalling mess. You're chasing a broken test suite, and every change just makes it worse. At other times it's a slow, controlled process culminating in dreadful design.\n\nThis talk presents an end-to-end refactoring that demonstrates strategies to avoid this.",
    "description": "The code example for the talk is an algorithmic folk tale (\"I know an old lady who swallowed a fly...\"). This is an easy to grasp domain. There is no need to understand complicated economics theory, or video encoding. The algorithmic component gives the code example a useful amount of complexity. The techniques that apply to this simple example also apply in the real world.\n\nDuplication catches our eye, yet much of design is about encapsulating differences. Focusing on the bits that are alike leads to awkward abstractions.\n\nThis talk shows how focusing on differences instead of similarities provides a better outcome.",
    "ideaForNow": "Focus on symmetrical differences rather than sameness. These represent an idea to be named.",
    "room": "Gosling",
    "year": "2016",
    "start": "2016-04-22T14:20:00",
    "end": "2016-04-22T15:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 5872,
        "firstname": "Katrina",
        "lastname": "OWEN",
        "hash": "51ee7bed9ecbc33aec92517f1fbb6cc2",
        "links": []
      }
    ],
    "interests": [
      "Abstractions",
      "Refactoring"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3242"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5872"
      }
    ]
  },
  {
    "idSession": 3252,
    "votes": 16,
    "positiveVotes": 15,
    "nbConsults": 380,
    "lang": "en",
    "format": "Talk",
    "title": "\"Reading in a New Language\"",
    "summary": "You've written in many languages since your first \"hello world\"–but how did you become fluent? And now that you're more senior, how well do your teammates understand the code you write? We'll draw parallels between human languages & code–and show how willpower & empathy can improve fluency in both.",
    "description": "We'll dive into the skills & contexts that are needed for learning new languages & ideas, and investigate how to apply those to code we write. We'll map the course from an excited beginner to a sometimes world-weary expert; we'll discuss how to respond when a team member says they don't understand our code; we'll talk about the role that working memory & energy play in comprehension; and we'll have a grand time exploring idiosyncrasies from human languages around the globe.",
    "ideaForNow": "Reasonable people disagree (sometimes passionately!) about what \"readable code\" means–in this session, we'll define \"readability\", then dig into why it matters, how to achieve it, and when it's worth the effort.",
    "room": "Eich",
    "year": "2016",
    "start": "2016-04-22T08:50:00",
    "end": "2016-04-22T09:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 5852,
        "firstname": "Laura",
        "lastname": "SAVINO",
        "hash": "49caddf151f4fac963db0812653fc547",
        "links": []
      }
    ],
    "interests": [
      "language",
      "Programmeur",
      "Code"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3252"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5852"
      }
    ]
  },
  {
    "idSession": 3262,
    "votes": 62,
    "positiveVotes": 59,
    "nbConsults": 490,
    "lang": "en",
    "format": "Keynote",
    "title": "Silver Bullet Syndrome",
    "summary": "What's the next Silver Bullet that will solve all our issues? Come find out!",
    "description": "We love our silver bullets don’t we? Constantly chasing the dream that the next big thing will solve all our past problems. It doesn’t matter if it’s a language, framework, platform or library, we’re out there chasing it. Why? Well because it’s going to solve our needs, it’s going to solve the business needs. Well supposedly it will. And how much is it going to cost? Not that much, especially if we’re not the ones paying the bills.\n\nIt’s about time we look at the hard facts and ask those difficult questions. Are we really looking for a silver bullet?  Why are we constantly riding the technology bandwagon? Where is the churn going to take us? And at what cost?",
    "ideaForNow": "There is no silver bullet.",
    "room": null,
    "year": "2016",
    "start": "2016-04-21T11:10:00",
    "end": "2016-04-21T11:35:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7252,
        "firstname": "Hadi",
        "lastname": "HARIRI",
        "hash": "c2072a8f90f9fe379ca21c3af39a3757",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3262"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7252"
      }
    ]
  },
  {
    "idSession": 3272,
    "votes": 14,
    "positiveVotes": 14,
    "nbConsults": 473,
    "lang": "en",
    "format": "Talk",
    "title": "Kotlin - Ready for Production",
    "summary": "Kotlin is a language that is being used by many companies worldwide. In this talk we'll see what Kotlin brings to the table when it comes to value.",
    "description": "Kotlin, a language developed by JetBrains for nearly 5 years is very close to its first release. However, did you know that it's being used in production for over a few years now already? Both inside and outside of JetBrains there are people deploying Kotlin applications for Android platform, for Web Applications and just about any other type of application.\n \nWhy are people using it instead of Java or some of the other languages out there? Primarily because it provides significant benefits in terms of conciseness, readability and safety, without some of the drawbacks that adopting a new language has such as a higher learning curve or interoperability with existing code and ecosystems. \n \nIn this talk we'll cover some aspects of Kotlin that can really help you in your daily development, focusing on solving issues versus highlighting language features.",
    "ideaForNow": "The benefits of using Kotlin today",
    "room": "Grand Amphi",
    "year": "2016",
    "start": "2016-04-21T08:20:00",
    "end": "2016-04-21T09:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7252,
        "firstname": "Hadi",
        "lastname": "HARIRI",
        "hash": "c2072a8f90f9fe379ca21c3af39a3757",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3272"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7252"
      }
    ]
  },
  {
    "idSession": 3282,
    "votes": 16,
    "positiveVotes": 13,
    "nbConsults": 427,
    "lang": "en",
    "format": "Talk",
    "title": "Go, from Zero to Hero",
    "summary": "Go is a lovely little programming language that's almost perfectly suited to writing microservices. Join the session for a crash-course in Go, where we'll build an example microservice from first principles, and hopefully convince you to try Go for your next project!",
    "description": "Go is a lovely little programming language designed by smart people you can trust and continuously improved by a large and growing open-source community. Since its release in 2009, it's quickly become the language of the server, powering some of today's most exciting software projects and organizations, including Docker, CloudFlare, HashiCorp, CoreOS, and many more. In this talk we'll do a Go crash-course, and build, grow, and profile an example microservice. You'll leave with an understanding of Go's strengths, and hopefully consider it for your next project.",
    "ideaForNow": "Go is rapidly becoming one of the most popular backend languages. It pays to have Go experience, and might even be a competitive advantage!",
    "room": "Grand Amphi",
    "year": "2016",
    "start": "2016-04-21T13:50:00",
    "end": "2016-04-21T14:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7262,
        "firstname": "Peter",
        "lastname": "BOURGON",
        "hash": "78ab1e45de2c357b8e36dc9bd70eeba2",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3282"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7262"
      }
    ]
  },
  {
    "idSession": 3292,
    "votes": 7,
    "positiveVotes": 7,
    "nbConsults": 156,
    "lang": "fr",
    "format": "Workshop",
    "title": "A lite Rx API for the JVM",
    "summary": "Une introduction à la programmation reactive nouvelle génération avec [Reactor 2.5](http://projectreactor.io). Pourquoi ? Comment ? Qu'est ce que j'en fais moi maintenant ? C'est quoi le backpressure ? La réponse a toutes ces questions et d'autres moins audacieuses dans cette session !",
    "description": "Pour développer des applications réactives, RxJava est une solution complète, mais des alternatives intéressantes existent. Après une rapide présentation des différentes API de composition réactives disponibles ainsi qu’un aperçu des changements nécessaires pour passer d’un modèle de programmation bloquant à réactif, ce Hands-On proposera une introduction à la programmation Reactive en utilisant Reactor Core 2.5, une alternative légère et performante. Nous apprendrons à utiliser les types réactifs [Flux](http://projectreactor.io/core/docs/api/reactor/core/publisher/Flux.html) (N éléments) et [Mono](http://projectreactor.io/core/docs/api/reactor/core/publisher/Mono.html) (1 élément) qui constituent la nouvelle API lite au coeur de [Reactor](http://projectreactor.io/) 2.5 qui révolutionne le monde des API Rx sur la JVM en offrant une API reprenant le vocabulaire [Reactive eXtensions](http://reactivex.io/) nativement basée sur Java 8 et [Reactive Streams](http://www.reactive-streams.org/) avec un niveau de performance jamais atteint. Vous aurez aussi droit à un aperçu du support réactif qui sera prochainement intégré à Spring Boot ...",
    "ideaForNow": "Cette session c'est un peu une tentative pour démystifier la finan.. pardon la programmation reactive. En sortant le participant aura une idée sur la question et aura compris le positionnement Spring/Reactor, ce que peut ou ne peut pas faire Java 8, et le modèle d'application qui pourrait se dessiner dans la prochaine paire d'années.",
    "room": "Turing",
    "year": "2016",
    "start": "2016-04-21T13:50:00",
    "end": "2016-04-21T15:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 6292,
        "firstname": "Stephane",
        "lastname": "MALDINI",
        "hash": "28f1e1df33de53d322cf42f4e6aec5ac",
        "links": []
      }
    ],
    "interests": [
      "reactive programming",
      "reactive",
      "ReactiveX",
      "Spring"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3292"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6292"
      }
    ]
  },
  {
    "idSession": 3302,
    "votes": 5,
    "positiveVotes": 4,
    "nbConsults": 242,
    "lang": "fr",
    "format": "Workshop",
    "title": "Atelier robotique Poppy - How can you easily program poppy and its creatures.",
    "summary": "Venez prendre le contrôle d'un robot Poppy. Dans cet atelier, nous présenterons la plateforme réunissant informatique (python), électronique (arduino), \"mécanique\" (moteur) et fabrication (imprimante 3D). Nous insisterons sur la partie programmation du robot en python, Scratch, SNAP.",
    "description": "Selon votre niveau,  vous pourrez réalisez des mouvements simples ou tester des algorithmes de cinématique ou d'équilibre en relation avec différents capteurs.\nD'abord sur le simulateur V-REP puis sur un véritable robot. Vous pouvez regarder des exemples de travaux sur http://www.poppy-prof.fr\n A la fin de ce workshop, le participant repartira avec les connaissances suffisantes pour ce lancer dans la programmation de robots.\nThis workshop aim to show how you can easily program Poppy and its creatures.",
    "ideaForNow": "Développer des comportements intelligents sur un robot. How to control a Poppy robot.",
    "room": "Turing",
    "year": "2016",
    "start": "2016-04-22T07:50:00",
    "end": "2016-04-22T09:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7392,
        "firstname": "Julien",
        "lastname": "JEHL",
        "hash": "372a8273b3ee71dc7304493e8e69869c",
        "links": []
      },
      {
        "idMember": 7612,
        "firstname": "Stephane",
        "lastname": "RIBAS",
        "hash": "576278f45e80cd9b3bf9438b53095eb7",
        "links": []
      }
    ],
    "interests": [
      "Python",
      "Robotics"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3302"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7392"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7612"
      }
    ]
  },
  {
    "idSession": 3342,
    "votes": 12,
    "positiveVotes": 10,
    "nbConsults": 260,
    "lang": "en",
    "format": "Talk",
    "title": "RxJava in legacy projects",
    "summary": "During this live coding session for Rx beginners and intermediates there will not be a single slide, we start with empty IDE to step-by-step implement key constructs in RxJava.",
    "description": "If you ever approached RxJava before you might come to a conclusion that this library solves problems most of us don't have. Reactively composing streams of data, virtual time, marble diagrams and event-driven programming - where most of our code is pretty much just transferring data from database to presentation layer.\n\nDuring this live coding session for Rx beginners and intermediates there will not be a single slide, we start with empty IDE to step-by-step implement key constructs in RxJava. Most importantly we will discover how this high-level abstraction can help in existing projects. When to use RxJava, what problems does it solve and when using it is an excess of form over substance.",
    "ideaForNow": "How to build highly reliable and concurrent applications, improving throughput and resource utilization without hurting readability and too much complexity.",
    "room": "Grand Amphi",
    "year": "2016",
    "start": "2016-04-21T12:40:00",
    "end": "2016-04-21T13:30:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7222,
        "firstname": "Tomasz",
        "lastname": "NURKIEWICZ",
        "hash": "a0a3a4200899708103f7430d87d56e24",
        "links": []
      }
    ],
    "interests": [
      "reactive programming",
      "Java",
      "functional programming",
      "RxJava",
      "Event Driven Architecture"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3342"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7222"
      }
    ]
  },
  {
    "idSession": 3352,
    "votes": 70,
    "positiveVotes": 64,
    "nbConsults": 582,
    "lang": "fr",
    "format": "Keynote",
    "title": "La confiance en soi, ça ne sert à rien",
    "summary": "La confiance en soi est souvent érigée comme l'outil indispensable au succès : croire en soi, savoir se mettre en avant, se vendre. Et si la confiance en soi n'avait rien à voir avec la réussite ?",
    "description": "Les recherches de Brené Brown sur la vulnérabilité, les événements comme FailCon et les publications récentes sur le pouvoir des introvertis présentent des formes de réussite à l'opposé de l'image d'entrepreneur-e invincible, guidé-e par son instinct infaillible et sa confiance en soi inébranlable. \nLa confiance en soi est devenue un mythe inutile et même destructeur, dans une société qui a besoin de savoir libérer les talents de chacun, pas seulement des plus extravertis.",
    "ideaForNow": "Derrière chaque peur, il y a un rêve qui attend son heure.\nComprendre \"pourquoi\" rend la confiance en soi inutile.",
    "room": null,
    "year": "2016",
    "start": "2016-04-21T07:35:00",
    "end": "2016-04-21T08:00:00",
    "qrCode": null,
    "link": "http://www.lesaventurieres.com/2016/04/22/la-confiance-en-soi-ca-ne-sert-a-rien/",
    "speakers": [
      {
        "idMember": 6532,
        "firstname": "Laure",
        "lastname": "JOUTEAU",
        "hash": "7f4e44353b899c8099f5cf28beaa05d0",
        "links": []
      }
    ],
    "interests": [
      "Reconversion",
      "Féminisme",
      "confiance en soi"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3352"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6532"
      }
    ]
  },
  {
    "idSession": 3362,
    "votes": 9,
    "positiveVotes": 5,
    "nbConsults": 344,
    "lang": "en",
    "format": "Talk",
    "title": "Hooked on HTTP/2: Microservices development with gRPC",
    "summary": "In this session you’ll learn all about gRPC and how it benefits from being based on HTTP/2 and through the use of a working demo and detailed code examples you’ll see how to build gRPC enabled microservices and clients.",
    "description": "gRPC is a language-neutral, platform-neutral RPC framework and toolset which is based on the finalized HTTP/2 standard and developed and open sourced by Google. You can use it to build highly performant, scalable APIs by allowing the definition of services using a powerful binary serialization toolset and language called Protocol Buffers. gRPC helps you to generate idiomatic client and server stubs from service definitions written in a variety of languages. In this session you’ll learn all about gRPC and how it benefits from being based on HTTP/2 and through the use of a working demo and detailed code examples you’ll see how to build gRPC enabled microservices and clients.",
    "ideaForNow": "Get started with gRPC in your favorite language today: http://www.grpc.io/ and https://github.com/grpc/grpc",
    "room": "Petit Amphi",
    "year": "2016",
    "start": "2016-04-21T13:50:00",
    "end": "2016-04-21T14:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7542,
        "firstname": "Robert",
        "lastname": "KUBIS",
        "hash": "f0ac73d24f71363ff0f7b9a4c32f010e",
        "links": []
      }
    ],
    "interests": [
      "Web",
      "http/2",
      "microservices",
      "gRPC"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3362"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7542"
      }
    ]
  },
  {
    "idSession": 3372,
    "votes": 1,
    "positiveVotes": 1,
    "nbConsults": 149,
    "lang": "en",
    "format": "Workshop",
    "title": "Hands-on gRPC experience building your own multiplayer game client",
    "summary": "Do you remember the game Simon says from the 80s? I don’t know about you, but I know many that spent hours trying to press those specific sequences of red, green, blue and yellow buttons in the correct order.  But why play on your own? Join us to get hands-on experience with gRPC!",
    "description": "Do you remember the game Simon says from the 80s? I don’t know about you, but I know many that spent hours trying to press those specific sequences of red, green, blue and yellow buttons in the correct order.  But why play on your own? We’ve implemented a gRPC server that allows you to play Simon with other players over the internet!\n\nIn this workshop we will dive into the toolset and libraries to build your very own Simon Says client for this server. We will have a message description in Protocol Buffers format and some stub code in several languages ready for you to play with. The goal for this workshop is for you to have a working client that you can use to play (and beat!) other attendees of the workshop.",
    "ideaForNow": "Get started with gRPC in your favorite language today: http://www.grpc.io/ and https://github.com/grpc/grpc",
    "room": "Turing",
    "year": "2016",
    "start": "2016-04-22T11:20:00",
    "end": "2016-04-22T13:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7542,
        "firstname": "Robert",
        "lastname": "KUBIS",
        "hash": "f0ac73d24f71363ff0f7b9a4c32f010e",
        "links": []
      },
      {
        "idMember": 7872,
        "firstname": "Mete",
        "lastname": "ATAMEL",
        "hash": "116f111c3534b2bd96f4df36b7708054",
        "links": []
      }
    ],
    "interests": [
      "Java",
      "http/2",
      "microservices",
      "gRPC",
      "NodeJS"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3372"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7542"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7872"
      }
    ]
  },
  {
    "idSession": 3422,
    "votes": 17,
    "positiveVotes": 15,
    "nbConsults": 421,
    "lang": "fr",
    "format": "Talk",
    "title": "Rester agile en grandissant - Ce qui compte, c'est les valeurs.",
    "summary": "**Retour d'expérience** de l'équipe Kuzzle. En un an, la taille de l'équipe a été multipliée par 3. C'est notre attachement aux valeurs agiles et au pragmatisme qui nous permet de rester agile tout en grandissant.",
    "description": "Je vais vous raconter l'aventure humaine que notre équipe vit au quotidien, avec nos difficultés et nos réussites.\n\nDans ce retour d'expérience, je vais vous parler de :\n* valeurs agiles\n* propriété collective de l'architecture\n* amélioration continue\n* auto-organisation et co-responsabilité\n* recrutement\n* management\n* bière\n* autobus\n\nCette session ne nécessite pas de connaissances particulières sur l'agilité.\nCette session est un retour d'expérience dans le cadre d'un projet informatique. Plusieurs éléments sont facilement transposables dans d'autres domaines.\nCette session parle d'état d'esprit agile, plus que de méthodes agiles. Vous n'apprendrez rien sur Scrum, Lean,ou autre méthode \"officielle\".",
    "ideaForNow": "Cette session est un retour d'expérience, ce n'est **pas une leçon sur comment bien faire de l'agilité**. Peut-être y trouverez-vous de l'inspiration et des pistes d'amélioration pour votre propre contexte.",
    "room": "Eich",
    "year": "2016",
    "start": "2016-04-21T08:20:00",
    "end": "2016-04-21T09:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 6222,
        "firstname": "Emilie",
        "lastname": "ESPOSITO",
        "hash": "9f13087e4a2d7eab22c131f297fbdfed",
        "links": []
      }
    ],
    "interests": [
      "Agilité",
      "Amélioration continue",
      "valeurs",
      "retour d’expérience",
      "Auto-organisation",
      "management agile"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3422"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6222"
      }
    ]
  },
  {
    "idSession": 3432,
    "votes": 12,
    "positiveVotes": 10,
    "nbConsults": 271,
    "lang": "fr",
    "format": "Talk",
    "title": "J'anime une rétrospective productive.",
    "summary": "Trop souvent, la boucle d'amélioration continue, est négligée ou mal mise en œuvre. Cette session propose revenir sur la notion de facilitation lors des rétrospectives et de faire un tour des outils disponibles.",
    "description": "La rétrospective est un exercice important dans la démarche agile, elle permet la mise en œuvre de la boucle d'amélioration continue.\nCette cérémonie est souvent mal comprise, mal animé, ce qui génère de la frustration pour l'équipe, des actions peu intéressante et un abandon à plus ou moins court terme.\nLa facilitation de rétrospective est un exercice particulier qui nécessite beaucoup plus de compétence que l'animation classique de réunion.\nLe format, l'activité mise en œuvre, le positionnement de l'animateur sont autant de paramètre qui auront une influence sur le résultat obtenu.\nCette session propose de revenir sur les bases de la facilitation de rétrospective. Elle permettra aussi de faire un tour d'horizon de quelques serious games à mettre en œuvre.",
    "ideaForNow": "pouvoir se lancer dans l'animation de rétrospective\nSavoir varier les ateliers proposer",
    "room": "Eich",
    "year": "2016",
    "start": "2016-04-22T14:20:00",
    "end": "2016-04-22T15:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 6892,
        "firstname": "Maxime",
        "lastname": "BONNET",
        "hash": "7b2b39389e55078d65c09bf8c001ad4f",
        "links": []
      }
    ],
    "interests": [
      "Facilitation",
      "Rétrospective",
      "serious games",
      "Agile"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3432"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6892"
      }
    ]
  },
  {
    "idSession": 3442,
    "votes": 15,
    "positiveVotes": 11,
    "nbConsults": 412,
    "lang": "fr",
    "format": "Talk",
    "title": "Du Reactive Rx-Like pour Java 8 et plus ? V'la Reactor 2.5 !",
    "summary": "Une introduction à la programmation reactive nouvelle génération avec [Reactor 2.5](http://projectreactor.io). Pourquoi ? Comment ? Qu'est ce que j'en fais moi maintenant ? C'est quoi le backpressure ? La réponse a toutes ces questions et d'autres moins audacieuses dans cette session !",
    "description": "La programmation Reactive c'est un peu le sujet clivant dans une bonne pause café avec ses pairs, c'est soit:\n- Réponse A : \"N'importe quoi, çà prendra jamais, on comprend rien et on en a même pas besoin.\n- Réponse B : \"T'as rien compris, t'es nul, c'est le futur, d'ailleurs j'ai remplacé mon cloud à éoliennes avec le gang le week-end dernier.\"\n\n[Reactor 2.5](http://projectreactor.io) a l'extrême ambition de cliver moins. On s'y est même mis a plusieurs entre les contributeurs de RxJava, Reactor et Spring. Pourquoi ? Comment ? C'est quoi la backpressure ? Et que vient faire Spring Framework dans cette histoire ? La réponse a toutes ces questions et d'autres moins audacieuses dans cette session !",
    "ideaForNow": "Cette session c'est un peu une tentative pour démystifier la finan.. pardon la programmation reactive. En sortant le participant aura une idée sur la question et aura compris le positionnement Spring/Reactor, ce que peut ou ne peut pas faire Java 8, et le modèle d'application qui pourrait se dessiner dans la prochaine paire d'années.",
    "room": "Gosling",
    "year": "2016",
    "start": "2016-04-21T09:20:00",
    "end": "2016-04-21T10:10:00",
    "qrCode": null,
    "link": "http://www.slideshare.net/StphaneMaldini/introduction-to-reactive-streams-and-reactor-25",
    "speakers": [
      {
        "idMember": 6292,
        "firstname": "Stephane",
        "lastname": "MALDINI",
        "hash": "28f1e1df33de53d322cf42f4e6aec5ac",
        "links": []
      }
    ],
    "interests": [
      "reactive programming",
      "reactive",
      "ReactiveX",
      "Spring"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3442"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6292"
      }
    ]
  },
  {
    "idSession": 3452,
    "votes": 25,
    "positiveVotes": 16,
    "nbConsults": 177,
    "lang": "en",
    "format": "Keynote",
    "title": "21st Century Activists Need 21st Century Skill-sets",
    "summary": "Let's talk tech, race, class and our role as technologists to join the international struggle.",
    "description": "Imagine if the Black Panthers had a technology education program. That is the type of tech activism Idalin aims to bring to the table through her work. Her goal is to merge computer programming with political education so that black and brown people understand the impact technology and social structures have on their lives and possess the means to produce the fundamental change needed for social justice to be a reality. Idalin Bobé is an IT consultant at ThoughtWorks and a tech activist. Her passion is bridging the digital divide among hard-to-reach populations and creating more technical community-driven leaders. Originally from the North Side of Philadelphia, Idalin has impacted thousands of men, women and children globally with her work in tech literacy and empowerment.\n\nHer most recent work was supporting Ferguson, Missouri activists with technology tools through Hands Up United's \"Roy Clay Sr. Institute.\" The program trains young community leaders to gain 21st century skills, combining computer coding and political education. Other tech initiatives she spearheaded were: building a computer lab for a school in South India serving people of the lowest caste, building fundraising campaigns to teach 2,000 girls of color through Black Girls CODE and organizing social justice hackathons with Qeyno Labs Hackathons and #YesWeCode.\n\nStill under 35, Idalin is a rising social entrepreneur, whose work has positioned her at the forefront as an innovative leader in technology, activism and community development.",
    "ideaForNow": "Open your mind",
    "room": null,
    "year": "2016",
    "start": "2016-04-22T15:45:00",
    "end": "2016-04-22T16:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 6672,
        "firstname": "Idalin",
        "lastname": "BOBÉ",
        "hash": "9820d958862530243ac90fe13736f2e7",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3452"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/6672"
      }
    ]
  },
  {
    "idSession": 3492,
    "votes": 2,
    "positiveVotes": 1,
    "nbConsults": 116,
    "lang": "fr",
    "format": "Workshop",
    "title": "Agilité en une journée",
    "summary": "Venez prendre part à un projet agile ! Ensemble, que ce soit pour 1h, 1/2 journée ou plus, nous allons développer une petite application WEB de façon agile, avec les cérémonies et les bonnes pratiques. Venez participer, observer, questionner, ... pour découvrir l'agilité en action !",
    "description": "Vous, participants à la conférence, serez des clients ou des équipiers en force. Vous allez être impliqués dans notre projet \"Agilité en une journée\". Vous avez le choix de votre implication : 1h (une itération), 1/2journée, ou toute la journée (le projet complet). Vous participerez à ce qui vous fait envie, que vous soyez expert ou débutant, ou simplement curieux de vivre un projet agile de l’intérieur : sprint, démo, rétro, sprint0, livraison, … Vous participerez à un projet agile original, vous pratiquerez plein de cérémonies, aurez du feedback, progresserez et découvrirez de nouvelles manières de gérer vos cérémonies … Une équipe de ProductOwner/DEV/ScrumMaster expérimentés de différents horizons et sociétés vous accompagnera. Vous redécouvrirez plein de bonnes pratiques, vous ferez plein d’erreurs et vous en sortirez grandis. Côté technique, nous ferons un peu de Big Data (Apache Flink), et un peu de développement WEB et Javascript. Et tout ça en nous amusant !!!",
    "ideaForNow": "Pratiquer l'agilité de l'interieur pour la mettre en oeuvre rapidement dans votre quotidien",
    "room": null,
    "year": "2016",
    "start": null,
    "end": null,
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7752,
        "firstname": "Matthieu",
        "lastname": "GIRONNET",
        "hash": "4c75c9e12938f09b872013e04a048ef8",
        "links": []
      },
      {
        "idMember": 7632,
        "firstname": "Jean-charles",
        "lastname": "DURAND",
        "hash": "d8b0b74f2928faac190d3e106126404b",
        "links": []
      },
      {
        "idMember": 7702,
        "firstname": "Franck",
        "lastname": "RAGEADE",
        "hash": "593c18ea25ef1171700928819c543fc6",
        "links": []
      },
      {
        "idMember": 5352,
        "firstname": "Xavier",
        "lastname": "NOPRE",
        "hash": "96d381174efe41f85fc16f47b9921e05",
        "links": []
      }
    ],
    "interests": [
      "Product Owner",
      "Agilité",
      "Big Data",
      "Spring",
      "pratiques agiles",
      "Web",
      "ScrumMaster",
      "Rétrospective",
      "JavaScript",
      "developpment",
      "iteration",
      "Scrum",
      "Equipe"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3492"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7752"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7632"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7702"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5352"
      }
    ]
  },
  {
    "idSession": 3502,
    "votes": 17,
    "positiveVotes": 11,
    "nbConsults": 238,
    "lang": "fr",
    "format": "Keynote",
    "title": "Du produit au business model, en passant par le pivot",
    "summary": "Avoir une idée, c'est bien au début. Avoir un produit, c'est mieux ensuite. Avoir un business model, c'est avoir une entreprise.",
    "description": "Se lancer sans business model puis construire son offre avec les usages et les demandes autour du produit.\n\nJe ferai un talk entièrement basé sur mon expérience des 4 années au sein de Bunkr. \nItérations, pivots, coups durs, management, relation investisseurs, premiers clients...",
    "ideaForNow": "\"If you don't ask, the answer is no.\"\n\"There is no certainty, only opportunity.\"",
    "room": "Grand Amphi",
    "year": "2016",
    "start": "2016-04-22T11:20:00",
    "end": "2016-04-22T11:45:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7212,
        "firstname": "Alexis",
        "lastname": "JAMET",
        "hash": "3d7775715465f132769c43f50741e886",
        "links": []
      }
    ],
    "interests": [
      "Business Model",
      "nobullshit",
      "Truelife",
      "Startup"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3502"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7212"
      }
    ]
  },
  {
    "idSession": 3522,
    "votes": 31,
    "positiveVotes": 21,
    "nbConsults": 257,
    "lang": "en",
    "format": "Keynote",
    "title": "The Impact of Code on Society",
    "summary": "More information asap",
    "description": "More information asap",
    "ideaForNow": "More information asap",
    "room": null,
    "year": "2016",
    "start": "2016-04-22T07:05:00",
    "end": "2016-04-22T07:30:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 5522,
        "firstname": "Joel",
        "lastname": "SPOLSKY",
        "hash": "346a8788078a658ec6608bb37a663324",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3522"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5522"
      }
    ]
  },
  {
    "idSession": 3532,
    "votes": 9,
    "positiveVotes": 8,
    "nbConsults": 394,
    "lang": "fr",
    "format": "Talk",
    "title": "Crash Fast & Furious",
    "summary": "L'app Square Register Android ne crashe pas. Enfin... presque pas!",
    "description": "La recette magique? Combiner une approche aggressive avec la remontée de métadonnées et un monitoring précis. Venez découvrir les outils et techniques qui nous permettent de développer une app gérant des paiements sans mourir de trouille!",
    "ideaForNow": "Retour d'expérience",
    "room": "Grand Amphi",
    "year": "2016",
    "start": "2016-04-22T14:20:00",
    "end": "2016-04-22T15:10:00",
    "qrCode": null,
    "link": "http://www.slideshare.net/pyricau/crash-fast-furious-61290968",
    "speakers": [
      {
        "idMember": 277,
        "firstname": "Pierre-yves",
        "lastname": "RICAU",
        "hash": "06c6a07275076c6b525e2b14018ad78e",
        "links": []
      }
    ],
    "interests": [
      "Android"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3532"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/277"
      }
    ]
  },
  {
    "idSession": 3542,
    "votes": 6,
    "positiveVotes": 5,
    "nbConsults": 278,
    "lang": "en",
    "format": "Talk",
    "title": "Where’s the reset button in a smart city?",
    "summary": "As the virtual merges onto the physical the impact software has on our lives becomes ever stronger. Programmable connected objects are invading our cities, industries and homes. In the absence of a coherent & secure ecosystem chaos is assured. In this talk we'll explore possible solutions.",
    "description": "We will project ourselves in the future via an imaginary day in an heavily IOT’d world and understand the importance of our developments today and the impact of short term choices versus long term thinking. We will cover several dimensions of programming for IOT ranging from best practices, to tools, from standards to business models, from ethics and security to ecosystems and environmental impact. Participants will have a clear vision of how to develop for an IOT world and how it is changing existing development practices.",
    "ideaForNow": "Learn how to adapt software engineering practices to develop top quality code, fast, weather you are developing in a small team, large or extra large team. Learn to think longterm taking into account the ecosystem to develop successfully creating a long-lasting positive impact.",
    "room": "Eich",
    "year": "2016",
    "start": "2016-04-22T13:20:00",
    "end": "2016-04-22T14:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 5752,
        "firstname": "Matteo",
        "lastname": "MAZZERI",
        "hash": "0e487753f4c933d7e78ea41c8b2ba6be",
        "links": []
      }
    ],
    "interests": [
      "innovation",
      "smartcities",
      "iot",
      "security",
      "Agile"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3542"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5752"
      }
    ]
  },
  {
    "idSession": 3552,
    "votes": 22,
    "positiveVotes": 22,
    "nbConsults": 518,
    "lang": "en",
    "format": "Talk",
    "title": "Git from the inside out",
    "summary": "A deep dive into the internals of Git.",
    "description": "I'll explain what's going on inside the .git directory when you commit, check out, merge, resolve conflicts, push and pull. I'll focus on the graph structure that underpins Git and the way the properties of this graph dictate Git’s behavior.  I'll show you how to use these properties to understand what Git has done, what it is doing, and what it will do.",
    "ideaForNow": "The internals of Git.",
    "room": "Petit Amphi",
    "year": "2016",
    "start": "2016-04-21T09:20:00",
    "end": "2016-04-21T10:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 5782,
        "firstname": "Mary rose",
        "lastname": "COOK",
        "hash": "bfb7553ad3a564727391fa9be2352546",
        "links": []
      }
    ],
    "interests": [
      "Git",
      "graphs"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3552"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/5782"
      }
    ]
  },
  {
    "idSession": 3562,
    "votes": 43,
    "positiveVotes": 42,
    "nbConsults": 327,
    "lang": "fr",
    "format": "Keynote",
    "title": "Recette pour parvenir à donner une conférence sur les embryons de manchot à MiXiT",
    "summary": "Décidez de monter votre équipe de recherche au Collège de France à Paris. Obtenez votre poste, puis partez en voyage. Décidez de voir un iceberg. Allez à Ushuaia, le « bout du monde ».",
    "description": "Décidez de monter votre équipe de recherche au Collège de France à Paris. Obtenez votre poste, puis partez en voyage. Décidez de voir un iceberg. Allez à Ushuaia, le « bout du monde ». Faîtes-y un trou béant dans votre portefeuille. Payez-vous ainsi le luxe de passer deux jours d’ennui nauséeux sur les eaux déchaînées au sud du Cap Horn.  Espérez entrevoir entre deux tempêtes de neige un continent froid, hostile, et avec de la chance, un manchot. Voyez ledit manchot et quelques milliers de ses cousins. Revenez en France prendre vos fonctions au Collège de France. Modifiez tous vos projets de recherche et risquez votre statut durement acquis pour essayer de revoir le manchot sans refaire de trous dans votre portefeuille. Parlez de votre démarche constructive bien que mentalement discutable à la radio. Attirez ainsi l'attention des organisateurs de MiXiT. Faîtes-vous inviter. Le tour est joué.",
    "ideaForNow": "keynote",
    "room": null,
    "year": "2016",
    "start": "2016-04-21T16:15:00",
    "end": "2016-04-21T16:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7342,
        "firstname": "Marie",
        "lastname": "MANCEAU",
        "hash": "1fe5e5e6f7973d0589f90366cce9ac23",
        "links": []
      }
    ],
    "interests": [],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3562"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7342"
      }
    ]
  },
  {
    "idSession": 3592,
    "votes": 4,
    "positiveVotes": 4,
    "nbConsults": 186,
    "lang": "en",
    "format": "Talk",
    "title": "Changing Medical Research on Mobile",
    "summary": "How can mobile apps improve our health by changing how researchers conduct medical studies? This talk focuses on ResearchKit, an open-source framework created by Apple to help scientists make better apps.",
    "description": "ResearchKit is a great example of how mobile technology can improve traditionnal processes, and why it matters.\n\nI would like to give a general presentation of ResearchKit, and showcase a couple of apps powered by this framework. I would like to explain what new capabilities are made possible for medical studies with smartphones, and why it’s important for our health. Finally, I would like to talk about the open-source project itself, and how Apple enabled developers and researchers to contribute to the framework.",
    "ideaForNow": "Let’s rethink existing processes, and figure out how mobiles devices can open up new opportunities.",
    "room": "Eich",
    "year": "2016",
    "start": "2016-04-22T07:50:00",
    "end": "2016-04-22T08:40:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 795,
        "firstname": "Vincent",
        "lastname": "TOURRAINE",
        "hash": "74079210c61f36dff0a74f24da5727e7",
        "links": []
      }
    ],
    "interests": [
      "science",
      "iOS",
      "Mobile"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3592"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/795"
      }
    ]
  },
  {
    "idSession": 3602,
    "votes": 39,
    "positiveVotes": 35,
    "nbConsults": 274,
    "lang": "en",
    "format": "Keynote",
    "title": "Tim Urban's Keynote on AI",
    "summary": "Tim Urban from [Wait But Why](http://waitbutwhy.com/) on Artificial Intelligence",
    "description": "Tim Urban from [Wait But Why](http://waitbutwhy.com/) on Artificial Intelligence.\nThat will be a remote keynote, on Skype.\n\n*Spoiler alert!* His article on AI, [The AI Revolution: The Road to Superintelligence](http://waitbutwhy.com/2015/01/artificial-intelligence-revolution-1.html)",
    "ideaForNow": "Not destroy the World.",
    "room": null,
    "year": "2016",
    "start": "2016-04-21T15:50:00",
    "end": "2016-04-21T16:15:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7962,
        "firstname": "Tim",
        "lastname": "URBAN",
        "hash": "cdaf873c33f051e535da2ccf39bae526",
        "links": []
      }
    ],
    "interests": [
      "Intelligence Artificielle"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3602"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7962"
      }
    ]
  },
  {
    "idSession": 3612,
    "votes": 4,
    "positiveVotes": 3,
    "nbConsults": 179,
    "lang": "fr",
    "format": "Talk",
    "title": "Des parsers sûrs avec Rust et nom",
    "summary": "L'écriture de parsers est un exercice intéressant, mais dangereux: on ne compte plus les erreurs d'implémentations, vulnérabilités et crashes en production causés par des parsers. En utilisant la méthode des parser combinators et la gestion mémoire de Rust, on évitera tous ces écueils.",
    "description": "Les développeurs ont longtemps hésités entre les générateurs de parsers, comme lex et yacc, et l'écriture à la main, de préférence en C. On sait maintenant que les générateurs sont souvent limités, et que les parsers manuels sont complexes et souvent vulnérables.\nEn appliquant l'approche des parser combinators, plus flexibles que les générateurs, et plus précis que les parsers manuels, on obtient des parsers simples à développer et maintenir.\nEn utilisant la gestion mémoire garantie par le compilateur Rust, on peut pousser la performance du décodage à ses limites, par exemple par du parsing \"zero copy\", d'où la bibliothèque de parsers \"nom\".\n\nCette conférence décrit les astuces fournies par le langage Rust, et comment on peut les appliquer pour obtenir du code sûr et performant avec peu d'effort. On abordera aussi les parties théoriques des langages et parsers, ainsi que les (mauvaises) pratiques des formats de fichier actuels. Enfin, on étudiera les outils conçus pour aider au développement et à la maintenance de parsers.",
    "ideaForNow": "Arrêtez d'écrire vos parsers à la main, laissez tomber yacc, testez les parser combinators: c'est facile à utiliser.",
    "room": "Petit Amphi",
    "year": "2016",
    "start": "2016-04-22T13:20:00",
    "end": "2016-04-22T14:10:00",
    "qrCode": null,
    "link": null,
    "speakers": [
      {
        "idMember": 7092,
        "firstname": "Geoffroy",
        "lastname": "COUPRIE",
        "hash": "ed9901b9b80743c05aedf58b4f4926dd",
        "links": []
      }
    ],
    "interests": [
      "rust",
      "parsers"
    ],
    "links": [
      {
        "rel": "self",
        "href": "http://localhost:8081/api/session/3612"
      },
      {
        "rel": "speaker",
        "href": "http://localhost:8081/api/member/7092"
      }
    ]
  }
]
