[
  {
    "id": "2442",
    "state": "ACCEPTED",
    "name": "Utilisation de Jeux en management de projet",
    "language": "Français",
    "description": "L'agilité est une approche radicalement différente des autres méthodes de management de projet. Ses fondements reposent sur le Manifeste Agile et ses méthodes s'enrichissent régulièrement de nouvelles pratiques.\nCes dernières années, la boîte à outils de l'agilité s'est enrichie de jeux ou ateliers ludinnovants.",
    "plus": "Les techniques ludiques sont utilisées depuis longtemps comme support à l'apprentissage ou pour le plaisir de passer un moment convivial en équipe. Par contre, il est plus rare des les voir utilisées pour définir des produits, résoudre des problèmes ou tout simplement animer une réunion projet, ce qui est tout à fait courant dans l'Agilité.\nJe pratique ces jeux depuis des années avec mes clients, cela marche toujours même si parfois c’est un peu spécial, venez partager mes retours d’expérience.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Team",
    "difficulty": 1,
    "speaker": {
      "id": "345",
      "email": "a.boutin@agiletoyou.com",
      "lastname": "BOUTIN",
      "firstname": "Alexandre",
      "bio": "Diplômé de l’Ensimag en 1989, Alexandre découvre l’Agilité en 2004 et prend en charge la promotion de l’Agilité en Europe, Asie et Inde pour Yahoo International de 2005 à 2009.\nDébut 2009, Alexandre décide de créer la société AGILETOYOU pour former et accompagner de nombreux clients désireux de devenir Agile (Orange, EDF, Total, Samse, BBC, HP, Sanofi …).\nAlexandre est un blogueur (www.agilex.fr) et twitter (@agilex) reconnu, et également un orateur régulier des conférences agiles nationales.",
      "company": "AGILETOYOU",
      "twitter": "@agilex",
      "googleplus": null,
      "github": null,
      "language": "Français",
      "gender": "MALE",
      "social": "www.agilex.fr",
      "imageProfilURL": null
    },
    "cospeakers": []
  },
  {
    "id": "2444",
    "state": "ACCEPTED",
    "name": "Building highly productive teams with empathy",
    "language": "English",
    "description": "One of our most valuable commodities as humans is our ability to build relationships – both personally and professionally. And the key to any successful relationship is empathy: being able to understand someone, connect with someone and view the world through their eyes. The problem is that the empathy needed to cultivate relationships, foster collaboration and build strong communities is often times lacking, especially when we are around people who are different from us.",
    "plus": "In this talk, Sharon will discuss how communication plays a role in building successful relationships; how empathy fosters highly collaborative teams; and finally we’ll talk about true accessibility. Why? Because innovation is at it’s best when it’s inclusive. And to be inclusive, you must be empathetic",
    "eventId": "mix-it",
    "format": 50,
    "trackLabel": "Team",
    "difficulty": 1,
    "speaker": {
      "id": "1064",
      "email": "sharon@sharonsteed.co",
      "lastname": "Steed",
      "firstname": "Sharon",
      "bio": "Sharon is an empathy consultant, public speaker and writer. A lifelong stutterer, she utilizes her experiences with her speech along with her background in marketing to help companies communicate more effectively both internally and with their target audience. She writes and speaks about improving communication through empathy. She also over a decade of experience creating and managing content for businesses. You can find out more about her work at communilogue.co.",
      "company": "Communilogue",
      "twitter": "http://www.twitter.com/sharonsteed",
      "googleplus": null,
      "github": null,
      "language": "English",
      "gender": "FEMALE",
      "social": "http://www.communilogue.co",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/786664224088989696/B-idKHql.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2447",
    "state": "ACCEPTED",
    "name": "Make More Than Music with MIDI, JavaScript & Tiny Computers",
    "language": "English",
    "description": "Tiny computers such as the [RaspberryPi](https://www.raspberrypi.org), [Arduino](https://www.arduino.cc/) and [C.H.I.P.](https://getchip.com/) have finally reached a level of  performance and affordability that makes hardware experimentation accessible to everyone. At the same time, JavaScript has emerged as the lingua franca of web programming and can be found in many places beyond just the browser. \n\nWhat if I told you there was a mature protocol that's been around since 1983 and was uniquely poised to take advantage of this development?\n\nWell, wonder no more and [meet MIDI](https://en.wikipedia.org/wiki/MIDI)! ",
    "plus": "Sitting at convergence of these two things is MIDI — a niche protocol that's been around since 1983 and was originally designed for musical instruments to communicate with one another. It's event-oriented approach to messaging feels right at home in the asynchronous world of JavaScript & Node, and the prevalence of MIDI support in older musical equipment means you can find unique, hackable and affordable hardware at your local pawnshop or Craig's List.\n\nThis unlikely tech stack — Tiny Computers + JavaScript + MIDI — can lend itself to creative programming beyond music. George's Talk will explain how to get started, walk through several examples and elaborate on the future of this stack, not only as a platform for experimentation but for education as well.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Maker",
    "difficulty": 2,
    "speaker": {
      "id": "3203",
      "email": "george@mand.is",
      "lastname": "George",
      "firstname": "Mandis",
      "bio": "George Mandis is a freelance web developer, consultant, frequent traveler and occasional educator based primarily out of Portland, Oregon. He’s worked with startups, professional sports teams, small businesses and individuals but excels at helping people find elegant solutions for their projects. He spent a year living as a digital nomad, inadvertently cheated at a marathon in North Korea and writes frequently on technology and travel on his website.",
      "company": null,
      "twitter": "georgeMandis",
      "googleplus": null,
      "github": "georgemandis",
      "language": "en",
      "gender": "MALE",
      "social": "https://george.mand.is",
      "imageProfilURL": "http://george.mand.is.s3.amazonaws.com/profile-smaller.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2449",
    "state": "ACCEPTED",
    "name": "Elm pour la construction d'une application web moderne",
    "language": "Français",
    "description": "Les applications web au cours de ces dernières années ont évoluées de manière **drastique** ! C'est génial ! D'un côté, en tant qu'utilisateur, on bénéfice d'expériences de navigation de plus en plus fluide et immersive, de l'autre, en tant que développeur, on gagne de la matière intéressante à exploiter pour construire des applications de plus en plus riches. Dans cette présentation, je vous propose de survoler le langage **Elm** pour construire une Single Page App moderne, offrant tous les canaux d'interactivité que l'on peut attendre (routing client, mutation de la page, signaux discrets). ",
    "plus": "En plus de présenter les intérêts de Elm, *un langage fonctionnel, statiquement typé, drivé par sa communauté*, doté d'un compilateur très très bavard pour faciliter le débogage et donc, par extension, *le réfactoring*.\n\nNous verrons comment exploiter au mieux son framework pour faire de la programmation fonctionnelle réactive dirigée par des composants.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "3142",
      "email": "xavier.vdw@gmail.com",
      "lastname": "Van de Woestyne",
      "firstname": "Xavier",
      "bio": "Je suis Belge mais je vis à Lille depuis 5 ans où je gère le meetup LilleFP, un rendez-vous tous les deux mois pour écouter des talks sur la programmation fonctionnelle et les systèmes de types . Je travaille avec des langages fonctionnels depuis à peu près 10 ans. J'ai énormément utilisé Erlang, OCaml, Haskell et F#. Aujourd'hui, dans mon travail, j'utilise principalement Elixir et Elm. \nJ'aime par dessus tout les langages fonctionnels statiquement typés et il m'arrive de faire de l'orienté objet avec Ruby, Pharo et Io !\n\nEn  plus de la programmation, j'ai développé une véritable passion pour la peinture et les relations que l'on peut construire entre les systèmes de types, la théorie des catégories et les motifs récurrents en littérature (ce qui permet des projets, notamment de recherches, assez ésotériques et amusants, utilisant des outils comme Coq ou Idris).",
      "company": "Fewlines.co",
      "twitter": "https://twitter.com/vdwxv",
      "googleplus": null,
      "github": "https://github.com/xvw",
      "language": "fr",
      "gender": "MALE",
      "social": "https://xvw.github.io, https://github.com/lillefp/talks/blob/master/README.md",
      "imageProfilURL": "https://avatars0.githubusercontent.com/u/5732466?s=460&v=4"
    },
    "cospeakers": []
  },
  {
    "id": "2474",
    "state": "ACCEPTED",
    "name": "1 Pixel Per Second",
    "language": "Français",
    "description": "Créer du \"pixel art\" collaboratif, tel est notre challenge dans cette expérience de live coding. En utilisant Spring Boot, WebFlux et Reactor, ma mission est de lui donner une API. La vôtre est juste de dessiner... 1 pixel par seconde :)",
    "plus": "En Avril 2017, Reddit a conduit une expérience sociale: un canvas collaboratif géant surnommé \"r/place\". Le truc: une personne seule ne pouvait que **peindre un pixel toutes les 5 minutes**... Des communautés pré-existantes sur le site se sont ralliées pour revendiquer leur lopin de pixels, et de nouvelles communautés se sont formées autour de projets de pixel art spécifiques.\n\nDurant cette session, nous tenterons de recréer une expérience r/place beaucoup plus courte et la rendre accessible tout au long de la conférence. En utilisant des outils tels que Spring Boot, Spring WebFlux et Reactor, nous allons pouvoir facilement faire évoluer son API, la faire monter en charge et montrer en direct les mises à jour du tableau.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "1269",
      "email": "simon.basle@gmail.com",
      "lastname": "BASLE",
      "firstname": "Simon",
      "bio": "Simon Baslé (@simonbasle) est membre de l'équipe Spring chez Pivotal, sur le projet Reactor. Développeur passionné, il a auparavant travaillé chez Couchbase (SDK Java réactif et ses intégrations dans l'éco-système Spring) mais aussi en SSII.",
      "company": "Pivotal",
      "twitter": "simonbasle",
      "googleplus": null,
      "github": "simonbasle",
      "language": "English",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://fr.gravatar.com/userimage/42947809/72c8875bbb8cb84856aa8f2e925d68d3.png?size=200"
    },
    "cospeakers": []
  },
  {
    "id": "2482",
    "state": "ACCEPTED",
    "name": "The Team Playbook: A Recipe for Healthy Teams",
    "language": "English",
    "description": "The benefits of a high performing team are endless. They are autonomous, empowered, responsible and effective. At Atlassian, we've pioneered the Team Playbook, which is our way of scaling teams by getting smarter, not bigger, and driving a culture of continual improvement. Utilised by hundreds of teams within Atlassian, we've made our secret sauce not so secret. ",
    "plus":"Don't come to this session for a lesson on theory...come to this session to hear the philosophies and principles of Peter Scobie, Program Manager/Team Doctor. You'll leave this session invigorated, engaged and ready to take action.",
    "eventId": "mix-it",
    "format": 48,
    "trackLabel": "Team",
    "difficulty": 1,
    "speaker": {
      "id": "3272",
      "email": "pscobie@optusnet.com.au",
      "lastname": "Scobie",
      "firstname": "Peter",
      "bio": "As a Program Manager at Atlassian, Peter enables teams to \"Get Stuff Done\" (GSD) to deliver awesome customer experiences. \nWith a background in film and TV Peter moved into digital platform, content and campaign production many years ago and more recently software development and hasn't looked back.",
      "company": "Atlassian",
      "twitter": "@pscobie",
      "googleplus": null,
      "github": null,
      "language": "en",
      "gender": "MALE",
      "social": "https://www.linkedin.com/in/peterscobie/",
      "imageProfilURL": null
    },
    "cospeakers": []
  },
  {
    "id": "2488",
    "state": "ACCEPTED",
    "name": "YES, your site too can (and should) be accessible. Lessons learned from building FT.com",
    "language": "English",
    "description": "In 2016, we at The Financial Times launched a new version of our website to great success. It broke ground on key areas in which we’d set out to excel and measured very closely, like performance, resilience and usability. But one day, and rather serendipitously, we realized we had largely forgotten to measure one thing: accessibility. And you can’t improve what you don’t measure.",
    "plus": "In this talk I will go over how we went from being generally oblivious about accessibility to making it a core part of our process across multiple divisions. I will share the roadblocks we found and the lessons we learned, along with tangible solutions you can integrate them into your own project today, regardless of available time, budget or support.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "3279",
      "email": "laura.carvajal@gmail.com",
      "lastname": "Carvajal",
      "firstname": "Laura",
      "bio": "I've been a Software Engineer for 15 years and am currently a Senior Developer at The Financial Times. I led the accessibility team for FT.com in 2016 and currently work as a full-stack developer for our Internal Products team at FT.",
      "company": "The Financial Times",
      "twitter": "lc512k",
      "googleplus": "-",
      "github": "lc512k",
      "language": null,
      "gender": "FEMALE",
      "social": "-",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/870743843649531904/FEvbCYO2_400x400.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2495",
    "state": "ACCEPTED",
    "name": "Serverless is the new back",
    "language": "Français",
    "description": "Que se cache-t-il derrière les buzz words \"serverless\" et \"services managés\" ?\nEst-il réellement possible de construire une application sans provisionner de serveur ?\n\n",
    "plus": "C'est ce que nous allons vous montrer à travers ce live coding. Nous développerons pas à pas une application à base de Lambda, de NoSQL (DynamoDB) et d'API Gateway pour enfin la déployer dans le cloud AWS.  \n\nSi vous vous demandez comment coder une application robuste, testée, scalable en vous concentrant sur les fonctionnalités et non l'infrastructure, cette conférence est faite pour vous :)",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "3286",
      "email": "gegron@xebia.fr",
      "lastname": "EGRON",
      "firstname": "Gérôme",
      "bio": "Gérôme EGRON, arrivé à Xebia en 2012, est passionné par le Cloud et les problématiques de Continuous Delivery. Développeur backend depuis 6 ans, il travaille actuellement sur les architectures réactives hébergées dans l'environnement AWS.",
      "company": "XEBIA",
      "twitter": "geromeegron",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://lh3.googleusercontent.com/2nukGXVUiiqd5wRXdyzgfD1Q7yeVYj_sRIF8pgnRt8givuGgfaVLT4Th77a409Zwx4vTPjLd1M7wxc4iMAgp1DKHZQiYm_z2nFoAG15-Sa3tcDzxEoVAhNQRNCAxDZ6na33fe8SmRA=w829-h879-no"
    },
    "cospeakers": []
  },
  {
    "id": "2513",
    "state": "ACCEPTED",
    "name": "Retour d'expérience de l'équipe Player à France Télévisions : passer de faire de l'Agile à être Agile",
    "language": "Français",
    "description": "Revivez avec nous la grande aventure Agile de l’équipe Player à France Télévisions !\n\nAu début de notre histoire, on pourrait qualifier l’équipe Player de France Télévisions d’équipe comme les autres, qui pratique un Scrum grossier. On fait un stand-up quotidien, une démo et une rétro toutes les deux semaines, et le backlog est dans JIRA : c’est ça faire de l’Agile, pas vrai ?",
    "plus": "Au fil des chapitres, la transformation va s’opérer jusqu’à devenir un modèle de l’Agilité. L’équipe va adopter le management visuel et un board physique. Elle va même (ô malheur) abandonner JIRA. L’équipe va devenir de plus en plus rigoureuse dans la définition et l’application de ses process. Elle va réussir à réduire son temps de release pour réussir à faire des mises en prod tous les jours. L’équipe va également beaucoup grossir et nécessiter une remise en question profonde de son organisation.\n\nEn résumé : pas de recette magique, mais beaucoup de sources d’inspiration.\n\nIl s’agira d’un vrai retour d’expérience, qui se voudra très divertissant, en mode storytelling et avec beaucoup d’humour.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "3303",
      "email": "jeanpi.lambert@gmail.com",
      "lastname": "Lambert",
      "firstname": "Jean-Pierre",
      "bio": "Avant, j’étais un ingénieur logiciel. Mais peut-être pas le genre que vous imaginez ; les outils et les belles architectures logicielles me laissaient de marbre. Non, mon truc, c’était plutôt la qualité, la valeur produit, les process et les relations humaines.\nDu coup, maintenant, j’aide les équipes en tant que Facilitateur Test et en tant que Scrum Master et Coach Agile. Ce n’est pas plus mal !",
      "company": "Wemanity",
      "twitter": "jpierrelambert",
      "googleplus": "plus.google.com/113634708632655175927",
      "github": "https://github.com/jplambert",
      "language": "fr",
      "gender": "MALE",
      "social": "https://github.com/jplambert, https://www.youtube.com/c/JPLambert, https://www.linkedin.com/in/jp-lambert/",
      "imageProfilURL": "https://avatars1.githubusercontent.com/u/10744293?s=400&v=4"
    },
    "cospeakers": [
      {
        "id": "3309",
        "email": "r.souria+cfp@gmail.com",
        "lastname": null,
        "firstname": null,
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "2515",
    "state": "ACCEPTED",
    "name": "(Re)invent your test strategy",
    "language": "English",
    "description": "Testing is a craft, but it is also and for many foremost a job. A job you do day in day out, evolving with all the rituals every employee develops over time. These rituals, together with all sorts of other external factors (deadlines, pressure, etc.) often means that we don’t have a test strategy or that we are no longer reconsidering the strategies we set out from the start. Having the right strategy in testing is important to stay as efficient and effective as you can be.",
    "plus": "This workshop wants to reignite your strategic fire by placing you in small groups with your fellow testers. Together you will devise a strategy for a real life product which includes methods, tools and planning. However, just like in reality the context will change, and our strategy must change accordingly to aptly react to that change. The workshop will use an interactive visualisation method as a support to spark discussions and for bolstering your strategy.\n\nMore information: http://thatsthebuffettable.blogspot.be/2017/11/riskstorming-maping-risks-with.html",
    "eventId": "mix-it",
    "format": 49,
    "trackLabel": "Team",
    "difficulty": 1,
    "speaker": {
      "id": "1535",
      "email": "Berenvd@gmail.com",
      "lastname": "Van Daele",
      "firstname": "Beren",
      "bio": "I’m a software tester from Belgium who helps shape teams and testers to improve on their work and their understanding of testing. I’m an organizer of BREWT: the Belgian Peer conference & a test meetup in his hometown: Gent. The creative brain behind Test Sphere and speaker at Test Bash Manchester and Eurostar 2016.\nMy dream is to become a test coach for people that nobody believes in anymore or no longer believe in themselves. People that have motivation and will, but no luck. I want to tap into that potential and give them the opportunity to become awesome tester.",
      "company": null,
      "twitter": null,
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": ""
    },
    "cospeakers": [
      {
        "id": "1551",
        "email": "stephane.colson@gmail.com",
        "lastname": "Colson",
        "firstname": "Stéphane",
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      },
      {
        "id": "1599",
        "email": "francois.lenotre@gmail.com",
        "lastname": null,
        "firstname": null,
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "2529",
    "state": "ACCEPTED",
    "name": "State of the BlockChain",
    "language": "Français",
    "description": "Les architectures BlockChain commencent à se développer : de nombreuses startups se servent de ce modèle pour se financer, atteignant parfois des montants records. ",
    "plus": "Après avoir expliqué ce qu’est une architecture BlockChain et ce qu’elle apporte, cette présentation fera un état des lieux de cette technologie émergente. Nous verrons ainsi les applications possibles, et ferons un statut sur celles qui sont en place, ou en cours de mise en place.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Other",
    "difficulty": 1,
    "speaker": {
      "id": "3158",
      "email": "hugo.briand@ekino.com",
      "lastname": "Briand",
      "firstname": "Hugo",
      "bio": "Architecte chez ekino, je travaille principalement pour Canal+ sur des architectures web micro-services et des applications SSR. J'ai pu utiliser de nombreuses technologies, et je m'intéresse désormais aux architectures BlockChain qui peuvent selon moi radicalement changer l'impact de la technologie sur la société.",
      "company": "Ekino",
      "twitter": "https://twitter.com/bsheeptrooper",
      "googleplus": null,
      "github": "https://github.com/Bladrak",
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/740844903526195201/sdYlsCXo_400x400.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2548",
    "state": "ACCEPTED",
    "name": "De Javascript à Haskell : la programmation fonctionnelle expliquée simplement",
    "language": "Français",
    "description": "Si un de vos collègue vous a déjà dit «Alors là, j'ai utilisé de l'application partielle sur cette fonction que j'ai curryfié en utilisant des fonctions d'ordre supérieur et des closures» et que vous n'avez rien compris, alors ce talk est pour vous.\nLa programmation fonctionnelle présente de nombreux concepts qui viennent des maths. Et cela fait peur ! Mais appliqué à l'informatique, c'est en réalité très simple !",
    "plus": "Durant ce live-coding consistant à refactorer un code impératif vers un code fonctionnel, les concepts principaux seront introduits uniquement quand cela est utile et expliqués en profondeur.\nÀ la fin de ce talk, les concepts suivants n'auront plus de secrets pour vous :\n- La transparence référentielle\n- Les fonctions comme citoyennes de première classe\n- Les fonctions d'ordre supérieur\n- Les closures\n- Le lambda calcul\n- La curryfication\n- L'application partielle\n- La composition de fonction\n- La notation «Point-free»",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "1915",
      "email": "xavier.detant@gmail.com",
      "lastname": "Detant",
      "firstname": "Xavier",
      "bio": "Co-organisateur de la communauté software craftsmanship de Paris et de la non-conférence SoCraTes France, le partage de savoir est au cœur de mon état d'esprit.",
      "company": "Zenika",
      "twitter": "@XDetant",
      "googleplus": null,
      "github": "https://github.com/FaustXVI/",
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/AAEAAQAAAAAAAAA1AAAAJGE5YjY4OTk2LTUwZWMtNDYxZC1iMTIyLWIyY2UyODg5YjU1Mg.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2549",
    "state": "ACCEPTED",
    "name": "Des Portes Logiques Pneumatiques en Bois",
    "language": "Français",
    "description": "Et si on parlait un peu d'orgue de barbarie, d'algèbre de Boole, d'additions et de bulles de savon ? Juste pour le plaisir ? Peut être qu'on gonflera des ballons pour compter sur les doigts.",
    "eventId": "mix-it",
    "format": 48,
    "trackLabel": "Alien",
    "difficulty": 1,
    "speaker": {
      "id": "2357",
      "email": "treguy@free.fr",
      "lastname": "Tregan",
      "firstname": "Fabien",
      "bio": "After spending 10+ years of my life coding, I started to feel that the problems in software development were not in the code and tryed finding solution elsewhere. Since I started doing that, I started to love coding again :)",
      "company": "freelance",
      "twitter": "ftregan",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": null
    },
    "cospeakers": []
  },
  {
    "id": "2552",
    "state": "ACCEPTED",
    "name": "Développer un jeu vidéo (quand on n’y connait rien en développement de jeux vidéo)",
    "language": "Français",
    "description": "Comment on développe un jeu vidéo ? Est-ce compliqué d’afficher un personnage sur l’écran et de le faire bouger par la suite ? Programmer un jeu est-il comparable à programmer un application backend ? Quels sont les outils à utiliser ? Comment rendre un jeu amusant ? J’ai dû me poser ces questions pour réaliser mon premier jeu mobile. ",
    "plus": "Ce quickie essayera d’y répondre et fera un retour sur les différentes expérimentations réalisées avant d’obtenir un jeu.",
    "eventId": "mix-it",
    "format": 48,
    "trackLabel": "Education",
    "difficulty": 1,
    "speaker": {
      "id": "2841",
      "email": "david.wursteisen@soat.fr",
      "lastname": "Wursteisen",
      "firstname": "David",
      "bio": "David intervient chez différents clients au domaine fonctionnel varié, pour les aider à réaliser leurs projets.\nPour lui le développement logiciel n’est pas qu’une affaire de technique.\nSon rôle est d’aider ses clients à prendre en compte d’autres aspects, pour que leurs développements informatiques ne soient plus un frein à leur activité mais un atout.",
      "company": "SOAT",
      "twitter": "dwursteisen",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "MALE",
      "social": "https://www.youtube.com/watch?v=fwbWAfBLcDI, https://www.youtube.com/watch?v=4X337M8kU8Q, www.journaldunet.com/developpeur/expert/67258/kotlin--le-renouveau-de-java.shtml",
      "imageProfilURL": "https://lh6.googleusercontent.com/-ik6pQvfCBVY/AAAAAAAAAAI/AAAAAAAAAL8/-Sfv4sKFObE/photo.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2555",
    "state": "ACCEPTED",
    "name": "Augment your reality with ARCore !",
    "language": "English",
    "description": "2017 marked a big step for augmented reality. First, Apple announced at the Worldwide Developers Conference the availability of its ARKit framework to allow developers to integrate augmented reality into their applications. Then Google has responded with Arcore, this giant who was present on this field since 2014 with the Tango project.\n\nDuring this talk, we will present ARCore as a framework, then its advantages over ARKit. Then we'll see how you can start right now to create your own augmented experience via an exciting live coding. This talk will allow you to anticipate the next trends and be to be prepared to the future of apps.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "3320",
      "email": "benrabah.wajdi@gmail.com",
      "lastname": "Ben Rabah",
      "firstname": "Wajdi",
      "bio": "2017 marked a big step for augmented reality. First, Apple announced at the Worldwide Developers Conference the availability of its ARKit framework to allow developers to integrate augmented reality into their applications. Then Google has responded with Arcore, this giant who was present on this field since 2014 with the Tango project.",
      "plus": "During this talk, we will present ARCore as a framework, then its advantages over ARKit. Then we'll see how you can start right now to create your own augmented experience via an exciting live coding. This talk will allow you to anticipate the next trends and be to be prepared to the future of apps.",
      "company": "SFEIR",
      "twitter": "https://twitter.com/WajdiBenRabah",
      "googleplus": "https://plus.google.com/+WajdiBenRabah",
      "github": "https://github.com/wajdibr",
      "language": "en",
      "gender": "MALE",
      "social": "www.wajdibr.com, https://www.linkedin.com/in/wajdibenrabah/",
      "imageProfilURL": "http://wajdibr.com/assets/images/profile-pics.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2576",
    "state": "ACCEPTED",
    "name": "Vue.js, le framework progressif",
    "language": "Français",
    "description": "Vue est un projet 100% communautaire et open-source. C'est le challenger qui est là pour secouer le monde des librairies front-end, de par sa simplicité et sa puissance ! L'écosystème autour de Vue grandi de jour en jour, les retours sont très positifs et de très grandes entreprises l'ont choisi comme Adobe, Alibaba, Microsoft, Sainsbury's, Nintendo et même Facebook! Vue est également inclut par défaut avec le framework PHP Laravel.\n// wip",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "2681",
      "email": "guillaume.b.chau@gmail.com",
      "lastname": "Chau",
      "firstname": "Guillaume",
      "bio": "Membre de la Core Team de Vue.js, Guillaume est le créateur d'intégrations avec Meteor ([vue-meteor](https://github.com/Akryum/vue-meteor/)) et Apollo GraphQL ([vue-apollo](https://github.com/Akryum/vue-apollo)) afin d'aider les développeurs à créer des applications Vue avec une forte intéractivité et du temps-réel. Il a également créé l'application vue-curated permettant de trouver les bonnes librairies pour développer une application, et il contribue à l'écosystème avec des outils comme [vue-virtual-scroller](https://github.com/Akryum/vue-virtual-scroller) et [vue-supply](https://github.com/Akryum/vue-supply).",
      "company": null,
      "twitter": "@Akryum",
      "googleplus": null,
      "github": "Akryum",
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://conf.vuejs.org/img/guillaume.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2607",
    "state": "ACCEPTED",
    "name": "15 Years of Spring",
    "language": "English",
    "description": "The Spring Framework originated from a book in 2002, becoming the most widely used application framework in the entire Java ecosystem within a few years... and holding that position to this day. This talk illustrates Spring's evolution over 15 years, adapting not only to five new JDK generations but also to ever-changing requirements in modern enterprise architectures.",
    "eventId": "mix-it",
    "format": 50,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "3379",
      "email": "jhoeller@pivotal.io",
      "lastname": "Hoeller",
      "firstname": "Juergen",
      "bio": "Juergen Hoeller is co-founder of the Spring Framework open source project and has been serving as the project lead and release manager for the core framework since 2003. Juergen is an experienced software architect and consultant with outstanding expertise in code organization, transaction management and enterprise messaging.",
      "company": "Pivotal",
      "twitter": "@springjuergen",
      "googleplus": null,
      "github": "jhoeller",
      "language": "en",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://d1ophd2rlqbanb.cloudfront.net/2017/speakers/chromo/hoeller.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2613",
    "state": "ACCEPTED",
    "name": "Plan de vol : Ground Control to Major Tom",
    "language": "Français",
    "description": "Qu’est-ce que tu voudras faire quand tu seras grand ? La société nous met la pression pour des plans de vol tout tracés. On oublie parfois de prendre un peu de recul et on se retrouve alors en plein vol à se demander si on ne s’est pas planté de destination. \n\nNous allons parler, entre autres, de titres de cartes de visites et de rôles réels, de gestion de carrière et d’objectifs personnels, mais aussi d’apprentissage et de formation, de bien-être, de plaisir, de contrôle et de lâcher-prise.",
    "plus": "Avec Sarah nous avons eu des trajets différents. Nous essayerons de vous donner l’éclairage que nous aurions bien aimé avoir nous-même il y a quelques années, pour vous permettre de faire vos propres choix et pour mieux comprendre ce que font les autres, sans jugement de valeur.",
    "eventId": "mix-it",
    "format": 49,
    "trackLabel": "Team",
    "difficulty": 1,
    "speaker": {
      "id": "1771",
      "email": "sarahhaim@gmail.com",
      "lastname": "Haïm-Lubczanski",
      "firstname": "Sarah",
      "bio": "Technical Writer chez eZ Systems, j’ai toujours préféré le contact des informaticiens spécialistes à celui du grand public, et cela a fonctionné jusqu’à présent puisque j’écris de la documentation du logiciel opensource, que produit mon entreprise.\nFondatrice de l’antenne AFUP Lyon, co-fondatrice de la Game Dev Party et co-organisatrice du premier Coding Goûter lyonnais, je suis engagée dans le tissu associatif local technologique. J’apprécie d’être à l’initiative de projets qui aident les autres.",
      "company": "eZ Systems",
      "twitter": "twitter.com/mereteresa",
      "googleplus": "https://plus.google.com/u/0/+SarahHaimLubczanski",
      "github": "https://github.com/mere-teresa",
      "language": "fr",
      "gender": "FEMALE",
      "social": "",
      "imageProfilURL": "https://en.gravatar.com/userimage/1707942/be5787c3dff1d2c0a0e6e1a2f474fd3a.jpeg"
    },
    "cospeakers": [
      {
        "id": "2910",
        "email": "eric.daspet@survol.fr",
        "lastname": "Daspet",
        "firstname": "Éric",
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "2615",
    "state": "ACCEPTED",
    "name": "Punishment and Humiliation",
    "language": "English",
    "description": "What does punishment and humiliation look like in a professional context? Is it ever justified? Why do we use punishment as parents, as a society or as leaders? And most importantly, does it work? Or rather, does it work the way we expect?",
    "plus": "In this interactive session we will explore what these behaviours look like in a professional context, and get to grips with the difficult question of why we do it and do we need it? And while we're at it, do we need to blame at all?\n\nThis will be a deep journey discussing, for many, challenging topics, expect to be disrupted!",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Team",
    "difficulty": 1,
    "speaker": {
      "id": "1440",
      "email": "john@wisenoodles.com",
      "lastname": "John Le Drew",
      "firstname": "John",
      "bio": "John has spent most of the last 2 decades working in the software industry, with a focus on web technologies. After 10 years as a software engineer John moved into consultancy where he quickly learned the value of team dynamics and how most technical challenges are projecting underlying issues with collaboration. So his focus shifted, while still being very involved technically, his first focus is on facilitating a safe, creative, collaborative environment.",
      "company": "Wise Noodles",
      "twitter": "antz29",
      "googleplus": null,
      "github": "",
      "language": "en",
      "gender": "MALE",
      "social": "https://uk.linkedin.com/in/antz29, http://twitter.com/antz29, www.agilepath.fm, www.wisenoodle.me",
      "imageProfilURL": "https://s.gravatar.com/avatar/8a168b90e1318b876b116a06f6b36302?s=2000"
    },
    "cospeakers": []
  },
  {
    "id": "2658",
    "state": "ACCEPTED",
    "name": "If you can draw the problem, you can solve it: Systems Thinking made practical",
    "language": "English",
    "description": "When we try to solve complex organisational problems, we’re often like the six blind men describing an elephant: We focus only on the parts, convinced that we alone know the truth. We fail to see holistically how the parts interconnect to make up the whole. \n\n\n\nOur systems thinking workshop gives you the tools to approach complex problems as systems, even if these complex problems are “soft problems” (such as fixing an unsafe organisational culture, undergoing an agile transformation or implementing a DevOps mindset). ",
    "plus": "We will take you through you some Systems Thinking theory to be able get your hands dirty on modelling a case problem and conclude by approaching some of the problems you deal with in your daily practice. \n\nThis Workshop is suitable for people working in management positions, agile coaches and scrum masters and will be facilitated by Emile Silvis and Roland Flemm.",
    "eventId": "mix-it",
    "format": 49,
    "trackLabel": "Other",
    "difficulty": 2,
    "speaker": {
      "id": "3343",
      "email": "roland.flemm@gmail.com",
      "lastname": "flemm",
      "firstname": "roland",
      "bio": "My technical background in development and infrastructure spans a period of more than 20 years, but more relevant are the 8 years I am working as a Scrum Master and Agile Coach. I worked on numerous projects in various international companies, mainly in the banking industry. \nCurrently, I work at Backbase Amsterdam with 40 colleagues in the R&D department.\nI love playing guitar, Prince, and electronic music.\n\nhttps://nl.linkedin.com/in/rolandflemm",
      "company": "d.c.m.e.",
      "twitter": "@roland_flemm",
      "googleplus": null,
      "github": null,
      "language": "en",
      "gender": "MALE",
      "social": "www.dcme.nu",
      "imageProfilURL": "https://www.google.nl/url?sa=i&rct=j&q=&esrc=s&source=images&cd=&cad=rja&uact=8&ved=0ahUKEwieoLKPr-HXAhXCalAKHUgmBYAQjRwIBw&url=https%3A%2F%2Fnl.linkedin.com%2Fin%2Frolandflemm&psig=AOvVaw2FAbMA8e1Ik6yHMxF9jSlY&ust=1511961829420035"
    },
    "cospeakers": [
      {
        "id": "3393",
        "email": "emile@silvis.co.za",
        "lastname": "Emile",
        "firstname": "Silvis",
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "2676",
    "state": "ACCEPTED",
    "name": "Propulsez votre application Angular avec GraphQL et Apollo",
    "language": "Français",
    "description": "GraphQL est une spécification et un langage de requêtage possédant de nombreuses implémentations côté serveur mais aussi côté client.\n\nNous allons propulser notre application grâce à l’implémentation client fournie par Apollo. Les performances vont être améliorées grâce à un système de cache, mais aussi l'expérience utilisateur avec le pattern optimistic UI.\n\nA partir d’une application Angular, nous exploiterons les données d’une API GraphQL à l’aide d’Apollo. Profitons des avantages de GraphQL mais pas que!",
    "eventId": "mix-it",
    "format": 49,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "2275",
      "email": "thomas.betous@zenika.com",
      "lastname": "Thomas",
      "firstname": "Betous",
      "bio": "Consultant et développeur full-stack chez Zenika à Nantes, je réalise des projets webs pour nos différents clients. Passionné, j'ai toujours préféré des langages tournant autour de JVM. Depuis l'apparition d'Angular je m’intéresse de plus en plus aux frameworks front.",
      "company": "Zenika",
      "twitter": "@tbetous",
      "googleplus": null,
      "github": "tbetous",
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://media.licdn.com/mpr/mpr/shrinknp_200_200/AAEAAQAAAAAAAAykAAAAJDAzYzQ4NTAyLTAxZDctNGExMS05MmFjLTQ0MmZmYWZiYWZiMA.jpg"
    },
    "cospeakers": [
      {
        "id": "771",
        "email": "antoine.cellier@zenika.com",
        "lastname": "CELLIER",
        "firstname": "Antoine",
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "2689",
    "state": "ACCEPTED",
    "name": "Comment le gouvernement de Nouvelle Zélande s'inspire d'Agile pour améliorer les conditions de vie dans les banlieues",
    "language": "Français",
    "description": "En Nouvelle Zélande, le permis de conduire est le premier pas pour trouver du travail et particper à la société. Pour certaines personnes il est difficile de le passer. Pourtant, sans un permis, il leur est complexe de se déplacer et de trouver un emploi. Sans locomotion, obtenir une photo d'identité devient un cauchemare, les aliénant de nombreux services. Seule solution : ils risquent leur vie et celle des autres sur la route. Ils s'exposent à des amendes qu'ils ne pourront pas rembourser.",
    "plus": "Les barrières à l'obtention d'un permis de conduire ont de nombreuses origines, qui dépendent de différentes agences gourvernementales. Coordoner ces agences sur des sujets à faible visibilité électoral est complexe, quelque soit le pays. Pourtant, de nombreux sujets fondamentaux dépendent de cette coordination, tels que la prévention de la violence conjugale, l'intégration des jeunes dans le monde du travail ou encore l'éducation des enfants en bas age.\n\nEn 2015, le Department of Internal Affairs lance une initiative visant à coordoner des actions sur ces domaines. Il forme le Co-Design Lab, qui a pour mission de coordoner les efforts sur ces problèmatiques. Cette structure engage des équipes pluridisciplinaires sur une approche inspirée de l'Agile, du Lean Startup, et du Design Thinking. \n\nJ'ai eu la chance de coacher pour le lab. Je vous propose une vision de l'interrieur d'une initiative gouvernementale pas comme les autres...\n\nhttps://www.aucklandco-lab.nz/",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Alien",
    "difficulty": 1,
    "speaker": {
      "id": "3194",
      "email": "scher.jonathan@gmail.com",
      "lastname": "Scher",
      "firstname": "Jonathan",
      "bio": "L'avancée du Digital amène les entreprise à se réinventer. De nouveaux mode d'organisation émergent. Ayant travaillé dans de nombreux contextes, avec différentes façon de faire, je les aide à se transformer.",
      "company": "Ippon",
      "twitter": "jonathan_scher",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/7/005/039/0a6/3782c4e.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2712",
    "state": "ACCEPTED",
    "name": "La sécurité dans l'IoT : difficultés, failles et contre-mesures",
    "language": "Français",
    "description": "Avec la multiplication des objets connectés dans notre quotidien, la sécurité de ces appareils électroniques, qui a été souvent négligée par le passé, devient une réelle problématique. Leur faible coût de conception, la négligence des fabricants ou même la notre, nous développeurs, en font des proies faciles pour les hackers. Ce phénomène se constate bien dans l'actualité, où l'on parle de plus en plus d'attaques à grande échelles visant des cameras ou frigos connectés, mais également les serrures Bluetooth.",
    "plus": "Au cours de ce talk nous verrons en détails le principe des dernières attaques qui ont fait la une. Nous parlerons ensuite des failles touchant les IoTs les plus courantes (le top 10 OWASP IoT), les solutions et contre-mesures.\n\nNous parlerons notamment des attaques par canaux auxiliaires pour lesquelles peux de solutions existent et qui donnent toujours du fil à retorde aux chercheurs.\n\nEnfin, nous terminerons par une petite démo d’attaque de type Man-in-the-midle (MiTM) sur un objet Bluetooth",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "577",
      "email": "alexisd@rtone.fr",
      "lastname": "DUQUE",
      "firstname": "Alexis",
      "bio": "Je suis ingénieur software, du micro-contrôleur aux applications web Java, en passant par le dev mobile, dans le domaine des objets connectés .\nJe partage mon temps entre les projets d'Rtone, un bureau d'étude spécialisé dans l'IoT en région lyonnaise, et mes travaux de recherche au laboratoire CITI de l'INSA de Lyon où je poursuis une thèse sur le Visible Light Communication, dans le cadre d'un contrat CIFRE.",
      "company": "Rtone",
      "twitter": "alexis0duque",
      "googleplus": null,
      "github": "alexisduque",
      "language": "fr",
      "gender": "MALE",
      "social": "alexisduque.me, https://www.linkedin.com/in/alexisduque/, https://medium.com/@alexisduque",
      "imageProfilURL": "http://www.gravatar.com/avatar/83124b745752d1a1b0ca2eee1af0bd48?s=240"
    },
    "cospeakers": []
  },
  {
    "id": "2742",
    "state": "ACCEPTED",
    "name": "Faisons de la magie grâce à Houdini CSS",
    "language": "Français",
    "description": "La dernière spec de layout CSS vient tout juste de sortir et elle correspond exactement à votre besoin et va permettre de simplifier énormément votre travail quotidien. Seul hic, vous devez supporter tous ces navigateurs qui n’ont pas encore implémentés cette feature !\n\nComment faire ? Un polyfill javascript ? Ca risque de plomber un peu les performances de votre projet. Ah si seulement de vrais polyfills css existaient ! \n\nEt bien c’est un peu la version TL;DR; de Houdini CSS. Venez à ce talk pour voir ce que l’avenir du CSS nous réserve et comment cette spec va nous changer la vie !",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "175",
      "email": "jean.francois.garreau@gmail.com",
      "lastname": "Garreau",
      "firstname": "Jean-francois",
      "bio": "GDE Web Technology, je travaille pour Lucca en tant que responsable des composants des produits.\n\nEn dehors du travail, je suis co-fondateur du GDG Nantes, organisateur du DevFest Nantes, co-créateur des Nantes Wit et organisateur de Devoxx4Kids\n\nRetrouvez l'ensemble de mes contributions sur https://github.com/jefBinomed",
      "company": "Lucca / GDG Nantes",
      "twitter": "jefBinomed",
      "googleplus": null,
      "github": "jefBinomed",
      "language": "fr",
      "gender": "MALE",
      "social": "https://jef.binomed.fr",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/821731886431174657/YamrWrOR_400x400.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2743",
    "state": "ACCEPTED",
    "name": "Reconstrained Design",
    "language": "English",
    "description": "Design practice always happens under a particular set of forces, commonly known as constraints. These constraints may be straightforward and indisputable, such as a physical or material quality: the force of gravity, the tensile strength of a structural beam, or a financial budget, and provide tangible limits to be adhered to or challenged.\nConstraints, however, also exist in more abstract, systemic or hidden forms. ",
    "plus": "These can have a significant impact on the potential of design, resulting in a paucity of original thinking and a chronic neglect of responsibility. For example, national systems of infrastructure, such as energy grids or roads, have become so normalised that they constrain designers to simply designing for or within the dominant paradigm. The constraint of positivity or progress dogma, blinds those influencing the future (scientists, technologists, politicians, designers, etc.) from the potential negative implications of their proposals.\nThis presentation will firstly explore some of the more dominant oblique constraints and the ways in which they negatively influence the role and purpose of design. And secondly describe how design, practiced outside of these constraints, can facilitate more inclusive, holistic, and environmentally responsible futures.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Design",
    "difficulty": 3,
    "speaker": {
      "id": "3441",
      "email": "augerment@gmail.com",
      "lastname": "Auger",
      "firstname": "James",
      "bio": "James Auger is an associate professor at Madeira Interactive Technologies Institute (M-ITI) in Portugal.  His current research explores the potential of the Island as an experimental living laboratory through a combination of fictional, factual and functional multi-scale energy-related proposals and projects. This work was recently awarded the Cultural Innovation International Prize by the Centre of Contemporary Culture of Barcelona (CCCB).\n\nAfter studying Design Products (MA) at the Royal College of Art James moved to Dublin to conduct research at Media Lab Europe (MLE) exploring the theme of human communication as mediated by technology. After MLE he worked in Tokyo as guest designer at the Issey Miyake Design Studio developing new concepts for mobile telephones. Between 2005 and 2015 James was part of the critically acclaimed Design Interactions department at the RCA, teaching on the MA programme and continuing his development of critical and speculative approaches to design and technology, completing his PhD on the subject in 2012. \n\nRunning parallel to his academic work James is partner in the speculative design practice Auger-Loizeau, a collaboration founded in 2000. Auger-Loizeau projects have been published and exhibited internationally, including MoMA, New York; 21_21, Tokyo; The Science Museum, London; The National Museum of China, Beijing and Ars Electronica, Linz. Their work is in the permanent collection at MoMA.",
      "company": null,
      "twitter": "@crapfutures",
      "googleplus": null,
      "github": null,
      "language": "en",
      "gender": "MALE",
      "social": "http://crapfutures.tumblr.com, www.auger-loizeau.com",
      "imageProfilURL": "https://www.dropbox.com/s/pe2jny52mv9fjxo/augerco.jpg?dl=0"
    },
    "cospeakers": []
  },
  {
    "id": "2764",
    "state": "ACCEPTED",
    "name": "La technologie à l'attaque du chômage : retour d'expérience sur l'aventure Bob Emploi",
    "language": "Français",
    "description": "En novembre 2016, la startup à but non-lucratif Bayes Impact lançait Bob Emploi, une application en ligne pour aider les chercheurs d'emploi. Depuis Bob Emploi a accompagné plus de 150 000 personnes.\nComme toute aventure startup, ce projet a connu beaucoup de rebondissements. Florian va partager les étapes par lesquelles l'équipe et le produit sont passés !",
    "eventId": "mix-it",
    "format": 50,
    "trackLabel": "Product",
    "difficulty": 1,
    "speaker": {
      "id": "3457",
      "email": "florian@bayesimpact.org",
      "lastname": "Jourda",
      "firstname": "Florian",
      "bio": "Florian a été le premier ingénieur chez Box à Palo Alto, qu'il a vu grandir de 7 à 1300 employés et rentrer en bourse.\nIl est maintenant product manager chez Bayes Impact, une startup à but non-lucratif qui utilise la technologie et la data science pour s'attaquer aux problèmes de société. Depuis un an, il développe l'application Bob Emploi qui permet d'autonomiser et de booster les chercheurs d'emploi.",
      "company": "Bayes Impact",
      "twitter": "florianjourda",
      "googleplus": null,
      "github": "florianjourda",
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://www.bayesimpact.org/images/team/florianjourda.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2765",
    "state": "ACCEPTED",
    "name": "Développez votre application multiplateforme en kotlin",
    "language": "Français",
    "description": "Avec Kotlin 1.2, on peut coder un module qui sera déployé indifféremment dans la JVM, sur Android et dans un moteur javascript. \n\nQuelles sont les particularités, les avantages et les limitations de ces développements multiplateforme? Quels sont les cas d’utilisation ? Comment simplifier les développements par la mise en œuvre de vos propres DSL?",
    "plus": "Cette session présentera un retour d’expérience sur le développement de notre librairie multiplateforme de datavisualisation. Nous verrons des exemples de code, les outils à utiliser, et des chiffres précis sur l’efficacité de ces développements.\n\nNous aborderons également le futur de kotlin multiplateforme avec l’arrivée de Kotlin-native permettant de développer pour iOs en Kotlin.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "1324",
      "email": "g.zoritchak@gmail.com",
      "lastname": "Zoritchak",
      "firstname": "Gaetan",
      "bio": "J'utilise Kotlin depuis plusieurs années. Après l'avoir déployé en production sur du backend, j'ai démarré un nouveau projet en 2017: data2viz.io.  Le but est de créer une librairie multiplateforme en kotlin de datavisualisation.",
      "company": "Data2Viz",
      "twitter": "gz_k",
      "googleplus": "Gaetan Zoritchak",
      "github": "gzoritchak",
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/713140036271779840/QwvQiTaN_400x400.jpg"
    },
    "cospeakers": [
      {
        "id": "3458",
        "email": "pmariac@gmail.com",
        "lastname": "Mariac",
        "firstname": "Pierre",
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "2838",
    "state": "ACCEPTED",
    "name": "Epic Legacy Code Challenge",
    "language": "Français",
    "description": "Vous venez d'être embauchés chez Paladin Inventories Company. Elle gagne beaucoup d'argent avec son logiciel. Mais le gobelin qui l'a écrit s'est fait dévorer par un dragon. Vous ne comprenez rien au code. Et bien sûr il n'y a pas de tests. Le problème : une horde de trolls se rue vers vous avec plein de nouvelles demandes pour ce logiciel, qui est maintenant le vôtre...\n\nCette situation vous dit quelquechose ?",
    "plus": "Et si on se mettait dans cette situation, en équipes et en compétition ? Qui sera alors l'équipe la plus à même de faire évoluer le code legacy, tout en continuant à gagner de l'argent ?\n\nVenez relever le challenge, avec votre env de dev favori !",
    "eventId": "mix-it",
    "format": 49,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "13",
      "email": "julien.jakubowski@gmail.com",
      "lastname": "Jakubowski",
      "firstname": "Julien",
      "bio": "Je suis consultant-codeur chez OCTO Technology dans la tribu \"software craftsmanship\". \n\nMon kiff : aider des équipes à livrer du logiciel de qualité élevée, avec efficacité et fun. \n\nJe suis co-auteur du livre \"Culture Code\" sur la qualité logicielle : http://www.octo.com/fr/publications/20-culture-code.\n\nSpeaker à différents JUGs et à Devoxx France, je suis également l'un des fondateurs et leaders du Ch'ti JUG, et j'organise l'Agile Tour Lille depuis 2009.",
      "company": "OCTO Technology",
      "twitter": "jak78",
      "googleplus": null,
      "github": null,
      "language": "Français",
      "gender": "MALE",
      "social": "http://blog.octo.com/, http://www.octo.com/fr/publications/20-culture-code",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/378800000088121039/b4e73262ceb62ea0c3721ce37cccaed7_400x400.jpeg"
    },
    "cospeakers": [
      {
        "id": "3507",
        "email": "cdesquilbet@octo.com",
        "lastname": null,
        "firstname": null,
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "2839",
    "state": "ACCEPTED",
    "name": "Docker, Kubernetes et Istio, c'est utile pour mon monolithe?",
    "language": "Français",
    "description": "Pour développer et mettre en production une architecture à base de micro-services, Docker, Kubernetes et Istio s'imposent. Docker nous donne l'isolation des services, Kubernetes permet de les distribuer sur un cluster et Istio apporte de l'intelligence au réseau.\n\nMais voilà, comme 80% des développeurs, c'est une application monolithique et paléolithique que je dois moderniser. Comment puis-je tirer tous les bénéfices de ces outils ? Puis-je le faire sans toucher une ligne de code de mon application ?\n\nSimplification des montées de version, Déploiement sur le Cloud, Sécurisation des flux, Terminaison SSL, Blue/Green deployments, A/B Testing, Monitoring des Apis... Autant de cas concrets que l'on mettra en oeuvre sans toucher au monolithe !!",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "3511",
      "email": "david@gageot.net",
      "lastname": "Gageot",
      "firstname": "David",
      "bio": "I'm a Developer Advocate for the Google Cloud Platform. I'm a developer with infinite passion for anything related to code: Web, Back, Ops, low-level, UX it all matters.",
      "company": "Google",
      "twitter": "dgageot",
      "googleplus": null,
      "github": "dgageot",
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "http://gravatar.com/avatar/f0887bf6175ba40dca795eb37883a8cf?s=500"
    },
    "cospeakers": []
  },
  {
    "id": "2840",
    "state": "ACCEPTED",
    "name": "eXtreme volunteering: Applying XP practices in volunteering team",
    "language": "English",
    "description": "In 2017 I was given an opportunity to lead at region level team of 18 volunteers of the established country level volunteering project in Poland. The goal of the project is to help families in need rebuild their self esteem and motivation to work for better future by giving one time gift supporting their actual needs. The role of a region is to build a team, find families in need, asses their needs and keep in touch with donors.\n\nAs a software engineer and a team lead I drew heavily from my day-to-day work practices. I found it fascinating how agile practices had to be adapted to a new situation. Some of them didn’t catch up at all. Others were already part of standard training and requirements from the parent organisation. Some appeared to be novelty that our team quickly adopted. Constant comparison of my work day with volunteering work gave me different perspective on how I work day-to-day. And that’s what I would like to share with you.\n\nIn this talk you will learn how corporate can get a volunteering project and what process it follows. I will compare and contrast it with extreme programming practices. I have some stories to share that I hope will be useful not only to those who treat their team like volunteers.",
    "eventId": "mix-it",
    "format": 48,
    "trackLabel": "Team",
    "difficulty": 2,
    "speaker": {
      "id": "3513",
      "email": "marcin.bazydlo@gmail.com",
      "lastname": "Bazydlo",
      "firstname": "Marcin",
      "bio": "Dreamer. Hacker. Programmer. I worked as a researcher of REST applications \nreplication systems (authored couple of papers which will never be cited). Then I \ndecided that agile is much more interesting and moved to business. Now I enjoy new \nchallenges working for Guestline. I am enthusiast of stuff that works, \nand brilliant solutions.",
      "company": "Guesline",
      "twitter": "mbazydlo",
      "googleplus": null,
      "github": null,
      "language": "en",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://drive.google.com/file/d/0B4CZuzlLI837V2UyakVwaWZXVWM/view?usp=sharing"
    },
    "cospeakers": []
  },
  {
    "id": "2846",
    "state": "ACCEPTED",
    "name": "The dark ages of IoT",
    "language": "English",
    "description": "Advertisements suggest that we are at the zenith of mankind's scientific knowledge and technological power,\nbut when it comes to IoT and the so-called 'Smart Home', we are clearly not. \nIn fact, we are in the middle of the dark age.\n\nI'll explain the challenges that we're facing today (from an implementors perspective), \nwhat's 'wrong' with our current products & show you how a smart 'Smart Home' experience could look like in the near future.",
    "plus": "Details\n-------\nIf people buy \"Smart Home\" systems today, disappointment isn't far off. In fact, I haven't met a single person\nwho is satisfied with their Smart Home installations & gadgets.\nMost of the time it is because they aren't smart at all. The interaction with the user is terrible,\nthe systems are flawed & pulling out your smartphone to adjust turn on your living room lights feels more like a step back.\n\nYet, there are reasons why vendors weren't been able to solve the problems of this fairly young technologies.\nAnd it´s not because vendors don't see the needs of the users (mostly).\nI´ll explain (with code, examples & hardware demos), where we are today, what problems are still waiting to be solved\nand how modern (so-called) artificial intelligence (don't like that term) used to solve the biggest problem of all:\nThe human <-> computer interface.\n\nNote: Code examples will be in JavaScript (NodeJS)\n\nPitch (Anything else you want us to know about you or your talk?)\n-----------------------------------------------------------------\nI´ve been working in the field of IoT (to be precise in the field of Smart Home systems - see *1) for over 6 years now.\nThe landscape changed a lot in those 6 years, but a lot of problems we encountered early on haven't been solved until today.\nNot from us. Not from other vendors. And there are reasons why they still persist, so I´ll explain those problems (mostly user interaction, \na few technical difficulties as well), and how we´re (as in all implementors, not only the company I´m working for)\ntrying to solve them with upcoming technologies.\n\nNote: This will not be a product pitch of any sort, I´ll only use Open Source technologies to explain the system & will mention\nthe product I´m working on max. 1 or 2 times to illustrate problems device vendors have to solve.\n\nWhat will the audience learn from it\n------------------------------------\n- The problems implementors face today when building smart home systems\n- About the protocol madness & technical details of the most used smart home protocols (Plus learn how to implement/use them)\n- How the industry fails to provide UIs that enable users (and why)\n- Basic understanding of the data flow & building blocks of Smart Home systems\n- How AI (Cognitive Services) can enhance the Smart Home experience (in fact, just really enable it)\n- How those systems can not only be technical toys but of real help (f.e. for people suffering from depression)\n- How interaction with those systems will get more natural & what we can expect of it in the near future\n\nOutline\n-------\n- The history of Seattle a perfect analogy for the evolution of Smart Home technologies so far\n- The gap between technical innovation & innovation of User Interfaces (based on studies about Europes most popular home automation systems)\n- What do we as developers think when we hear IoT? (Hint, hardware, devices, microcontrollers...)\n- What do we forget about? (Hint: Our users, the human beings who need to interact with the systems we build)\n- WTP (What the protocol) An overview of the most used smart home protocols & their key entities\n- Demo (+ Code): Use an Enocean based light switch to control an Arduino\n- Explanation of the complexity of a \"modern\" lightswitch (Which is not smart & not even automated)\n- What could an automated (still not smart) home look like (Example of a geofence, lightswitch scenario)\n- Quick overview of one of the crucial Automated Home parts, the rule engine\n- It all is still pretty technical & abstract\n- Modern UIs converse with the user in a way it´s \"normal\" for them (f.e. Chatbots)\n- What could a smart home look like\n- Use AI (Cognitive services) to enhance the UI, by normalizing the interaction with the user\n- What separates humans and computers most? Emotions!\n- Demo (+Code): How can we teach a computer to \"calculate\" our emotions\n- What´s this good for? Example: People who suffer from depression can benefit from surroundings that adapt to their state of mind\n- Summary: Technology should blend into the background & enable the user. Interaction needs to get more natural.\n\nWho is this presentation for?\n-----------------------------\nFor everyone who wants to... \n\n...understand why the current state of Smart Home systems is\nso displeasing.\n\n...know what problems implementors face.\n\n...how the future of those systems could look like & which technologies\nit´ll be driven by.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Maker",
    "difficulty": 1,
    "speaker": {
      "id": "3524",
      "email": "public@asciidisco.com",
      "lastname": "Golasch",
      "firstname": "Sebastian",
      "bio": "Sebastian works as a “Specialist Senior Manager Software Developer” at Deutsche Telekom, after some time developing backend applications with Java and PHP he became a citizen of the JavaScript world. Recently he´s getting his hands dirty with Python and Rust. For the last six years Sebastian tries to improve our lives, working on Deutsche Telekoms Smart Home platform Qivicon.\n\n>> Famous last words:\n>> “If I would’ve wanted to work in ‘Enterprise’, I’d have joined Starfleet…”",
      "company": "Deutsche Telekom",
      "twitter": "asciidisco",
      "googleplus": null,
      "github": "ascidisco",
      "language": "en",
      "gender": "MALE",
      "social": "https://asciidisco.com",
      "imageProfilURL": "https://pictures.asciidisco.com/uploads/big/dff5c90dde1cbea06317e2019a99b6ca.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2883",
    "state": "ACCEPTED",
    "name": "Coding Game Challenge",
    "language": "Français",
    "description": "Venez participer à ce challenge de conception d’intelligence artificielle.\n\nLes règles sont simples :\n\n- une bataille de personnages médiévaux en un contre un\n\n- une API REST d’attaque à disposition\n\n- une application web de visualisation du combat en live\n\nVous n’avez plus qu’à coder votre IA avec votre langage préféré, réagir en conséquence et affronter l’IA du serveur ou d’autres participants de ce lab.",
    "plus": "Des starter kits seront à disposition (Node.js, php, Java), la plateforme sera ouverte 2 semaines avant la conférence.\n\nTournoi avec des lots à gagner à la fin de la session.",
    "eventId": "mix-it",
    "format": 49,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "810",
      "email": "vincent.ogloblinsky@gmail.com",
      "lastname": "Ogloblinsky",
      "firstname": "Vincent",
      "bio": "Architecte logiciel frontend au sein d'une ESN rennaise, j'évolue entre architecture de projets web, formations, animations techniques, support client et expertise technique. \nPassionné par le \"grand\" domaine du développement web frontend, j'affectionne particulièrement coder en (Type||Java)script, débugger HTML5, découvrir la capacité grandissante du navigateur à se rapprocher des capteurs (GPS, bluetooth, etc...), et participer à des projets open-source.",
      "company": "SII",
      "twitter": "vogloblinsky",
      "googleplus": null,
      "github": "vogloblinsky",
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://media.licdn.com/media/p/3/000/0e9/3fc/31e9ea0.jpg"
    },
    "cospeakers": [
      {
        "id": "1572",
        "email": "m.brechet@gmail.com",
        "lastname": "BRECHET",
        "firstname": "Matthieu",
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "2911",
    "state": "ACCEPTED",
    "name": "Le réseau vu du langage de programmation : quelle API pour le réseau ?",
    "language": "Français",
    "description": "Aujourd'hui, très rares sont les logiciels qui ne font pas du tout appel à l'Internet. Tout programmeur doit donc connaitre au moins une API réseau. Par exemple, l'API dite \"Berkeley sockets\" reste encore aujourd'hui une référence, même en dehors du langage C pour laquelle elle avait été conçue. Mais le réseau est une bête complexe, et les programmeurs ne sont pas forcément des experts réseau. Il est donc difficile de faire une API qui leur permette d'utiliser simplement le réseau, sans pour autant leur masquer les réalités du réseau (par exemple sa fâcheuse tendance à planter au mauvais moment). Un travail est ainsi en cours à l'IETF pour formaliser les services qu'offre le réseau aux applications, menant peut-être à de meilleures API.",
    "plus": "On explorera donc le problème des API réseau, leur adaptation au langage de programmation, la tension permanente entre la volonté de cacher le réseau au programmeur, et la dure réalité des réseaux, et les évolutions possibles.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "3550",
      "email": "bortzmeyer+mixit@nic.fr",
      "lastname": "Bortzmeyer",
      "firstname": "Stéphane",
      "bio": "Ingénieur, spécialisé dans l'infrastructure de l'Internet, plus spécialement le DNS.",
      "company": "AFNIC",
      "twitter": "https://twitter.com/bortzmeyer",
      "googleplus": null,
      "github": "https://github.com/bortzmeyer",
      "language": "fr",
      "gender": "MALE",
      "social": "http://www.bortzmeyer.org/",
      "imageProfilURL": null
    },
    "cospeakers": []
  },
  {
    "id": "2933",
    "state": "ACCEPTED",
    "name": "Comment être un développeur ethique et green ? Dilemne entre la course technologique et mon impact sur la société.",
    "language": "Français",
    "description": "Le logiciel est partout. Il est clair que le logiciel a un impact réel sur le monde : uberisation, digitalisation... mais stoppons ici la buzzwordisation... Nous, développeurs sommes les architectes du monde virtuel au service du réel. Nos actions ont un effet bien réel. Bénéfique mais aussi néfaste. \nExclusion sociale, impact environnemental, obsolescence sont des effets bien réel de nos logiciels. Mais avons nous le choix face au demandes de nos utilisateurs et clients et aux contraintes associées (planning, sécurité...)\nEt bien oui, c'est le choix qui est fait par de nombreuses sociétés et développeurs : bénévolat comme code for America, Eco-conception de logiciel publique... Etre développeur ethique et green est possible, nous verrons concretement comme faire cela au jour le jour.",
    "eventId": "mix-it",
    "format": 48,
    "trackLabel": "Hack/Activism",
    "difficulty": 1,
    "speaker": {
      "id": "1417",
      "email": "sgreenit@gmail.com",
      "lastname": "Philippot",
      "firstname": "Olivier",
      "bio": "Olivier est CTO chez Greenspector. Il aime les technologies mais surtout les optimiser. En particulier sur Android et l'embarqué. Il est fortement engagé dans les actions de sensibilisation à l'efficience et l'éco-conception logicielle comme le Geen Code Lab Challenge. Speaker a Devoxx, Android Maker, Breizhcamp...",
      "company": "Greenspector",
      "twitter": "@simplygreenit",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/870166130379378688/7yRlmKB6.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "2950",
    "state": "ACCEPTED",
    "name": "Vers la dégooglisation et au-delà !",
    "language": "Français",
    "description": "Ah, les GAFAM, ces dévoreurs de données fournisseurs de services gratuits. Chez Framasoft, on s'intéresse à eux depuis 4 ans. Et on en a trouvé des choses à dire : exploitation des données, sur-dépendance, relation déséquilibrée… Le tableau n'est pas rose. Mais pourtant, il y a des choses à faire. Voici donc un petit bilan de ce que l'association a accompli depuis le lancement de la campagne « Dégooglisons Internet », ce que l'on projette de faire pour les années à venir et comment vous allez nous y aider, à sauver l'Internet…",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Hack/Activism",
    "difficulty": 1,
    "speaker": {
      "id": "3545",
      "email": "dev@marienfressinaud.fr",
      "lastname": "Fressinaud",
      "firstname": "Marien",
      "bio": "Développeur web chez Sogilis et membre de l'association Framasoft, je passe une bonne partie de mon temps à développer des logiciels libres pour me simplifier la vie ainsi que celle des autres. J'ai à cœur de défendre et promouvoir mes valeurs à travers les projets dans lesquels je m'implique.",
      "company": "Framasoft",
      "twitter": "https://twitter.com/berumuron",
      "googleplus": null,
      "github": "https://github.com/marienfressinaud",
      "language": "fr",
      "gender": "MALE",
      "social": "https://marienfressinaud.fr/",
      "imageProfilURL": "https://avatars0.githubusercontent.com/u/1436309?s=460&v=4"
    },
    "cospeakers": []
  },
  {
    "id": "2954",
    "state": "ACCEPTED",
    "name": "Mes fails en tant que CTO",
    "language": "Français",
    "description": "En 2001, je créais avec un ami WipiStudio, ma première startup, et mon premier échec. \nA l'époque, le terme CTO n'était pas vraiment à la mode, la net économie s'était effondrée, et je savais à peine coder. \n17 ans plus tard, ou presque, je suis passé par bien d'autres environnements et startups, et j'ai joyeusement continué à échouer. \n\nJe vous propose dans cette conférence de faire le tour des erreurs que j'ai pu commettre, ou celles que j'ai cautionnées, à travers la petite dizaine d'expériences entrepreneuriales auxquelles j'ai pu participer de prêt ou de loin.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "3559",
      "email": "jbdusseaut@arpinum.fr",
      "lastname": "Dusseaut",
      "firstname": "Jean-Baptiste",
      "bio": "eXtreme Programmer, co-fondateur chez [arpinum](https://www.arpinum.fr)\nCTO occasionnel de [linguali](http://linguali.com)\nCo-organisateur [NewCrafts Bordeaux](http://bordeaux.ncrafts.io)\nDDD, Coding dojo, Ordre des développeurs, cryptos, philo, papa.",
      "company": "Arpinum",
      "twitter": "bodysplash",
      "googleplus": null,
      "github": "bodysplash",
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://scontent-cdt1-1.xx.fbcdn.net/v/t1.0-9/15036400_10154627763267508_1597699480037298398_n.jpg?oh=f3a4a6ee1dc558672c7b4fe021c3b665&oe=5AF839B4"
    },
    "cospeakers": []
  },
  {
    "id": "2984",
    "state": "ACCEPTED",
    "name": "Cessons les estimations !",
    "language": "Français",
    "description": "lors que les estimations sont à la base des méthodes classiques et que dans le domaine Agile, SCRUM notamment lui accorde une grande importance, nous allons l’espace d’une conférence remettre en cause celles-ci.\n\nAprès un bref rappel de différentes méthodes permettant de réaliser des estimations et croyances qui y sont attachées, nous prendrons le temps de réfléchir sur les effets néfastes de ces dernières. Enfin, nous verrons comment dans la réalité des projets, il est possible de s’en extraire.\n\nPrésentation sans jargon ouverte à toute personne ayant des notions de gestion de projet.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "3576",
      "email": "pro@leguedois.fr",
      "lastname": "Leguédois",
      "firstname": "Frédéric",
      "bio": "Evangéliste Agile, libriste, voire polémiste ;-) Conférencier iconoclaste",
      "company": "Cloud Temple",
      "twitter": "@f_leguedois",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "MALE",
      "social": "http://leguedois.fr/",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/879784230393442305/y6VvMcCH_400x400.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "3000",
    "state": "ACCEPTED",
    "name": "Comment le suivi du diabète m'a amené à la Dataviz !",
    "language": "Français",
    "description": "Imaginez: tous les jours, vous devez prendre votre taux de sucre au moins 3 fois dans la journée, vous notez vos résultats dans un petit carnet au format papier.\n\nC'est un peu long, rébarbatif et pas très écolo, non? Surtout pour nous qui aimons bien automatiser le maximum de tâches, et pouvoir consulter nos données de n'importe où...\n\nMaintenant, imaginez: vous récupérez toutes ces données qui sont stockées sur l'appareil de mesure, vous les remontez dans une base de données et vous faites le suivi via une interface web qui vous permet en plus d'annoter les relevés pour lesquels vous souhaitez ajouter des informations complémentaires...\n\nVenez découvrir durant ce talk comment mettre ce cas en pratique: de la récupération de données à la mise en place de la data visualisation pour pouvoir exploiter toutes ces données et les enrichir.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "7",
      "email": "stephanie.moallic@gmail.com",
      "lastname": "Moallic",
      "firstname": "Stéphanie",
      "bio": "Développeuse informatique depuis plus de 15 ans, avec une prédilection pour le front-end, les bonnes pratiques, dans les techno autour de Java et de la JVM et aussi du web. Passionnée d'informatique mais pas que...",
      "company": "OVH",
      "twitter": "https://twitter.com/steffy_29",
      "googleplus": null,
      "github": "https://github.com/Steffy29",
      "language": "fr",
      "gender": "FEMALE",
      "social": "www.surfinfoweb.com",
      "imageProfilURL": "https://fr.gravatar.com/userimage/81505632/03a8914e558fd63409da54918916a343.png"
    },
    "cospeakers": []
  },
  {
    "id": "3029",
    "state": "ACCEPTED",
    "name": "S'épanouir grâce aux nouveaux formats de travail : remote, nomadisme digital, slashing, entreprise libérée",
    "language": "Français",
    "description": "Tour d’horizon de quatre nouveaux formats de travail qui replacent le sens et l’épanouissement personnel au centre de l’équation : remote, entreprise libérée, nomadisme digital, slashing.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Other",
    "difficulty": 1,
    "speaker": {
      "id": "3546",
      "email": "isislat@gmail.com",
      "lastname": "Latorre",
      "firstname": "Isis",
      "bio": "Passionnée par l'épanouissement professionnel, je rêve que chacun fasse un travail qu'il aime vraiment. Au travers de mon blog www.lesnouveauxtravailleurs.fr, j'étudie comment on peut s'épanouir au travers des nouveaux formats de travail : remote, nomadisme digital, slashing, entreprise libérée. Je mène notamment des interviews auprès de personnes qui ont opté pour ces formats. J'intègre à ma réflexion des notions de développement personnel, un domaine qui me passionne également.",
      "company": "LesNouveauxTravailleurs",
      "twitter": "https://twitter.com/isislat",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "FEMALE",
      "social": "lesnouveauxtravailleurs.fr, https://www.linkedin.com/in/isislatorre/, https://www.facebook.com/lesnouveauxtravailleurs",
      "imageProfilURL": "https://lesnouveauxtravailleurs.fr/wp-content/uploads/2017/01/MoiJanvier2017.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "3036",
    "state": "ACCEPTED",
    "name": "Agile - is it real or a fairytale?",
    "language": "English",
    "description": "Imagine a place where all rules have to add value and make sense. Where the processes are there to support instead of control. Where profit is the consequence of doing a great job - not the reason why we go to work. Where employees as so happy to work that the salary becomes secondary. Where the customers are so happy they don't consider going elsewhere\n.\nThis may sound like a fairytale and in most organizations, it is – but does it really have to be?",
    "plus": "Over the past decade Agile has spread like wildfire. Almost every organization has implemented some sort of Agile Framework and many are investing heavily in implementing them. In addition, there are now more than 500,000 Certified Scrum Masters. \nWith all those positive things happening, then what’s stopping us from living the Fairytale?\n\nThrough his work with Agile Transformations and as founder of the Beyond Scrum concept, Allan has gained vast experience in making teams and organizations move beyond the agile frameworks and embrace true Agile. In this Keynote Allan will take you on an inspirational journey that goes beyond frameworks and processes, to a place where people can make a difference.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Alien",
    "difficulty": 1,
    "speaker": {
      "id": "3583",
      "email": "allan@rennebo.com",
      "lastname": "Jepsen",
      "firstname": "Allan Rennebo",
      "bio": "I am an Agile enthusiast, DRiVE practitioner, UnBoss believer, Leadership thinker, Scrum Coach, Cultural Change Agent and probably a whole lot more.\nMy passion is to help businesses succeed by allowing the employees to grow – both individually and together. To achieve that, I of course utilize many different frameworks and practices – like Scrum, Kanban, SAFe, etc., but my main focus is always on how the changes supports the need of the employees and customers in the best possible way.\nI am an active member of the Business Agility and Agile communities, founder of Agile Copenhagen and speaker at conferences around the world.",
      "company": "Core Agile",
      "twitter": "@rennebo",
      "googleplus": null,
      "github": null,
      "language": "en",
      "gender": "MALE",
      "social": "www.coreagile.dk, www.rennebo.com, https://www.linkedin.com/in/rennebo/",
      "imageProfilURL": "http://rennebo.com/AllanRenneboJepsenProfile.png"
    },
    "cospeakers": []
  },
  {
    "id": "3051",
    "state": "ACCEPTED",
    "name": "Open Source as a Business: Strategy, Struggle & Success",
    "language": "English",
    "description": "How do you build a lasting and successful company that also stays true to its open source roots? This talk takes a look at why open source is important to business and three essential elements of this path:",
    "plus": "* Strategy: How can you monetize your open source product? Is it support, an open core approach, cloud services, or a combination of the three? And which ones are the features you can even commercialize without alienating your community?\n* Struggle: \"You received a 100 million dollars in venture capital and yet you have so many open issues?!\" Once money is involved the dynamics often change. How can you manage expectations and still build on a flourishing open source community?\n* Success: How do you balance open source and commercial success? How do you align engineering and sales decisions?\n\nThis talk takes the perspective of Elastic, the company behind the open source products Elasticsearch, Kibana, Beats, and Logstash, which makes its money with support, the commercial X-Pack extensions, and cloud offerings. But we are also taking a look at how others are approaching this challenge, what worked, and what failed.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Product",
    "difficulty": 1,
    "speaker": {
      "id": "3601",
      "email": "pk@xeraa.net",
      "lastname": "Krenn",
      "firstname": "Philipp",
      "bio": "Philipp is part of the infrastructure team and a developer advocate at Elastic. He is frequently talking about full-text search, databases, operations, and security. Additionally, he is organizing multiple meetups in Vienna.",
      "company": "Elastic",
      "twitter": "xeraa",
      "googleplus": null,
      "github": "xeraa",
      "language": "en",
      "gender": "MALE",
      "social": "https://xeraa.net",
      "imageProfilURL": "https://avatars3.githubusercontent.com/u/432211?v=3&s=460"
    },
    "cospeakers": []
  },
  {
    "id": "3059",
    "state": "ACCEPTED",
    "name": "Vous arrive-t-il d'infliger de l'aide ?",
    "language": "Français",
    "description": "Certains mots ont pris des sens très particuliers dans notre langue, le mot “aider” en fait partie. Lors de cette session, je vous propose de m’accompagner dans une réflexion sur les vices cachés de l’aide en général, telle qu’elle est souvent pratiquée. Le tout sera remis dans le contexte de la demande, ou de l’absence de demande, et se notre rapport au “non”.\n\nTriangle de Karpman, CNV ou Analyse Transactionnelle, l’occasion de vous présenter quelques outils qui pourront vous aider à revisiter votre manière d’“être” à vous même et aux autres.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Education",
    "difficulty": 1,
    "speaker": {
      "id": "3614",
      "email": "jquille@azae.net",
      "lastname": "Quillé",
      "firstname": "Julie",
      "bio": "Passionnée par l’être humain, la psychologie et la sociologie, j’accompagne les personnes et les équipes dans leur cheminement vers plus de responsabilité et de liberté individuelles. La Communication Bienveillante (CNV) est mon outil de prédilection. Dans un dynamique d’amélioration continue, il me tient à cœur d’élargir en permanence mes domaines de compétences, par des lectures, des recherches, des formations, mais surtout à travers des échanges et de l’expérimentation. Ce sont mes intérêts pour l’épanouissement au travail, l’adaptabilité et le travail collaboratif qui m’ont amené à l’agilité et au coaching d’équipes.",
      "company": "Azaé",
      "twitter": null,
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "FEMALE",
      "social": "https://www.linkedin.com/in/juliequille/",
      "imageProfilURL": "http://ajiro.fr/authors/quille_julie/"
    },
    "cospeakers": [
      {
        "id": "3616",
        "email": "tclavier@azae.net",
        "lastname": "Clavier",
        "firstname": "Thomas",
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "3090",
    "state": "ACCEPTED",
    "name": "En vie de courage",
    "language": "Français",
    "description": "Se lancer dans l'aventure de la création d'entreprise demande non seulement de bien connaitre les processus de conduite de projet, mais bien plus encore de mettre en œuvre la vertu du courage pour affronter les obstacles, les prises de risques qui ne manqueront pas de surgir.",
    "plus": "Cette fermeté de l'esprit permet de saisir et de soutenir des idées pionnières et audacieuses. Avec le courage, les obstacles, les erreurs, les échecs, les risques ne seront pas des freins mais des tremplins d'énergie pour affermir le projet. \nDans le contexte complexe des mutations sociétales et technologiques d’aujourd’hui, cette responsabilité personnelle, libre de toute influence extérieure, est de plus en plus déterminante.\n\nA partir de quelques expériences communes et personnelles, père et fille partageront les éléments clés qui ont forgés leurs parcours de serial-entrepreneurs. Ils donneront à s’interroger sur les leviers et les comportements qui peuvent conduire du « déclencheur » à la création d’entreprise innovante. Ils joueront de leur diversité de genre, de génération, d’expertise et d’expérience... Ils exposeront leurs communs comme leurs différences. Ensemble, ils espèrent stimuler vos questionnements et nourrir votre envie de courage.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Alien",
    "difficulty": 1,
    "speaker": {
      "id": "3581",
      "email": "bonnet-cla@wanadoo.fr",
      "lastname": "Bonnet",
      "firstname": "Claude",
      "bio": "Claude Bonnet - Dirigeant Toccata Ingénierie\nEMSE 58\nSerial-entrepreneur - Expert en ingénierie industrielle et financière ; Management de l'innovation ; Management général ; Conduite de projet ; Formateur (EMSE, SupOptique, ESCP, INGREF, Université Jean Monet...).\nAuteur \"Réussir ses projets\" (Ed. La chronique Sociale)\nExpérience : Industrie pétrochimie, BTP, thermique et aéraulique, équipement sidérurgique, industrie des loisirs",
      "company": "Toccata Ingénierie",
      "twitter": "",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": ""
    },
    "cospeakers": [
      {
        "id": "3627",
        "email": "veronique.bonnet@emulsioncreative.com",
        "lastname": "Bonnet",
        "firstname": "Véronique",
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "3094",
    "state": "ACCEPTED",
    "name": "#RetourAuxSources : Les cookies HTTP",
    "language": "Français",
    "description": "Les cookies HTTP sont partout ! Pas une journée sans qu’un site nous demande “d’accepter les cookies”. Rares sont les projets Web qui ne les utilisent pas et pourtant leur fonctionnement nous échappe trop souvent.",
    "plus": "On confond les règles auxquelles ils sont soumis au sein des navigateurs. On fait des amalgames avec les sessions côté serveur. Ces petits trous dans le gigantesque éventail de connaissances du développeur moderne ont parfois des impacts non négligeables sur la sécurité de nos applications et sur la préservation de notre vie privée en tant qu’utilisateur du Web.\n\nAu menu de cette session, je vous propose de (re)découvrir les cookies HTTP par l’exemple et la pratique. Nous reviendrons sur leurs origines et nous verrons en détails le fonctionnement au sein des navigateurs et des serveurs. Enfin, nous aborderons les aspects les plus récent dans le domaine (SameSite, cookie prefix...). Ce talk sera plus généralement l’occasion de parler de sécurité, de tracking et de vie privée.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "2608",
      "email": "hubert.sablonniere@gmail.com",
      "lastname": "SABLONNIÈRE",
      "firstname": "Hubert",
      "bio": "Hubert est passionné par le Web. Il est toujours à la recherche de nouvelles idées et autres bidouilles pour améliorer l'expérience des utilisateurs et des développeurs.",
      "company": "Clever Cloud",
      "twitter": "hsablonniere",
      "googleplus": null,
      "github": "hsablonniere",
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://fr.gravatar.com/userimage/13472948/38009733493b55d52223205e85c6e86d.png?size=500"
    },
    "cospeakers": []
  },
  {
    "id": "3104",
    "state": "ACCEPTED",
    "name": "Se libérer des entreprises pour créer son équilibre et payer ses factures",
    "language": "Français",
    "description": "Les entreprises libérées : ça a l'air trop bien. Si on s'écoutait, on casserait et on referait tout comme on l'entend. Doit-on forcément quitter les entreprises traditionnelles pour vivre et travailler heureu·x·se ?\nCes injonctions à l'autonomie peuvent pourtant être mal vécues. Il est difficile de savoir si c'est une mode ou un vrai truc qui fait du bien.",
    "plus": "Nous avons tou·te·s un besoin d'autonomie et des envies de cadre différents. D'ailleurs on cultive cet équilibre chacun·e à sa façon,  entre des activités pro et perso, entre des activités rémunérées ou non, entre des activités à temps plein ou temps partiel. C'est quoi cet équilibre dont on a besoin et comment on le crée ? On pourrait déjà commencer par soi-même pour construire ce qui nous convient.\n\nClaire et Thomas sont freelance et salarié plutôt satisfait·e de leur équilibre. Elles animeront ces réflexions sous forme d'un dialogue à deux. Elles inviteront le public à partager leurs expériences et ressentis tout au long du dialogue.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Team",
    "difficulty": 1,
    "speaker": {
      "id": "3355",
      "email": "hi@oncletom.io",
      "lastname": "Parisot",
      "firstname": "Thomas",
      "bio": "Code, facilitation et recherche @ [dtc innovation](https://dtc-innovation.org) • Je crois en l'autonomie, la tendresse et l'ouverture.",
      "company": "dtc innovation",
      "twitter": "oncletom",
      "googleplus": null,
      "github": "oncletom",
      "language": "fr",
      "gender": "MALE",
      "social": "https://oncletom.io, https://dtc-innovation.org, https://oncletom.io/talks/",
      "imageProfilURL": "https://raw.githubusercontent.com/oncletom/talks/master/thomas-parisot.jpg"
    },
    "cospeakers": [
      {
        "id": "3330",
        "email": "clairezuliani@gmail.com",
        "lastname": "Zuliani",
        "firstname": "Claire",
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "3108",
    "state": "ACCEPTED",
    "name": "Bug free. By design",
    "language": "Français",
    "description": "Débarrassez-vous de familles entières de bugs avec 21 astuces qui réduisent l'opportunité pour les bugs.\n\nLes bugs ne sont pas une fatalité, ils arrivent dès lors que le design le permet. Apprenez comment addresser\nles causes racines et comment doter votre code d'une robustesse intrinsèque.",
    "plus": "Vous verrez le typage statique et dynamique autrement. Vous comprendrez le DDD autrement. Apprenez plein de choses sur le NoPrimitives,\ncouplage & cohésion, if-less. Nous parlerons de feedback-funnel et comment ces idées du micro-design se\ntransposent vers le macro-design et même les micro-services. Certes les tests aussi sont indispensables pour réduire les bugs, cette présentation se concentre néanmoins exclusivement sur les éléments de Design.\n\nPlein d'exemples concrets et un peu de live coding!",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Maker",
    "difficulty": 2,
    "speaker": {
      "id": "773",
      "email": "martinsson.johan@gmail.com",
      "lastname": "Martinsson",
      "firstname": "Johan",
      "bio": "Johan Martinsson est développeur freelance qui se passionne entre autres pour les design du code. Avec 15 ans d’expérience, il a passé les 6 dernières années à aider des équipes de maîtriser le développement accompagné de tests dans de multiples langages. Régulièrement il trouve des raisons (toujours bonnes) pour aller montrer un peu de code dans des conférences. \n\nJohan a organisé le 1er Code Retreat en france et le premier Legacy Code Retreat mondial avec JB Rainsberger. Il continue à s’investir dans le dojo grenoblois qui atteint ces 120 séances cette année.",
      "company": "Indep",
      "twitter": "@johan_alps",
      "googleplus": null,
      "github": "https://github.com/martinsson",
      "language": "Français",
      "gender": "MALE",
      "social": "http://martinsson-johan.blogspot.fr",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/1573614566/me_small.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "3120",
    "state": "ACCEPTED",
    "name": "Intégrez la sécu dans votre quotidien avant qu’il ne soit trop tard!",
    "language": "Français",
    "description": "L’année 2017 était sans doute l'année des fuites de données et de la cybersécurité. Rien de tel qu’un bad buzz créé par un « data breach » pour nuire à l’image de votre entreprise et détruire votre réputation !\n\nLors de ce talk, nous allons découvrir ensemble comment intégrer la sécurité dans votre plateforme d'intégration continue.",
    "plus": "Nous verrons aussi les principales failles de l’OWASP et comment les éviter. Nous vous montrerons avec quelques démos les techniques indispensables pour identifier le maximum de vulnérabilités afin de livrer des applications sécurisées à moindre coût :\n- Analyse de dépendances et du code source\n- Analyse des images docker\n- Tests d'intrusion automatisés",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Hack/Activism",
    "difficulty": 1,
    "speaker": {
      "id": "1130",
      "email": "houssem@belhadjahmed.com",
      "lastname": "BELHADJ AHMED",
      "firstname": "Houssem",
      "bio": "Développeur chez Zenika, je travaille sur des sujets divers et variés. Je suis un touche-à-tout passionné par le monde du JS et la sécurité informatique. Je suis aussi co-organisateur du meetup HumanTalks Lyon.",
      "company": "Zenika",
      "twitter": "https://twitter.com/7ouss3m",
      "googleplus": null,
      "github": "github.com/houssemba",
      "language": "Français",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/908820292566470657/p8SOZwlH_400x400.jpg"
    },
    "cospeakers": [
      {
        "id": "1131",
        "email": "mickael.jeanroy@gmail.com",
        "lastname": "Jeanroy",
        "firstname": "Mickael",
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "3124",
    "state": "ACCEPTED",
    "name": "Démystifier le réactif et l'orchestration de services avec Vert.x, Kubernetes et Kotlin",
    "language": "Français",
    "description": "Les systèmes distribués réactifs ? L'orchestration de services avec Kubernetes ?\nTout le monde ou presque a entendu ces termes sans nécessairement savoir de quoi il s'agit vraiment.\n\nCe talk se veut une démystification du réactif avec Eclipse Vert.x et une initiation au déploiement d'applications dans Kubernetes qui est moins effrayant qu'il n'en a l'air. Bien entendu les démos (et l'éventuel effet démo) prendront le dessus sur l'empilement de slides. Et comme Vert.x supporte plusieurs langages populaires de la JVM, nous utiliserons Kotlin.",
    "plus": "Pour la petite histoire Vert.x est un toolkit pour écrire des applications réactives et polyglottes pour la JVM. Il fournit aujourd'hui un écosystème complet et modulaire qui intègre le paradigme réactif de bout en bout, performant et facile à utiliser pour tous types d'applications. La richesse de l'écosystème Vert.x permet de développer aussi bien une application web de type temps réel, de faire de l'IoT, d'implémenter des adaptateurs de protocoles, d'écrire des applications distribuées et bien entendu de concevoir et intégrer des micro-services.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "1812",
      "email": "julien.ponge@gmail.com",
      "lastname": "Ponge",
      "firstname": "Julien",
      "bio": "Maître de Conférences INSA Lyon Telecom, chercheur au laboratoire CITI-Inria, actuellement en délégation chez  Red Hat pour contribuer à Vert.x.",
      "company": "INSA Lyon, Red Hat Inc.",
      "twitter": "@jponge",
      "googleplus": null,
      "github": "jponge",
      "language": "Français",
      "gender": "MALE",
      "social": "http://www.linkedin.com/in/julienponge, https://julien.ponge.org/",
      "imageProfilURL": "https://julien.ponge.org/images/me.png"
    },
    "cospeakers": []
  },
  {
    "id": "3166",
    "state": "ACCEPTED",
    "name": "Les dessous d'un embargo de sécurité",
    "language": "Français",
    "description": "Difficile d'échapper aux failles Meltdown et Spectre en ce début d'année. Outre les failles elles-mêmes, le processus impliqué dans leur découverte, leur documentation et leur correction peut surprendre : on parle de découverte début 2017, d'embargo depuis mi-2017, et un dévoilement soudain tout début 2018, quelques jours avant la date prévue, suivi de mesures d'urgence prises par plusieurs projets et hébergeurs cloud qui n'avaient pas été mis dans la confidence. Cette présentation expliquera comment sont gérés les bugs de sécurité dans les projets « open source », de la découverte à l'embargo puis au « responsible disclosure » voire « coordinated disclosure » ; qui participe, qui détermine le calendrier, comment est géré l'apparent besoin de secret même dans le cadre d'un projet développé en public... ",
    "plus": "Vous apprendrez comment réagir à la publication tant redoutée d'un CVE, que ce soit comme développeur ou comme utilisateur, comment évaluer un CVSS, comment rassurer (ou pas !) votre RSSI, mais aussi comment gérer de façon responsable une faille de sécurité que vous pourriez découvrir.\n\nJe ne suis pas un pro de la sécurité, mais je fais partie de [l'équipe de réponse au vulnérabilités dans OpenDaylight](https://wiki.opendaylight.org/view/Security:Main#Security_Response_Team), et lorsque le besoin se présente, je travaille de près avec l'équipe de sécurité Red Hat (mon employeur) ; je suis aussi développeur Debian, ce qui me donne l'occasion de gérer des failles de sécurité découvertes dans les paquets dont je m'occupe, voire d'en trouver et d'en corriger moi-même. Je participe aussi à des audits de sécurité, des deux côtés de la barrière (auditeur et audité).",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "624",
      "email": "steve@sk2.org",
      "lastname": "Kitt",
      "firstname": "Stephen",
      "bio": "Stephen Kitt est un aficionado des logiciels libres ; il les utilise depuis 1992. Il a contribué à plusieurs projets libres, dont le noyau Linux. Il est développeur Debian depuis 2013. En 2015 il a rejoint Red Hat pour travailler à temps plein sur OpenDaylight, une plateforme de réseau défini par logiciel (SDN, software-defined networking). Quand il n'est pas en train de développer ou de packager, il aime jouer à d'anciens jeux sur son Atari 800XL ou son PC sous DOS.",
      "company": "Red Hat",
      "twitter": "thekittster",
      "googleplus": "skkitt",
      "github": "skitt",
      "language": "Français",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/653330648481026048/ZXYt_mSk_400x400.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "3170",
    "state": "ACCEPTED",
    "name": "Typographie et accessibilité",
    "language": "Français",
    "description": "**Comment la typographie web peut-elle améliorer l’accessibilité d’une interface ?** Puisque le contenu est roi, penchons-nous sur le design du texte à l’écran, et sur sa capacité à améliorer l’expérience utilisateur des personnes en situation de handicap visuel et/ou cognitif.\n\nTaille, couleur, espacement et alignement des caractères ; longueurs des lignes ; polices de caractères adaptées ; personnalisation de l’interface par les utilisateurs ; aides à la lecture… Cette conférence vous permettra de **faire des choix typographiques éclairés en matière d’accessibilité**, et de créer ainsi des interfaces plus accessibles et plus inclusives.",
    "plus": "La typographie étant une composante majeure du design graphique, cette présentation s’adresse en premier lieu aux designers UI. Mais la problématique de la typographie accessible concerne également les designers UX, les intégratrices et intégrateurs web, ainsi que toute personne amenée à contribuer à un projet web et s’intéressant au sujet.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Design",
    "difficulty": 1,
    "speaker": {
      "id": "3636",
      "email": "marie@marieguillaumet.com",
      "lastname": "Guillaumet",
      "firstname": "Marie",
      "bio": "Web designer et intégratrice web senior, Marie Guillaumet est consultante en accessibilité numérique chez [Access42](https://access42.net/). Elle vit et travaille à Rennes, et collabore avec ses collègues en full remote. Elle a écrit de nombreux articles sur le web design et l’intégration, et partage régulièrement ses découvertes sur [Twitter](https://twitter.com/kReEsTaL) ou lors de conférences. Diplômée de Sciences Po Grenoble et du CELSA, Marie s’intéresse tout particulièrement à la dimension anthropologique et symbolique du web. Sa spécialisation en accessibilité numérique lui permet de concilier design, technique et implication sociale. Elle consacre son temps libre au dessin, au yoga et à de nombreux voyages au Royaume-Uni.",
      "company": "Access42",
      "twitter": "kreestal",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "FEMALE",
      "social": "https://marieguillaumet.com/blog/, https://www.linkedin.com/in/kreestal, https://expertes.fr/expertes/69742-marie-guillaumet, https://www.24joursdeweb.fr/author/auteur-mguillaumet/",
      "imageProfilURL": "https://marieguillaumet.com/misc/marie-guillaumet_square.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "3173",
    "state": "ACCEPTED",
    "name": "L'Air du Bois : Un réseau social solidaire",
    "language": "Français",
    "description": "En 2013, après 10 ans années de développement dans le secteur du jeu vidéo, je décide d'opérer un virage à 360° dans mon parcours professionnel pour devenir **ébéniste**.\nEn ex-développeur largement **autodidact**, je n'ai pas envisagé cette reconversion autrement que par l'auto apprentissage. La pratique, les erreurs et Internet ont donc été mes amis.\n\nSoucieux de transmettre des valeurs aujourd’hui essentielles à mes yeux comme celle du libre que j’ai pu largement brasser en 10 ans de code, j’ai voulu décliner cette philosophie dans le domaine du travail du bois.\n\nAmoureux du code autant que du copeau, j’ai lancé le projet [L’Air du Bois](https://www.lairdubois.fr). Projet qui vise à être autant un outil libre et accessible, qu’un moyen d’échange et d’interconnexion autour d’une passion commune et encore qu’une réserve à savoirs et idées. Cet outil a donc naturellement pris la forme d’un hybrid entre un réseau social, un wiki et une encyclopédie. Bref, un boîte à outils oeuvrant à l’enrichissement d’un *Bien Commun* financé par le volontariat et le don.\n\nDans ce talk, je vous propose tout d’abord de découvrir l’outil et sa philosophie et ensuite de vous partager ces 5 premières années d’expérience à développer un tel projet communautaire et solidaire autant d’un point de vue du développeur que de l’ébéniste.\nEt de découvrir comment le travail de la communauté du libre a pu amener de nombreuses personnes à se passionner pour le travail du bois.",
    "eventId": "mix-it",
    "format": 48,
    "trackLabel": "Alien",
    "difficulty": 1,
    "speaker": {
      "id": "3313",
      "email": "boris.beaulant@gmail.com",
      "lastname": "Beaulant",
      "firstname": "Boris",
      "bio": "# Un rêve de gamin\n\nPur produit de la génération 80, j'ai rêvé sur les *Système D* et les *Ma maison, mon ouvrage* de l'époque qu'on pouvait tout faire par soi même.\nPlus tard, c'est aussi bien un ordinateur qu'une perceuse que j'ai pu avoir dans les mains. Les deux ne semblent pas avoir vraiment de point commun. Mais dans tous les cas, se sont des outils avec lesquels on peut assouvir sa créativité.\nL'ordinateur, a tracé le chemin de mon premier métier et la perceuse celui de ma passion. Aujourd'hui, j'ai inverser les deux et je suis devenu ébéniste.\n\n# \"Bricodeur\" du dimanche\n\nProgrammer sur ordinateur (coder) ou concevoir et réaliser des objets usuels en bois restent encore deux activités qui font tourner mon quotidien. Et finalement, c'est même assez complémentaire. Alors, c'est en autodidacte que j'ai progressé dans chaque domaine. Et aujourd'hui, je suis heureux de pouvoir réaliser autant un site web comme celui-ci (L'Air du Bois) que de passer des heures dans l'atelier à façonner le bois avec des projets de plus en plus ambitieux.\n\n# Partager ma passion\n\nJ'ai beaucoup appris de mes erreurs, mais j'ai surtout appris de ce que partage les passionnés du monde entier au travers d'Internet. Ouvrir un portail comme L'Air du Bois, c'est pour moi le moyen de contribuer à cet effort collectif.",
      "company": "L'Air du Bois",
      "twitter": "https://twitter.com/LAirDuBois",
      "googleplus": "https://plus.google.com/b/113918952735786332131/",
      "github": "https://github.com/lairdubois",
      "language": "fr",
      "gender": "MALE",
      "social": "https://www.lairdubois.fr/, https://www.youtube.com/channel/UCMsUwOwHnbJPB9Eqgw49vhQ, https://www.borisbeaulant.com/, https://www.linkedin.com/in/boris-beaulant-0437271/, https://www.lairdubois.fr/zeloko",
      "imageProfilURL": "https://scontent-cdg2-1.xx.fbcdn.net/v/t1.0-9/11125273_10205524155376196_2047433136996947017_n.jpg?oh=9c5581dc3a0bfebb9199c7b7d3982361&oe=5A9311D5"
    },
    "cospeakers": []
  },
  {
    "id": "3174",
    "state": "ACCEPTED",
    "name": "Mise en pratique de l'Atomic Design",
    "language": "Français",
    "description": "Atomic design \n\nAvec l’émergence de logiciels comme Sketch et Adobe XD, ce n’est pas seulement de nouvelles manières techniques de créer nos interfaces, mais aussi une nouvelle façon de penser le design : plus homogène, adaptable, maintenable, collaboratif… Brad Frost a, dans les premiers, théorisé ce qu’on appelle maintenant l’Atomic Design ! Une manière de designer nos interfaces, proche du développement objet, ne se contentant plus de juste créer des pages, mais partant du postulat de créer des composants que nous pourrons réutiliser et adapter en fonction du contexte.",
    "plus": "Réutilisant le Modular design, cette approche n’est pas récente et est déjà utilisée par de nombreuses équipes. Mais comment la mettre en pratique ? En quoi des logiciels comme Sketch et Adobe XD peuvent nous permettre de mettre facilement en place des styleguides et un design basé sur des composants ? Est-ce adapté aussi pour les petits projets ? \n\nC’est ce que nous découvririons dans ce Workshop qui sera composé d’une petite présentation du contexte d’une vingtaine de minutes, suivi d’une mise en pratique.",
    "eventId": "mix-it",
    "format": 49,
    "trackLabel": "Design",
    "difficulty": 2,
    "speaker": {
      "id": "2400",
      "email": "dylan.cozian@gmail.com",
      "lastname": "Cozian",
      "firstname": "Dylan",
      "bio": "Webdesigner de formation, touche à tout numérique et formateur en webdesign, pao et ux design ! Passionné de bonnes liqueurs et de tout ce qui se rapproche de prêt ou de loin à l’art, il distille ce qu’il sait sur la nouvelle chaîne Youtube Design & maracas avec une vidéo par semaine sur la veille numérique, mais aussi des tutos jasent de Sketch et ses plugins. En Freelance depuis 2010, contre vents et marrées, vous pouvez le retrouver sur son twitter. Tchatchatchat…",
      "company": "Dylan Cozian",
      "twitter": "DylanCozian",
      "googleplus": "https://plus.google.com/u/0/+DylanCozian",
      "github": null,
      "language": "fr",
      "gender": "MALE",
      "social": "https://medium.com/@DylanCozian",
      "imageProfilURL": "http://www.dylancozian.com/levrai/images/pp4.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "3182",
    "state": "ACCEPTED",
    "name": "Job Story : Penser autrement l'expression du besoin agile",
    "language": "Français",
    "description": "Si vous avez déjà travaillé sur un projet agile, vous avez sans doute rencontré la User Story. Vous avez même peut-être utilisé des \"persona\", ces fiches de personnage qui représentent un de vos utilisateurs type. Ces formats ont marqué une vraie étape dans l'évolution de la spécification agile et sont le support actuellement le plus largement utilisé pour la formalisation du besoin en mode agile.\n\nMais est-ce suffisant ? Est-ce que cela permet de capter l'essence du besoin ? Pas forcément !\n\nLa Job Story est une approche complémentaire, qui peut venir enrichir votre compréhension des attentes de vos clients, et vous aider à développer un super produit !",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Product",
    "difficulty": 1,
    "speaker": {
      "id": "1252",
      "email": "agabrillagues@ippon.fr",
      "lastname": "Gabrillagues",
      "firstname": "Anne",
      "bio": "Depuis une première rencontre avec l'Agilité en 2008, j'accompagne les équipes de développement en tant que Scrum Master, Product Owner ou Coach Agile.\nAgiliste convaincue, je participe activement à la diffusion de l'Agilité via l'organisation de Meetup et de conférences à Paris. J'ai fait partie de l'équipe organisatrice des 3 derniers ScrumDay et j'ai rejoint l'an dernier l'équipe Lean Kanban France. Parmi mes  projets personnels figurent aussi le développement du jeu d'apprentissage Kanbanzine et divers projets de traduction.",
      "company": "Ippon Technologies",
      "twitter": "@agabrillagues",
      "googleplus": null,
      "github": null,
      "language": "Français",
      "gender": "FEMALE",
      "social": "https://twitter.com/agabrillagues",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/495583307019468800/w_T6sErD_400x400.png"
    },
    "cospeakers": []
  },
  {
    "id": "3183",
    "state": "ACCEPTED",
    "name": "Designer/codeur, comment le métier et les outils du designer graphique évoluent",
    "language": "Français",
    "description": "L'environnement de travail du designer graphique évolue avec la création d’interfaces d’applications web. La programmation devient un milieu accessible pour ce dernier, et peut même nécessiter son expertise dans certains domaines (css, svg, canvas, javascript…) en collaboration avec le développeur.  \nL’outillage du designer graphique n’est donc plus limité aux interfaces graphiques de type WIMP (Windows, Icons, Menus, Pointing) comme Adobe, mais s’ouvre sur les interfaces textuelles de programmation. Sa méthode de travail peut désormais se rapprocher de celle du développeur.\n\nÀ travers un état des lieux des outils émergents, nous explorerons les nouvelles logiques de création d’interface, et de leurs évolutions possibles.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Design",
    "difficulty": 1,
    "speaker": {
      "id": "3455",
      "email": "azertypow@gmail.com",
      "lastname": "baldran",
      "firstname": "nicolas",
      "bio": "Actuellement étudiant en master media design à la [HEAD—Genève](https://www.hesge.ch/head/formations-recherche/master-en-media-design), Nicolas Baldran y pratique ses recherches sur le lien entre développeur et designer graphique à travers les outils et méthodes de travail de ce dernier.\n\nIl participe au projet [**Data2viz**.io](http://data2viz.io/), en tant que designer et développeur d’interface web.",
      "company": "data2viz",
      "twitter": "twitter.com/azertypow",
      "googleplus": null,
      "github": "github.com/azertypow",
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "http://data2viz.io/images/photo/nico@2x.png"
    },
    "cospeakers": []
  },
  {
    "id": "3186",
    "state": "ACCEPTED",
    "name": "Mieux communiquer en découvrant ses filtres d'attention",
    "language": "Français",
    "description": "Une grande difficulté de la communication vient de la conviction de parler la même langue que l'autre, de donner le même sens aux mots et de considérer les mêmes choses comme importantes. Et s'il en était autrement ?\n\nDepuis notre enfance, nous avons développé des automatismes liés à notre perception du monde et qui vont conditionner la manière dont nous nous comportons aujourd'hui. Même si cela peut être notre principal atout, c'est aussi notre principale limitation.",
    "plus": "Cette session se déroulera en 2 parties :\n- Découverte des 9 filtres d'attention par la pratique : vous comprendrez leur impact sur la structure d'une personnalité\n- Découverte d'un modèle de typologie de personnalité respectueux de la richesse et de l'unicité de chacun\n\nEn Agilité, on dit que les outils sont en support des individus et des interactions. C'est pourquoi je vous propose de découvrir cet incroyable outil de compassion afin d'apprendre à mieux vous connaître, mieux comprendre les autres et ainsi, interagir de manière plus efficace.",
    "eventId": "mix-it",
    "format": 49,
    "trackLabel": "Team",
    "difficulty": 1,
    "speaker": {
      "id": "3637",
      "email": "olivier.my@gmail.com",
      "lastname": "MY",
      "firstname": "Olivier",
      "bio": "Olivier est Coach professionnel et Coach Agile chez Soat où il accompagne ses clients dans l'optimisation de leur performance par l'intelligence collective. Passionné par les relations humaines, il cherche avant tout à redonner du sens aux pratiques utilisées en entreprise afin de stimuler plus de responsabilisation, de motivation et d'engagement.",
      "company": "Soat",
      "twitter": "@OyoMY",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "MALE",
      "social": "https://www.linkedin.com/in/oliviermy/, http://oyomy.fr/",
      "imageProfilURL": "https://media-exp2.licdn.com/mpr/mpr/shrinknp_400_400/p/2/005/069/32c/2b38793.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "3188",
    "state": "ACCEPTED",
    "name": "Peut-on être Agile sans être agile ?",
    "language": "Français",
    "description": "Avez-vous déjà rencontré des équipes qui constataient : « l’Agilité, on a essayé, mais ça n’a pas marché… » ? Peut-être même en avez-vous fait partie ? \nIl ne suffit peut-être pas de se déclarer Agile pour être agile !",
    "plus": "Comme dans toute transformation, les facteurs clés de succès se trouvent dans les Hommes plutôt que dans une recette à appliquer. Au-delà du marketing, il y a des talents à développer. \nComment développer les talents de chacun, pour qu’un groupe d’individus devienne une équipe, à l’écoute, co-responsable et agile ? \nQuels sont les points de vigilance à garder en tête pour conduire cette transformation, culturelle avant tout ?\nC’est ce que nous vous proposons d’aborder dans cet atelier qui intègrera à la fois des notions de neurosciences et des exercices pour vivre les concepts abordés.",
    "eventId": "mix-it",
    "format": 49,
    "trackLabel": "Team",
    "difficulty": 1,
    "speaker": {
      "id": "3479",
      "email": "njeauffroy@gmail.com",
      "lastname": "Jeauffroy",
      "firstname": "Nathalie",
      "bio": "En 2015, après 15 ans dans l'industrie, j'ai embrassé l'Agilité en amenant mon équipe sur le chemin de la gouvernance partagée.\nPlusieurs expériences de réorganisations m'avaient amenée au constat que les outilq et processus sont trop souvent privilégiés par rapport à l'accompagnement des Hommes. \nDans ce chemin vers l'Agilité, nous avons collectivement appris qu'il ne suffit pas de vouloir changer pour réussir et que chacun doit être soutenu dans son évolution.\nA ce jour, j'ai rejoint la société Youtopie pour me consacrer entièrement à l'accompagnement des Hommes.",
      "company": "Youtopie",
      "twitter": "@njeauffroy",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "FEMALE",
      "social": "",
      "imageProfilURL": ""
    },
    "cospeakers": []
  },
  {
    "id": "3193",
    "state": "ACCEPTED",
    "name": "Dataviz sans data: le prototypage rapide de visualisation de données.. sans données!",
    "language": "Français",
    "description": "Les dataviz sont de plus en plus populaires mais restent difficile à créer. \nCe workshop propose a pour but d'initier les participants aux méthodes de prototypes de visualisation de données sous forme de grids et de maquettes interactives, en noir et blanc. La particularité du prototypage sera d'être réalisé en live coding en JavaScript.",
    "plus": "Cela peut paraître surprenant en effet de ne pas prendre ni papier ni  crayon pour faire du sketching et semble limiter l'expressivité des prototypes et en plus demander des connaissances en programmation... \nMais ce compromis reste cependant acceptable car la programmation permet de rapidement générer des variations de design (notamment à partir d'exemples de maquettes telles que https://romsson.github.io/d3-gridding-infovis/example/capture/display.html) et ne vous demande pas non-plus de savoir bien dessiner ! En plus, cela facilitera grandement la transition vers des prototypes plus haute fidélité en transformant les prototypes réalisés en JavaScript vers un chart interactif et en couleur.\n\nLes particpants de ce workshops apprendront :\n-Les bases du design graphique (grids, proportions, explorations de design)\n-L'implementation de grids en JavaScript et leur mapping avec des données temporaires (mais réalistes)\n-La mise en page et le raffinement de design\n-Exporter ces prototypes (SVG/HTML/autre) et y inclure les données finales\n-Rendre le graphique interactif et comportant des transitions animées",
    "eventId": "mix-it",
    "format": 49,
    "trackLabel": "Design",
    "difficulty": 2,
    "speaker": {
      "id": "954",
      "email": "romain.vuillemot@gmail.com",
      "lastname": "Vuillemot",
      "firstname": "Romain",
      "bio": "Ma bio",
      "company": "LIRIS Ecole Centrale de Lyon",
      "twitter": "romsson",
      "googleplus": "https://twitter.com/romsson",
      "github": "https://github.com/romsson/",
      "language": "Français",
      "gender": "MALE",
      "social": "https://www.linkedin.com/in/romainvuillemot",
      "imageProfilURL": "http://romain.vuillemot.net/img/romain-vuillemot.png"
    },
    "cospeakers": []
  },
  {
    "id": "3194",
    "state": "ACCEPTED",
    "name": "Designers et Logiciels libres: et si on collaborait ?",
    "language": "Français",
    "description": "Le monde du libre est rempli de communautés de développeurs passionnés. *Mais où sont les designers ?* Incompréhensions entre les différents corps de métier, méconnaissance de ce qu'est un logiciel libre, légende du designer-artiste qui n'en fait qu'à sa tête, possibilités de contribuer mal adaptées pour des designers, les origines de ce désamour sont nombreuses. Et si on passait à l'étape suivante, celle où devs et designers du libre se rejoignent pour créer des logiciels ensemble, histoire d'en améliorer l'expérience utilisateur ?",
    "eventId": "mix-it",
    "format": 48,
    "trackLabel": "Design",
    "difficulty": 1,
    "speaker": {
      "id": "3595",
      "email": "smogo@maiwann.net",
      "lastname": "Lenoir",
      "firstname": "Maïtané",
      "bio": "**UX·UI Designer freelance** qui conçoit pour tou·te·s afin de créer un monde **éthique & inclusif** où chacun·e puisse se sentir **légitime.** Je découvre, crée et partage accompagnée de personnes fiables et inspirantes, dans le respect de mes valeurs et toujours avec enthousiasme !",
      "company": null,
      "twitter": "@maiwann_",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "FEMALE",
      "social": "https://www.maiwann.net",
      "imageProfilURL": "http://www.maiwann.net/img/photo_profil.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "3207",
    "state": "ACCEPTED",
    "name": "Lego VS Kapla : Problématiques DevOps par le jeu",
    "language": "Français",
    "description": "Le workshop proposé est un atelier ludique de sensibilisation aux problématiques \"DevOps\", réunissant :  \n-  les \"Devs\" qui réalisent des fonctionnalités en nombre\n- et les \"Ops\" ou Operationnels (Equipe d'Exploitation) qui doivent garantir un système stable en Production.\n\nNous avons joué quelques sessions de \"Lego4DevOps\" sous la bienveillance du Cara Lyon puis de l'agile Grenoble... et certains nous ont mis au défi de tester la version \"Kapla\" !",
    "plus": "D'où l'idée d'une session mettant les 2 \"jeux de constructions\" à l'epreuve  des équipes Dev&Ops qui voudront tenter l'expérience, agrémentée au fil des itérations par quelques péripéties tirées de la vie réelle des projets.\n\nNote : Ce workshop s'adresse à un public large et ne nécessite pas de connaissances techniques.",
    "eventId": "mix-it",
    "format": 49,
    "trackLabel": "Maker",
    "difficulty": 1,
    "speaker": {
      "id": "3594",
      "email": "tamara.kondakjian@gmail.com",
      "lastname": "Kondakjian",
      "firstname": "Tamara",
      "bio": "Manager Practice \"Delivery Agile\"",
      "company": "Keyrus",
      "twitter": "TamKdk",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "FEMALE",
      "social": "https://www.linkedin.com/in/tamara-kondakjian-55943592/",
      "imageProfilURL": null
    },
    "cospeakers": [
      {
        "id": "3652",
        "email": "perretmathieu1@gmail.com",
        "lastname": null,
        "firstname": null,
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "3208",
    "state": "ACCEPTED",
    "name": "Comment Leboncoin est passé en feature teams",
    "language": "Français",
    "description": "Leboncoin est le site de référence français de la petite annonce en ligne. Le site a été construit de manière empirique, sur la bonne volonté et le courage des personnes. Mais ce mode de fonctionnement ne passe pas à l’échelle. Aujourd’hui,nous sommes plus de 500 personnes et l’entreprise doit réinventer son organisation. ",
    "plus": "Après être passé du cycle en V aux méthodes agiles (scrum), nous nous sommes rendu compte que cela n’était pas suffisant et qu’il fallait changer notre mode de fonctionnement en profondeur. A travers cette présentation, nous allons vous raconter les différentes étapes, les phases de doutes et d’euphorie que nous avons vécues lors de cette transformation qui nous menés sur la route des features teams.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Team",
    "difficulty": 1,
    "speaker": {
      "id": "3640",
      "email": "rogelio.canedo@gmail.com",
      "lastname": "Canedo",
      "firstname": "Rogelio",
      "bio": "Manager et scrum master chez Leboncoin, je suis passionné par l’agilité et plus globalement par les interactions entre les personnes.",
      "company": "Leboncoin",
      "twitter": null,
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": null
    },
    "cospeakers": []
  },
  {
    "id": "3222",
    "state": "ACCEPTED",
    "name": "Software on the road: the journey",
    "language": "English",
    "description": "Have you wondered how would it be to quit your job, take a backpack, and be on the road 24/7? \n\nThrough a continuous stream of audiovisual material captured during his trip, Dani takes you into an inspiring journey visiting local communities, sharing good vibes & crafting software.\n\n6 months and 13 countries later, and having hitch-hiked in the Albanian mountains, philosophized with a jewelry crafter in Mallorca, danced reggae in Jamaica and couchsurfed all over the place, he's back to share part of his adventures with us.\n\nAll in all, he just want to spread happiness around. Are you in?",
    "eventId": "mix-it",
    "format": 48,
    "trackLabel": "Alien",
    "difficulty": 1,
    "speaker": {
      "id": "3632",
      "email": "dan@dcarral.org",
      "lastname": "Carral",
      "firstname": "Daniel",
      "bio": "Passionate about kindness and code quality, I advocate eXtreme Programming practices and Software Crafting communities. \n\nBorn in Oviedo (Asturias, Spain), I moved to Berlin years ago fascinated by, among others, the constant knowledge exchange among members of local software development communities and user groups.\n\nThere I worked as Software Engineer in Babbel, where I joined the Monetization team (a.k.a. Payments) to later on switch to a R&D project exploring the application of adaptive learning to digital language learning.\n\nInspired by Corey Haines and its famous “Pair programming tour”, in summer 2017 I took a backpack and boarded on an epic journey visiting local communities, sharing good vibes & knowledge.",
      "company": null,
      "twitter": "dcarral",
      "googleplus": null,
      "github": "dcarral",
      "language": "en",
      "gender": "MALE",
      "social": "linkedin.com/in/dcarral, speakerdeck.com/dcarral",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/631438474206412800/syNZc4zm_400x400.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "3247",
    "state": "ACCEPTED",
    "name": "Modern Android Development",
    "language": "English",
    "description": "The past several years has seen the introduction of new functionality and practices into core Android development, with such elements as the Support Library, Architecture Components, and Kotlin. But all of the old programming approaches still work. So what's an Android developer supposed to do?\n\nThis talk will not only cover these new aspects of Android development; we will talk about *why* they exist and how to understand modern development of Android applications. Developers will leave with a better idea of what they should  know and use in their projects.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "2670",
      "email": "romainguy@curious-creature.com",
      "lastname": "Guy",
      "firstname": "Romain",
      "bio": "Romain has been working on Android at Google since before Android 1.0. He previously lead the Android UI Toolkit team, and the Android Graphics team. He spent years working on the UI toolkit and hardware accelerated rendering pipeline, and is now working on a new UI and graphics related projects.",
      "company": "Google",
      "twitter": "@romainguy",
      "googleplus": "+RomainGuy",
      "github": "https://github.com/romainguy",
      "language": "en",
      "gender": "MALE",
      "social": "http://www.curious-creature.com",
      "imageProfilURL": "https://drive.google.com/open?id=0BzaZIbtFMTjNcHVhQU5LdmpWNU0"
    },
    "cospeakers": [
      {
        "id": "3596",
        "email": "graphicsgeek1@gmail.com",
        "lastname": "Haase",
        "firstname": "Chet",
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "3276",
    "state": "ACCEPTED",
    "name": "Comment réveiller l'ingénieur positif présent en chacun de nous ?",
    "language": "Français",
    "description": "Cette conférence c'est l'histoire d'Isabelle Huynh, de son changement d'ingénieur développement pour un grand groupe à exploratrice de l'Ingénierie Positive. Mais c'est aussi l'histoire de ses rencontres à travers le monde. Des entrepreneurs, des ingénieurs et chercheurs qui chaque jour cherchent à améliorer la vie des personnes. Quelles sont les clefs qui déclenchent de tels parcours ? \n\nIsabelle l'assure, on a tous quelque chose en nous de positif. Elle vous invite à le découvrir.",
    "eventId": "mix-it",
    "format": 50,
    "trackLabel": "Alien",
    "difficulty": 1,
    "speaker": {
      "id": "3675",
      "email": "isabll.huynh@gmail.com",
      "lastname": "Huynh",
      "firstname": "Isabelle",
      "bio": "Isabelle Huynh est fondatrice de **La Clavette**. \n\nAprès avoir travaillé en tant qu’Ingénieur mécanique sur des produits grand public, a 24 ans elle a quitté son poste pour explorer le concept d’Ingénierie Positive. Une vision de l'Ingénierie combinant l'innovation, l’épanouissement des employés et la résolution d’enjeux sociaux.\n\nPendant 6 mois elle est partie en Asie et Amérique latine pour filmer des projets mettant la technologie au service des individus et les diffuser sur Internet. De retour en France elle dédie désormais son énergie à amener l’Ingénierie Positive en école d’ingénieurs, dans les entreprises et lors d’événement grand public.",
      "company": "La Clavette",
      "twitter": "https://twitter.com/IsaHuynh",
      "googleplus": "isabll.huynh@gmail.com",
      "github": null,
      "language": "fr",
      "gender": "FEMALE",
      "social": "www.laclavette.fr--, https://www.facebook.com/laclavette, https://www.linkedin.com/in/isabelle-huynh-27304536/",
      "imageProfilURL": "http://www.laclavette.fr/wp-content/uploads/2018/01/Isabelle-H-La-clavette.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "3285",
    "state": "ACCEPTED",
    "name": "Applications Web avec Spring Boot 2.0",
    "language": "Français",
    "description": "Avec Spring Boot 2.0, de nouveaux choix s'offrent à vous. Vous pouvez maintenant écrire des applications réactives avec Spring WebFlux et continuer de profiter des fonctionnalités de Spring Boot.\n\nPendant cette session de live coding, Stéphane et Brian vont écrire une application WebFlux et montrer comment utiliser Actuator, Developer Tools et plus encore.",
    "plus": "Spring Boot 2.0 offre de nombreuses améliorations et nouvelles fonctionnalités: nouveaux cas d'utilisation, nouveaux serveurs supportés (avec Netty), mais aussi nouvelles variantes d'applications Web: Spring WebFlux permet d'utiliser des annotations comme pour Spring MVC, mais aussi une nouvelle approche fonctionnelle avec \"WebFlux.fn\".\n\nAvec sa version 2.0, Spring Boot donne aux applications WebFlux les mêmes facilités:\n\n* auto-configuration des applications web\n* configuration de vos apps avec clés de configuration et callbacks\n* Actuators et Developer Tools\n* Support de Spring Data et Spring Security",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "1910",
      "email": "snicoll@pivotal.io",
      "lastname": "Stéphane",
      "firstname": "Nicoll",
      "bio": "Stéphane has a thing for code quality and robustness. He's been spreading the word for more than ten years while developing large scale Java enterprise applications in the geospatial, financial, or logistics sectors. An Apache Maven PMC member since 2006, he joined the core Spring Framework development team early 2014, being one of the main contributors to both Spring Framework and Spring Boot since. During his free time, he loves traveling around the world.",
      "company": "Pivotal",
      "twitter": "snicoll",
      "googleplus": null,
      "github": "snicoll",
      "language": "Français",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://lh5.googleusercontent.com/-Z-fY5u0ZtX8/AAAAAAAAAAI/AAAAAAAAAEk/XrzcHQMl1sU/photo.jpg"
    },
    "cospeakers": [
      {
        "id": "3672",
        "email": "bclozel@pivotal.io",
        "lastname": "clozel",
        "firstname": "brian",
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "3294",
    "state": "ACCEPTED",
    "name": "Scruter pour mieux comprendre : Deep Learning et mécanismes d'attention",
    "language": "Français",
    "description": "L’apprentissage profond de représentations (le Deep Learning) est une famille de méthodes du domaine « intelligence artificielle » permettant d’apprendre de connaissances à partir de masses de données (textes, images, vidéos etc.). Plus précisément, ces modèles permettent de faire des prédictions sur des nouvelles données. Cette intervention passera en revue l’historique de cette thématique, les enjeux majeurs et quelques techniques clé. ",
    "plus": "Ensuite, elle présentera un concept récent, les mécanismes d'attention. Comme un humain scrutant une scène par des mouvements oculaires, ces méthodes permettent à un réseau de neurones de se focaliser sur une partie pertinente des données d'entrée : une partie d'un visage pour la reconnaissance faciale ou une partie d'une phrase pour la traduction.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "3677",
      "email": "flonks@gmail.com",
      "lastname": "Wolf",
      "firstname": "Christian",
      "bio": "Christian WOLF is associate professor (Maitre de Conférences, HDR) at INSA de Lyon and LIRIS UMR 5205, a CNRS laboratory, since 2005. Since September 2017 he is on leave at INRIA and the CITI laboratory. He is interested in computer vision and machine learning, deep learning, especially in the visual analysis of complex scenes in motion: gesture and activity recognition and pose estimation. In his work he puts an emphasis on models of complex interactions, on structured models, graphical models and on deep learning.",
      "company": "INSA-Lyon, INRIA",
      "twitter": "https://twitter.com/chriswolfvision",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "MALE",
      "social": "http://liris.cnrs.fr/christian.wolf/",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/872468249023315969/HPPJS080_400x400.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "3359",
    "state": "ACCEPTED",
    "name": "Principles for Data Visualization Design",
    "language": "English",
    "description": "Data visualization is the process of making numeric data visual, such as in charts and graphs and maps and networks.  I'll go over some basic chart design principles for communicating clearly, and show examples of excellent static and interactive charts created primarily by data journalists to communicate to a wide audience. We will finish with some discussion of using multiple charts and interactive techniques to tell a data \"story.\"",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Design",
    "difficulty": 1,
    "speaker": {
      "id": "3713",
      "email": "arnicas@gmail.com",
      "lastname": "Cherny",
      "firstname": "Lynn",
      "bio": "Lynn Cherny is an Associate Professor in emlyon business school's new Data R&D Institute, teaching data science courses.  Previously, she was a consultant in data analysis and visualization for 6 years; and prior to that she did UX design for software companies for 18 years.  Her Ph.D. is in Linguistics from Stanford University.",
      "company": "em-lyon business school",
      "twitter": "@arnicas",
      "googleplus": null,
      "github": "arnicas",
      "language": "en",
      "gender": "FEMALE",
      "social": "",
      "imageProfilURL": null
    },
    "cospeakers": []
  },
  {
    "id": "3367",
    "state": "ACCEPTED",
    "name": "Coaching à tous les étages",
    "language": "Français",
    "description": "Cette présentation traitera des questions essentielles : de l’intégration d’un nouvel arrivant dans une entreprise, à l’encouragement de la progression individuelle, en passant par le bien-être au travail de tous. La solution miracle (ou une partie du miracle) ? Le pair coaching maison ! Nous vous expliquerons tout de ce système que nous avons mis en place l’an dernier et continuons à améliorer depuis. Un coach (coaché) et une coachée viennent vous présenter la méthode (“du bonheur”).",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Team",
    "difficulty": 1,
    "speaker": {
      "id": "1581",
      "email": "nicolas.savois@gmail.com",
      "lastname": "Savois",
      "firstname": "Nicolas",
      "bio": "CTO  depuis quelques années.\n\nD’abord d'une startup interne dans une grand banque puis dans une ESN pour la transformer en ESN 2.0 (...) \n\nFan d’Elixir, de Programmation Fonctionnel, et d'Agilité.\n\nJe pense que l'IT en France a raté pas mal de virage technologique et méthodologique et n'est pas en train de prendre de virage du tout... j'essaye d’éduquer mes clients et collègues pour que ça change !\n\n[LinkedIn](https://www.linkedin.com/in/savoisn/)",
      "company": null,
      "twitter": "@nicosavois",
      "googleplus": null,
      "github": "https://github.com/savoisn",
      "language": "Français",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://avatars3.githubusercontent.com/u/576605?v=3&u=cc56001db37d31f6885ab0c3c6f2e0d9257ac4fd&s=400"
    },
    "cospeakers": [
      {
        "id": "3737",
        "email": "ambalaurelie@gmail.com",
        "lastname": null,
        "firstname": null,
        "bio": null,
        "company": null,
        "twitter": null,
        "googleplus": null,
        "github": null,
        "language": null,
        "gender": "MALE",
        "social": null,
        "imageProfilURL": null
      }
    ]
  },
  {
    "id": "3399",
    "state": "ACCEPTED",
    "name": "Marvel X DC : rétro-futurisme du super héros",
    "language": "Français",
    "description": "A l'ère du Digital, l'édition papier est dépassée. Pourtant, les super-héros sont partout, et ils viennent du papier... Oui, mais d'où viennent-ils, finalement ? Si tout le monde sait que Hulk est un Marvel, que Batman vient de DC, quid d'Aquaman ? Hawkeye ? C'est quoi la différence avec _The Arrow_ ? Et comment fait-on quand on est un héros de 80 ans pour relancer une nouvelle histoire tous les deux ans, en gardant un air de jeune premier ?\n\nSi les super-héros ont généralement une Némésis, les deux maisons que sont Marvel et DC ont passé les cinquante dernières années à se battre à coup de pages de comics, comment ont-elles fait pour rester en vie ? Pour innover ? Pour garder un public ?\n\nCette conférence sera l'occasion d'un parcours balistique dans l'histoire des batailles entre la \"Maison des Idées\" et la Batcave, pour visiter les stratégies et techniques qui ont permis de développer des marques connues, une production qui s'accroit encore aujourd'hui, et qui est sortie (en bien ou pas) du papier pour monter sur d'autres supports.\n\nEt comme le blabla c'est pénible, cette session sera largement interactive, pour que tous les participants sortent avec le sentiment que quand on se met en colère, on ne devient pas forcément vert.\n\n>**Simeon : ** Mais alors, c'est qui le plus fort, Hulk ou Superman ?\n>\n>**Karah : ** Tout le monde sait ça voyons !\n>\n>**Simeon :** D'accord, mais quand même Superman il est super fort avec sa cape",
    "eventId": "mix-it",
    "format": 48,
    "trackLabel": "Alien",
    "difficulty": 1,
    "speaker": {
      "id": "3764",
      "email": "s.wojewoda@gmail.com",
      "lastname": "Wojewoda",
      "firstname": "Stéphane",
      "bio": "Ma passion : rester à la pointe des tendances tech et culture. Ma mission : aider les individus et leurs entreprises à grandir à un rythme soutenable. Mon sourire : quand les équipes que j'accompagne comprennent pourquoi elles font ce qu'elles font, et parviennent à bien faire les bonnes choses au bon moment avec un effort just suffisant. Ce qui me rend encore plus heureux : voir le sourire de ma fille qui grandit. Et elle le fait plus vite que les entreprises",
      "company": "Renault Digital",
      "twitter": "stephanewww",
      "googleplus": null,
      "github": "stephanewww",
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": null
    },
    "cospeakers": []
  },
  {
    "id": "3428",
    "state": "ACCEPTED",
    "name": "Une bonne intelligence artificielle doit-elle pouvoir s’émouvoir ?",
    "language": "Français",
    "description": "Si vous deviez créer une intelligence artificielle, la programmeriez-vous de telle sorte qu’elle puisse aussi éprouver des émotions ? Que nous apportent réellement les émotions, et seraient-elles vraiment nécessaires au bon fonctionnement d’une intelligence artificielle ? De nombreuses personnes, tout comme certains philosophes, considèrent parfois que la vie serait bien meilleure sans émotions (Shaffer, 1983). Celles-ci, en effet, nous font souvent agir d’une façon apparemment irrationnelle. La colère, par exemple, nous conduit à formuler des remarques blessantes que nous regrettons aussitôt, l’embarras peut nous rendre maladroits en société, et l’angoisse nous amène à accorder trop d’importance à des détails complètement anodins. A cela s’ajoute encore le fait que certaines émotions, comme la honte ou la culpabilité, sont tout simplement désagréables à éprouver. De ce point de vue, nous envions parfois le calme et la rationalité parfaite de certains personnages fictionnels comme Monsieur Spock. En suivant cette approche, il serait donc tentant de penser qu’une intelligence artificielle optimale fonctionnerait bien mieux indépendamment de toute émotion. ",
    "plus": "D’un autre côté, la vie nous paraîtrait sûrement très fade sans émotions. Celles-ci donnent une certaine couleur à nos pensées, ainsi qu’aux évènements que nous traversons. Par ailleurs, de nombreuses études montrent que les émotions semblent jouer un rôle crucial dans nos prises de décision (Damasio, 1994), dans le développement de la moralité (Nichols, 2004), ou plus généralement dans la valeur que nous accordons aux choses ou aux personnes. Selon cette approche, nos émotions interviendraient ainsi principalement dans notre capacité à évaluer la pertinence de certains évènements en regard des choses qui nous importent (Sander, 2012).\n\nAu cours de cette conférence, je m’attacherai ainsi à passer en revue les différentes raisons pour lesquelles nous pourrions vouloir octroyer des émotions à une intelligence artificielle. J’examinerai d’abord les raisons susceptibles de militer en faveur d’une intelligence artificielle froide ou non émotionnelle, et je monterai qu’aucune de ces raisons ne plaide vraiment contre les émotions en elles-mêmes, mais plutôt contre les limites de notre propre intelligence. Je passerai ensuite en revue les différents rôles que les émotions sont susceptibles de jouer dans notre activité mentale et cognitive, et je soutiendrai qu’il existe des raisons solides de préférer une intelligence artificielle émotionnelle à une intelligence artificielle dépourvue d’émotions, raisons qui sont basées principalement sur les interactions entre la cognition et les émotions. Je montrerai ainsi qu’il n’est pas si regrettable que nous soyons nous-mêmes des créatures émotives, quoique nos réactions émotionnelles soient souvent imparfaites.",
    "eventId": "mix-it",
    "format": 50,
    "trackLabel": "Alien",
    "difficulty": 1,
    "speaker": {
      "id": "3768",
      "email": "samuel.lepine@gmail.com",
      "lastname": "Lepine",
      "firstname": "Samuel",
      "bio": "Philosophy of emotions and moral psychology",
      "company": "Université Lyon 3",
      "twitter": "@TrashtalkingSam",
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://univ-lyon3.academia.edu/SamuelLepine"
    },
    "cospeakers": []
  },
  {
    "id": "3450",
    "state": "ACCEPTED",
    "name": "WTFrance",
    "language": "Français",
    "description": "La France fait partie des pays qui cherchent à affaiblir le chiffrement,\nvia l'obligation d'installer des portes dérobées par exemple. Le\nchiffrement peut déjà en France être un motif d'augmentation des peines,\nou en faire un motif de suspicion. Les déclarations contre le\nchiffrement s’enchaînent et une réflexion est en cours au niveau\neuropéen pour mettre en œuvre une stratégie commune au sein de l'Union\neuropéenne.\nNotre objectif est donc d'essayer de renverser la tendance et de montrer\nque les développeurs ont aussi un rôle politique important.",
    "eventId": "mix-it",
    "format": 48,
    "trackLabel": "Hack/Activism",
    "difficulty": 1,
    "speaker": {
      "id": "1144",
      "email": "adc@laquadrature.net",
      "lastname": "de Cornulier",
      "firstname": "Agnès",
      "bio": "Coordinatrice de l'analyse juridique et politique à La Quadrature du Net, Agnès travaille notamment sur les questions de chiffrement et ses enjeux en termes de protection de la vie privée et de confidentialité des communications.",
      "company": "La Quadrature du Net",
      "twitter": null,
      "googleplus": null,
      "github": null,
      "language": "fr",
      "gender": "FEMALE",
      "social": "https://laquadrature.net/fr",
      "imageProfilURL": null
    },
    "cospeakers": [{
      "id": "1",
      "email": "okhin@laquadrature.net",
      "lastname": "",
      "firstname": "Okhin",
      "bio": "Okhin est responsable des outils à La Quadrature du Net et à ce titre il participe à la réflexion sur les enjeux politiques et techniques liés au chiffrement.",
      "company": "La Quadrature du Net",
      "gender": "MALE",
      "social": "https://laquadrature.net/fr",
      "language": "fr"
    }]
  },
  {
    "id": "3452",
    "state": "ACCEPTED",
    "name": "Keynote Yves Rosseti",
    "language": "Français",
    "description": "TODO",
    "eventId": "mix-it",
    "format": 50,
    "trackLabel": "Alien",
    "difficulty": 1,
    "speaker": {
      "id": "804",
      "email": "mathieu.petitdant@gmail.com",
      "lastname": "Petitdant",
      "firstname": "Mathieu",
      "bio": "todo",
      "company": "freelance",
      "twitter": "mpetitdant",
      "googleplus": null,
      "github": "mpetitdant",
      "language": "Français",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": null
    },
    "cospeakers": []
  },
  {
    "id": "3455",
    "state": "ACCEPTED",
    "name": "Beyond Scrum",
    "language": "English",
    "description": "TODO",
    "eventId": "mix-it",
    "format": 49,
    "trackLabel": "Team",
    "difficulty": 1,
    "speaker": {
      "id": "804",
      "email": "mathieu.petitdant@gmail.com",
      "lastname": "Petitdant",
      "firstname": "Mathieu",
      "bio": "todo",
      "company": "freelance",
      "twitter": "mpetitdant",
      "googleplus": null,
      "github": "mpetitdant",
      "language": "Français",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": null
    },
    "cospeakers": []
  },
  {
    "id": "3607",
    "state": "ACCEPTED",
    "name": "JUnit 5 — New Opportunities for Testing on the JVM",
    "language": "English",
    "description": "Take a Deep Dive into JUnit 5 with core committer Sam Brannen!\n\nOver the last decade a lot has happened in the world of Java and testing, but JUnit 4 hasn't kept up. Now JUnit 5 is here to help shape the future of testing on the JVM with a focus on Java 8 language features, extensibility, and a modern programming API for testing in Java. Moreover, JUnit isn't just a Java testing framework anymore. Third parties are already developing test engines for Scala, Groovy, Kotlin, etc. that run on the new JUnit Platform.",
    "plus": "This session starts off with an overview of the inspiration for & architecture of JUnit 5, from launchers to test engines. Sam will then take the audience on a live coding tour, highlighting support for tagging, custom display names, dependency injection, repeated tests, parameterized tests, conditional test execution, lambda expressions for assertions, assumptions, & dynamic tests, and implementing tests via interface default methods (a.k.a., testing traits).\n\nNext, Sam will present the new extension model in JUnit Jupiter, discussing how to author and register extensions for conditional tests, parameter resolution (a.k.a., dependency injection), lifecycle callbacks, & more.\n\nTo round off the session, Sam will quickly showcase the new JUnit Jupiter support in Spring Framework 5.0.",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 2,
    "speaker": {
      "id": "3877",
      "email": "sam@sambrannen.com",
      "lastname": "Brannen",
      "firstname": "Sam",
      "bio": "Sam Brannen is an enterprise Java developer with 20 years of experience and co-founder of Swiftmind, a software consulting agency in Zurich, Switzerland. At Swiftmind Sam helps international clients achieve best practices in software development, architecture, design, implementation, and testing of enterprise Java applications using the Spring Framework, JUnit, and a plethora of open source technologies.\n\nSam is a popular speaker at conferences on Java and Spring. He is also an active core committer for the Spring Framework and JUnit 5 as well as the author and maintainer of Spring's testing framework.",
      "company": "Swiftmind",
      "twitter": "sam_brannen",
      "googleplus": null,
      "github": "sbrannen",
      "language": "en",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": "https://pbs.twimg.com/profile_images/331969099/Sam_Brannen_business_casual_closeup_square_400x400.jpg"
    },
    "cospeakers": []
  },
  {
    "id": "3637",
    "state": "ACCEPTED",
    "name": "Random Joshua",
    "language": "English",
    "description": "TBD",
    "eventId": "mix-it",
    "format": 48,
    "trackLabel": "Maker",
    "difficulty": 1,
    "speaker": {
      "id": "804",
      "email": "mathieu.petitdant@gmail.com",
      "lastname": "Petitdant",
      "firstname": "Mathieu",
      "bio": "todo",
      "company": "freelance",
      "twitter": "mpetitdant",
      "googleplus": null,
      "github": "mpetitdant",
      "language": "Français",
      "gender": "MALE",
      "social": "",
      "imageProfilURL": null
    },
    "cospeakers": []
  },
  {
    "id": "3638",
    "state": "ACCEPTED",
    "name": "Webassembly",
    "email": "hi@benj.me",
    "language": "Français",
    "description": "tbd",
    "eventId": "mix-it",
    "format": 43,
    "trackLabel": "Tech",
    "difficulty": 1,
    "speaker": {
      "id": "804",
      "email": "hi@benj.me",
      "lastname": "Bouvier",
      "firstname": "Benjamin",
      "language": "Français",
      "gender": "MALE"
    },
    "cospeakers": []
  }
]